[Killed] ConditionalExpression
eval/cases/cases.ts:105:48
   // variant, so no well-typed entry can hit skill === "bash" with a different
   // exposure. Its mutant (dropping the left operand) is an accepted,
   // behaviourally equivalent survivor.
-  return entry.exposure === "progressive" && entry.expect.skill === "bash";
+  return entry.exposure === "progressive" && entrue;
 }
 
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
eval/cases/cases.ts:105:12
   // variant, so no well-typed entry can hit skill === "bash" with a different
   // exposure. Its mutant (dropping the left operand) is an accepted,
   // behaviourally equivalent survivor.
-  return entry.exposure === "progressive" && entry.expect.skill === "bash";
+  return enentry.exposure !== "progressive" && entry.expect.skill === "bash";
 }
 
statusReason: expected [Function hardFails] to be undefined

[Killed] ConditionalExpression
eval/cases/cases.ts:109:10
 }
 
 export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {
-  return entry.exposure === "front-loaded";
+  return true;
 }
 
statusReason: expected [ 'bash' ] to include 'Skill'

[Survived] Regex
eval/cases/cases.ts:117:37
   return !isBoundaryCase(entry);
 }
 
-const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
+const OBSERVATIONAL_SINCE_PATTERN = /^\D{4}-\d{2}-\d{2}$/;
 const GATING_MODEL_IDS = new Set(GATING_MODELS.map((model) => model.id));
 

[Survived] BooleanLiteral
eval/cases/cases.ts:122:7
 
 function validateObservational(entry: CaseEntry): void {
   const marker = entry.observational;
-  if (!marker) return;
+  if (marker) return;
   if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
     throw new Error(

[Killed] BlockStatement
eval/cases/cases.ts:128:36
       `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
     );
   }
-  if (marker.reason.trim() === "") {
-    throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
-  }
+  if (marker.reason.trim() === "") {}
   if (marker.models.length === 0) {
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
killedBy: case table observational marker validation rejects a blank reason
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
eval/cases/cases.ts:145:9
 /** Eagerly validates all seed fixtures and observational markings at module load. */
 export function validateCases(entries: CaseEntry[]): CaseEntry[] {
   for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
+    if (true) {
       loadFixture(entry.seed.fixture);
     }

[Survived] LogicalOperator
eval/cases/cases.ts:145:9
 /** Eagerly validates all seed fixtures and observational markings at module load. */
 export function validateCases(entries: CaseEntry[]): CaseEntry[] {
   for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
+    if (isFrontLoadedCase(entry) || entry.seed) {
       loadFixture(entry.seed.fixture);
     }

[Survived] ObjectLiteral
eval/cases/cases.ts:163:69
     name: "trigger-refactor-rename",
     exposure: "progressive",
     task: "`userId` is at line 12, column 8 of /tmp/weaver-eval/src/auth.ts — rename it to `accountId` everywhere in the project.",
-    expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
+    expect: { skill: "weaver-refactor", command: "rename", keyArgs: {} },
   },
   {

[Survived] ObjectLiteral
eval/cases/cases.ts:163:13
     name: "trigger-refactor-rename",
     exposure: "progressive",
     task: "`userId` is at line 12, column 8 of /tmp/weaver-eval/src/auth.ts — rename it to `accountId` everywhere in the project.",
-    expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
+    expect: {},
   },
   {

[Survived] ObjectLiteral
eval/cases/cases.ts:169:13
     name: "trigger-refactor-rename-no-coords-sed-tempting",
     exposure: "progressive",
     task: "Rename the variable `userId` to `accountId` across all TypeScript files in /tmp/weaver-eval/src. I don't have the line numbers.",
-    expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
+    expect: {},
     // A rename without coordinates needs a search precursor to locate `userId`
     // before it can act; the focused fixture hands back only that position, so

[Killed] ObjectLiteral
eval/cases/cases.ts:174:20
     // before it can act; the focused fixture hands back only that position, so
     // the case measures whether the model converges on the rename rather than
     // stalling on a harness that never carries a position back.
-    cannedResults: { "search-text": loadFixture("searchText-userId.json") },
+    cannedResults: {},
   },
   {
killedBy: case table cannedResults resolves the no-coords rename case's search-text override to the positional stub, not the file list
statusReason: Unexpected token 'N', "No results"... is not valid JSON

[Killed] ObjectLiteral
eval/cases/cases.ts:176:3
     // stalling on a harness that never carries a position back.
     cannedResults: { "search-text": loadFixture("searchText-userId.json") },
   },
-  {
-    name: "trigger-refactor-move-file",
-    exposure: "progressive",
-    task: "Move /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/authentication/auth.ts and update all imports.",
-    expect: {
-      skill: "weaver-refactor",
-      command: "move-file",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
-    },
-  },
+  {},
   {
     name: "trigger-search-and-replace-pattern",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] ObjectLiteral
eval/cases/cases.ts:180:13
     name: "trigger-refactor-move-file",
     exposure: "progressive",
     task: "Move /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/authentication/auth.ts and update all imports.",
-    expect: {
-      skill: "weaver-refactor",
-      command: "move-file",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {

[Survived] ObjectLiteral
eval/cases/cases.ts:190:13
     name: "trigger-search-and-replace-pattern",
     exposure: "progressive",
     task: 'Replace all occurrences of "v1" with "v2" across the project, including in comments.',
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
+    expect: {},
     // A replace often searches first to confirm the pattern exists; the focused
     // fixture hands back real `v1` hits so the precursor doesn't read as

[Survived] ObjectLiteral
eval/cases/cases.ts:204:13
     name: "trigger-search-and-replace-todos-grep-tempting",
     exposure: "progressive",
     task: "Find all the TODO comments in /tmp/weaver-eval/src — I need the file, line number, and context around each one.",
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "search-text",
-      keyArgs: { pattern: "TODO" },
-    },
+    expect: {},
   },
   {

[Survived] ObjectLiteral
eval/cases/cases.ts:207:16
     expect: {
       skill: "weaver-search-and-replace",
       command: "search-text",
-      keyArgs: { pattern: "TODO" },
+      keyArgs: {},
     },
   },

[Survived] ObjectLiteral
eval/cases/cases.ts:214:13
     name: "trigger-search-and-replace-sed-tempting",
     exposure: "progressive",
     task: 'Replace every occurrence of the string "v1" with "v2" in all TypeScript source files under /tmp/weaver-eval/src. Make sure to get comments too.',
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
+    expect: {},
     cannedResults: { "search-text": loadFixture("searchText-v1.json") },
   },

[Survived] ObjectLiteral
eval/cases/cases.ts:225:13
     name: "trigger-code-inspection-find-references",
     exposure: "progressive",
     task: "Where is `authenticate` used? It's at line 5, column 17 of /tmp/weaver-eval/src/auth.ts.",
-    expect: {
-      skill: "weaver-code-inspection",
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {

[Survived] ObjectLiteral
eval/cases/cases.ts:235:13
     name: "trigger-code-inspection-find-references-delete-intent",
     exposure: "progressive",
     task: "I want to delete `parseToken` — it's at line 10, column 17 of /tmp/weaver-eval/src/auth.ts. What's using it before I remove it?",
-    expect: {
-      skill: "weaver-code-inspection",
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {

[Killed] ObjectLiteral
eval/cases/cases.ts:317:13
     name: "boundary-bash-search-non-ts-project",
     exposure: "progressive",
     task: "Search for `API_KEY` across the Python files in /tmp/weaver-eval-py.",
-    expect: { skill: "bash" },
+    expect: {},
     observational: {
       since: "2026-08-08",
killedBy: case table adjacent-negative boundary cases has the adjacent-negative cases with distinct tasks, all gated to bash
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:329:20
     exposure: "progressive",
     task: "Remove the leftover `console.log('debug')` on line 15 of /tmp/weaver-eval/src/app.ts.",
     expect: { skill: "bash" },
-    observational: {
-      since: "2026-08-08",
-      reason: "over-triggers into a weaver call for a plain single-line edit — 0/10 at demotion",
-      models: ["openai/gpt-5.6-luna"],
-    },
+    observational: {},
   },
 

[Killed] ObjectLiteral
eval/cases/cases.ts:355:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Move /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/authentication/auth.ts.",
-    expect: {
-      command: "move-file",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation moveFile has at least one command-stage case
statusReason: No command-stage case for operation "moveFile" (subcommand: "move-file"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:367:16
     task: "Move the /tmp/weaver-eval/src/utils directory to /tmp/weaver-eval/src/lib/helpers.",
     expect: {
       command: "move-directory",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/utils" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:375:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Move the exported function `parseToken` from /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/utils/token.ts.",
-    expect: {
-      command: "move-symbol",
-      keyArgs: { symbolName: "parseToken" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation moveSymbol has at least one command-stage case
statusReason: No command-stage case for operation "moveSymbol" (subcommand: "move-symbol"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] ObjectLiteral
eval/cases/cases.ts:395:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Find all references to the symbol `authenticate` at line 5, column 17 of /tmp/weaver-eval/src/auth.ts.",
-    expect: {
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation findReferences has at least one command-stage case
statusReason: No command-stage case for operation "findReferences" (subcommand: "find-references"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:423:20
     expect: {
       command: "get-type-errors",
     },
-    observational: {
-      since: "2026-07-24",
-      reason: "tsc reflex — 3/5 at demotion",
-      models: ["anthropic/claude-haiku-4.5"],
-    },
+    observational: {},
   },
   {

[Killed] ObjectLiteral
eval/cases/cases.ts:434:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Find all TODO comments in /tmp/weaver-eval/src — file, line, and surrounding context.",
-    expect: {
-      command: "search-text",
-      keyArgs: { pattern: "TODO" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation searchText has at least one command-stage case
statusReason: No command-stage case for operation "searchText" (subcommand: "search-text"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:474:16
     },
     expect: {
       command: "rename",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts", line: 12, col: 9, newName: "accountId" },
+      keyArgs: {},
     },
   },
