[Killed] BlockStatement
eval/cases/cases.ts:95:83
 /** Either op-case variant — the ones judged on a rate rather than all-clean. */
 export type OpCase = ProgressiveOpCase | FrontLoadedCase;
 
-export function isProgressiveOpCase(entry: CaseEntry): entry is ProgressiveOpCase {
-  return entry.exposure === "progressive" && entry.expect.skill !== "bash";
-}
+export function isProgressiveOpCase(entry: CaseEntry): entry is ProgressiveOpCase {}
 
 export function isBoundaryCase(entry: CaseEntry): entry is BoundaryCase {
killedBy: case table trigger coverage has at least one trigger case for the refactor skill
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
eval/cases/cases.ts:96:46
 export type OpCase = ProgressiveOpCase | FrontLoadedCase;
 
 export function isProgressiveOpCase(entry: CaseEntry): entry is ProgressiveOpCase {
-  return entry.exposure === "progressive" && entry.expect.skill !== "bash";
+  return entry.exposure === "progressive" && true;
 }
 
killedBy: case table trigger coverage classifies every case as exactly one of progressive-op, boundary, or front-loaded
statusReason: Case "boundary-bash-search-non-ts-project" matched 2 of the three predicates, want 1: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
eval/cases/cases.ts:96:10
 export type OpCase = ProgressiveOpCase | FrontLoadedCase;
 
 export function isProgressiveOpCase(entry: CaseEntry): entry is ProgressiveOpCase {
-  return entry.exposure === "progressive" && entry.expect.skill !== "bash";
+  return entry.exposure !== "progressive" && entry.expect.skill !== "bash";
 }
 
killedBy: case table trigger coverage has at least one trigger case for the refactor skill
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
eval/cases/cases.ts:99:73
   return entry.exposure === "progressive" && entry.expect.skill !== "bash";
 }
 
-export function isBoundaryCase(entry: CaseEntry): entry is BoundaryCase {
-  return entry.exposure === "progressive" && entry.expect.skill === "bash";
-}
+export function isBoundaryCase(entry: CaseEntry): entry is BoundaryCase {}
 
 export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {
killedBy: buildTrialConfig boundary case declares no hard-fail predicate — reaching any weaver op is judged by the clean check, not vetoed mid-trial
statusReason: expected [Function hardFails] to be undefined

[Killed] LogicalOperator
eval/cases/cases.ts:100:10
 }
 
 export function isBoundaryCase(entry: CaseEntry): entry is BoundaryCase {
-  return entry.exposure === "progressive" && entry.expect.skill === "bash";
+  return entry.exposure === "progressive" || entry.expect.skill === "bash";
 }
 
killedBy: buildTrialConfig matches and hardFails — 'progressive' matches a bash call for the expected command with correct key args
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/cases/cases.ts:100:46
 }
 
 export function isBoundaryCase(entry: CaseEntry): entry is BoundaryCase {
-  return entry.exposure === "progressive" && entry.expect.skill === "bash";
+  return entry.exposure === "progressive" && true;
 }
 
killedBy: buildTrialConfig matches and hardFails — 'progressive' matches a bash call for the expected command with correct key args
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/cases/cases.ts:103:79
   return entry.exposure === "progressive" && entry.expect.skill === "bash";
 }
 
-export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {
-  return entry.exposure === "front-loaded";
-}
+export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {}
 
 /** Either op-case variant — the ones the gate lane runs through the escalating rate gate. */
killedBy: buildTrialConfig front-loaded case, single-step declares bash as the only tool, with a 3-step budget
statusReason: expected [ { type: 'function', …(1) }, …(4) ] to deeply equal [ { type: 'function', …(1) } ]

[Killed] EqualityOperator
eval/cases/cases.ts:104:10
 }
 
 export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {
-  return entry.exposure === "front-loaded";
+  return entry.exposure !== "front-loaded";
 }
 
killedBy: buildTrialConfig boundary case declares the skill tool plus the rate-lane tool set and a 6-step budget
statusReason: expected [ 'bash' ] to include 'Skill'

[Killed] ConditionalExpression
eval/cases/cases.ts:104:10
 }
 
 export function isFrontLoadedCase(entry: CaseEntry): entry is FrontLoadedCase {
-  return entry.exposure === "front-loaded";
+  return false;
 }
 
killedBy: buildTrialConfig front-loaded case, single-step declares bash as the only tool, with a 3-step budget
statusReason: expected [ { type: 'function', …(1) }, …(4) ] to deeply equal [ { type: 'function', …(1) } ]

[Killed] BlockStatement
eval/cases/cases.ts:108:61
 }
 
 /** Either op-case variant — the ones the gate lane runs through the escalating rate gate. */
-export function isOpCase(entry: CaseEntry): entry is OpCase {
-  return !isBoundaryCase(entry);
-}
+export function isOpCase(entry: CaseEntry): entry is OpCase {}
 
 const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
killedBy: case table trigger coverage classifies every progressive-op and front-loaded case as an op case, and no boundary case
statusReason: expected +0 to be 25 // Object.is equality

[Killed] BooleanLiteral
eval/cases/cases.ts:109:10
 
 /** Either op-case variant — the ones the gate lane runs through the escalating rate gate. */
 export function isOpCase(entry: CaseEntry): entry is OpCase {
-  return !isBoundaryCase(entry);
+  return isBoundaryCase(entry);
 }
 
killedBy: case table trigger coverage classifies every progressive-op and front-loaded case as an op case, and no boundary case
statusReason: expected true to be false // Object.is equality

[Survived] Regex
eval/cases/cases.ts:112:37
   return !isBoundaryCase(entry);
 }
 
-const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
+const OBSERVATIONAL_SINCE_PATTERN = /^\d-\d{2}-\d{2}$/;
 const GATING_MODEL_IDS = new Set(GATING_MODELS.map((model) => model.id));
 

[Survived] Regex
eval/cases/cases.ts:112:37
   return !isBoundaryCase(entry);
 }
 
-const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
+const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\D{2}$/;
 const GATING_MODEL_IDS = new Set(GATING_MODELS.map((model) => model.id));
 

[Survived] ArrowFunction
eval/cases/cases.ts:113:52
 }
 
 const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
-const GATING_MODEL_IDS = new Set(GATING_MODELS.map((model) => model.id));
+const GATING_MODEL_IDS = new Set(GATING_MODELS.map(() => undefined));
 
 function validateObservational(entry: CaseEntry): void {

[Killed] BlockStatement
eval/cases/cases.ts:115:56
 const OBSERVATIONAL_SINCE_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
 const GATING_MODEL_IDS = new Set(GATING_MODELS.map((model) => model.id));
 
-function validateObservational(entry: CaseEntry): void {
-  const marker = entry.observational;
-  if (!marker) return;
-  if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
-    throw new Error(
-      `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
-    );
-  }
-  if (marker.reason.trim() === "") {
-    throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
-  }
-  if (marker.models.length === 0) {
-    throw new Error(`Case "${entry.name}" observational.models must not be empty`);
-  }
-  const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
-  if (unknownIds.length > 0) {
-    throw new Error(
-      `Case "${entry.name}" observational.models names unknown model id(s): ${unknownIds.join(", ")}`,
-    );
-  }
-}
+function validateObservational(entry: CaseEntry): void {}
 
 /** Eagerly validates all seed fixtures and observational markings at module load. */
killedBy: case table observational marker validation rejects an empty models list, naming the case
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
eval/cases/cases.ts:117:7
 
 function validateObservational(entry: CaseEntry): void {
   const marker = entry.observational;
-  if (!marker) return;
+  if (true) return;
   if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
     throw new Error(
killedBy: case table observational marker validation rejects an empty models list, naming the case
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
eval/cases/cases.ts:117:7
 
 function validateObservational(entry: CaseEntry): void {
   const marker = entry.observational;
-  if (!marker) return;
+  if (false) return;
   if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
     throw new Error(

[Killed] ConditionalExpression
eval/cases/cases.ts:118:7
 function validateObservational(entry: CaseEntry): void {
   const marker = entry.observational;
   if (!marker) return;
-  if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
+  if (false) {
     throw new Error(
       `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
killedBy: case table observational marker validation rejects a since value that isn't YYYY-MM-DD
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
eval/cases/cases.ts:118:56
 function validateObservational(entry: CaseEntry): void {
   const marker = entry.observational;
   if (!marker) return;
-  if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {
-    throw new Error(
-      `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
-    );
-  }
+  if (!OBSERVATIONAL_SINCE_PATTERN.test(marker.since)) {}
   if (marker.reason.trim() === "") {
     throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
killedBy: case table observational marker validation rejects a since value that isn't YYYY-MM-DD
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
eval/cases/cases.ts:123:7
       `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
     );
   }
-  if (marker.reason.trim() === "") {
+  if (marker.reason === "") {
     throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
   }
killedBy: case table observational marker validation rejects a blank reason
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
eval/cases/cases.ts:123:7
       `Case "${entry.name}" observational.since must be "YYYY-MM-DD", got "${marker.since}"`,
     );
   }
-  if (marker.reason.trim() === "") {
+  if (false) {
     throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
   }
killedBy: case table observational marker validation rejects a blank reason
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
eval/cases/cases.ts:126:7
   if (marker.reason.trim() === "") {
     throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
   }
-  if (marker.models.length === 0) {
+  if (false) {
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
   }
killedBy: case table observational marker validation rejects an empty models list, naming the case
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
eval/cases/cases.ts:126:35
   if (marker.reason.trim() === "") {
     throw new Error(`Case "${entry.name}" observational.reason must not be empty`);
   }
-  if (marker.models.length === 0) {
-    throw new Error(`Case "${entry.name}" observational.models must not be empty`);
-  }
+  if (marker.models.length === 0) {}
   const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
   if (unknownIds.length > 0) {
killedBy: case table observational marker validation rejects an empty models list, naming the case
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
eval/cases/cases.ts:129:43
   if (marker.models.length === 0) {
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
   }
-  const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
+  const unknownIds = marker.models.filter(() => undefined);
   if (unknownIds.length > 0) {
     throw new Error(
killedBy: case table observational marker validation rejects a model id absent from the roster, naming the case and the offending id
statusReason: expected [Function] to throw an error

[Survived] BooleanLiteral
eval/cases/cases.ts:129:51
   if (marker.models.length === 0) {
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
   }
-  const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
+  const unknownIds = marker.models.filter((id) => GATING_MODEL_IDS.has(id));
   if (unknownIds.length > 0) {
     throw new Error(

[Killed] BlockStatement
eval/cases/cases.ts:130:30
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
   }
   const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
-  if (unknownIds.length > 0) {
-    throw new Error(
-      `Case "${entry.name}" observational.models names unknown model id(s): ${unknownIds.join(", ")}`,
-    );
-  }
+  if (unknownIds.length > 0) {}
 }
 
killedBy: case table observational marker validation rejects a model id absent from the roster, naming the case and the offending id
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
eval/cases/cases.ts:130:7
     throw new Error(`Case "${entry.name}" observational.models must not be empty`);
   }
   const unknownIds = marker.models.filter((id) => !GATING_MODEL_IDS.has(id));
-  if (unknownIds.length > 0) {
+  if (false) {
     throw new Error(
       `Case "${entry.name}" observational.models names unknown model id(s): ${unknownIds.join(", ")}`,
killedBy: case table observational marker validation rejects a model id absent from the roster, naming the case and the offending id
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
eval/cases/cases.ts:138:66
 }
 
 /** Eagerly validates all seed fixtures and observational markings at module load. */
-export function validateCases(entries: CaseEntry[]): CaseEntry[] {
-  for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
-      loadFixture(entry.seed.fixture);
-    }
-    validateObservational(entry);
-  }
-  return entries;
-}
+export function validateCases(entries: CaseEntry[]): CaseEntry[] {}
 
 export const CASES: CaseEntry[] = validateCases([
killedBy: case table structure invariants no two cases share the same name
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
eval/cases/cases.ts:139:32
 
 /** Eagerly validates all seed fixtures and observational markings at module load. */
 export function validateCases(entries: CaseEntry[]): CaseEntry[] {
-  for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
-      loadFixture(entry.seed.fixture);
-    }
-    validateObservational(entry);
-  }
+  for (const entry of entries) {}
   return entries;
 }
killedBy: case table observational marker validation rejects an empty models list, naming the case
statusReason: expected [Function] to throw an error

[Survived] BlockStatement
eval/cases/cases.ts:140:49
 /** Eagerly validates all seed fixtures and observational markings at module load. */
 export function validateCases(entries: CaseEntry[]): CaseEntry[] {
   for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
-      loadFixture(entry.seed.fixture);
-    }
+    if (isFrontLoadedCase(entry) && entry.seed) {}
     validateObservational(entry);
   }

[Survived] ConditionalExpression
eval/cases/cases.ts:140:9
 /** Eagerly validates all seed fixtures and observational markings at module load. */
 export function validateCases(entries: CaseEntry[]): CaseEntry[] {
   for (const entry of entries) {
-    if (isFrontLoadedCase(entry) && entry.seed) {
+    if (false) {
       loadFixture(entry.seed.fixture);
     }

[Survived] ObjectLiteral
eval/cases/cases.ts:178:16
     expect: {
       skill: "weaver-refactor",
       command: "move-file",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:181:3
       keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
     },
   },
-  {
-    name: "trigger-search-and-replace-pattern",
-    exposure: "progressive",
-    task: 'Replace all occurrences of "v1" with "v2" across the project, including in comments.',
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
-    // A replace often searches first to confirm the pattern exists; the focused
-    // fixture hands back real `v1` hits so the precursor doesn't read as
-    // "nothing to replace" and strand the model short of `replace-text`.
-    cannedResults: { "search-text": loadFixture("searchText-v1.json") },
-  },
+  {},
   {
     name: "trigger-search-and-replace-todos-grep-tempting",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:205:3
       keyArgs: { pattern: "TODO" },
     },
   },
-  {
-    name: "trigger-search-and-replace-sed-tempting",
-    exposure: "progressive",
-    task: 'Replace every occurrence of the string "v1" with "v2" in all TypeScript source files under /tmp/weaver-eval/src. Make sure to get comments too.',
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
-    cannedResults: { "search-text": loadFixture("searchText-v1.json") },
-  },
+  {},
   {
     name: "trigger-code-inspection-find-references",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:216:3
     },
     cannedResults: { "search-text": loadFixture("searchText-v1.json") },
   },
-  {
-    name: "trigger-code-inspection-find-references",
-    exposure: "progressive",
-    task: "Where is `authenticate` used? It's at line 5, column 17 of /tmp/weaver-eval/src/auth.ts.",
-    expect: {
-      skill: "weaver-code-inspection",
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
-  },
+  {},
   {
     name: "trigger-code-inspection-find-references-delete-intent",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:226:3
       keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
     },
   },
-  {
-    name: "trigger-code-inspection-find-references-delete-intent",
-    exposure: "progressive",
-    task: "I want to delete `parseToken` — it's at line 10, column 17 of /tmp/weaver-eval/src/auth.ts. What's using it before I remove it?",
-    expect: {
-      skill: "weaver-code-inspection",
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
-  },
+  {},
   {
     name: "trigger-code-inspection-get-type-errors",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] ObjectLiteral
eval/cases/cases.ts:240:13
     name: "trigger-code-inspection-get-type-errors",
     exposure: "progressive",
     task: "Are there any TypeScript errors in /tmp/weaver-eval/src/auth.ts? I want to check before I start refactoring.",
-    expect: { skill: "weaver-code-inspection", command: "get-type-errors" },
+    expect: {},
   },
 

[Survived] ObjectLiteral
eval/cases/cases.ts:266:69
     // "own-file inspect step".
     momentumTurns: 3,
-    expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
+    expect: { skill: "weaver-refactor", command: "rename", keyArgs: {} },
     cannedResults: { "search-text": loadFixture("searchText-userId.json") },
     observational: {

[Survived] ObjectLiteral
eval/cases/cases.ts:267:20
     momentumTurns: 3,
     expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
-    cannedResults: { "search-text": loadFixture("searchText-userId.json") },
+    cannedResults: {},
     observational: {
       since: "2026-08-08",

[Survived] ObjectLiteral
eval/cases/cases.ts:268:20
     momentumTurns: 3,
     expect: { skill: "weaver-refactor", command: "rename", keyArgs: { newName: "accountId" } },
     cannedResults: { "search-text": loadFixture("searchText-userId.json") },
-    observational: {
-      since: "2026-08-08",
-      reason: "re-confirms with grep/cat instead of converting — 6/10 at demotion",
-      models: ["anthropic/claude-haiku-4.5"],
-    },
+    observational: {},
   },
   // A repo-wide bump stated as intent with no action push (the declarative form

[Killed] ObjectLiteral
eval/cases/cases.ts:283:13
     exposure: "progressive",
     task: "We're doing a version bump across the repo: replace every `v1` with `v2`, comments included.",
     momentumTurns: 3,
-    expect: {
-      skill: "weaver-search-and-replace",
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
+    expect: {},
     cannedResults: { "search-text": loadFixture("searchText-v1-repo.json") },
   },
killedBy: case table pressured buried rung has a deep, gating trigger case for replace-text
statusReason: Expected a pressured buried trigger case for "replace-text": expected 0 to be greater than or equal to 1

[Killed] ObjectLiteral
eval/cases/cases.ts:295:13
     exposure: "progressive",
     momentumTurns: 3,
-    expect: {
-      skill: "weaver-code-inspection",
-      command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
 
killedBy: case table pressured buried rung has a deep, gating trigger case for find-references
statusReason: Expected a pressured buried trigger case for "find-references": expected 0 to be greater than or equal to 1

[Survived] ObjectLiteral
eval/cases/cases.ts:298:16
     expect: {
       skill: "weaver-code-inspection",
       command: "find-references",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:308:3
   // adjacent negatives on a description's decision boundary; see
   // docs/eval-design.md for why tasks far from any description aren't included.
 
-  {
-    name: "boundary-bash-search-non-ts-project",
-    exposure: "progressive",
-    task: "Search for `API_KEY` across the Python files in /tmp/weaver-eval-py.",
-    expect: { skill: "bash" },
-    observational: {
-      since: "2026-08-08",
-      reason: "over-triggers into weaver search-text on a non-TS project — 0/10 at demotion",
-      models: ["openai/gpt-5.6-luna"],
-    },
-  },
+  {},
   {
     name: "boundary-bash-remove-console-log",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:323:13
     name: "boundary-bash-remove-console-log",
     exposure: "progressive",
     task: "Remove the leftover `console.log('debug')` on line 15 of /tmp/weaver-eval/src/app.ts.",
-    expect: { skill: "bash" },
+    expect: {},
     observational: {
       since: "2026-08-08",
killedBy: case table adjacent-negative boundary cases has the adjacent-negative cases with distinct tasks, all gated to bash
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:340:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "`userId` is at line 12, column 8 of /tmp/weaver-eval/src/auth.ts — rename it to `accountId` everywhere in the project.",
-    expect: {
-      command: "rename",
-      keyArgs: { newName: "accountId" },
-    },
+    expect: {},
   },
   {

[Killed] ObjectLiteral
eval/cases/cases.ts:355:3
       keyArgs: { oldPath: "/tmp/weaver-eval/src/auth.ts" },
     },
   },
-  {
-    name: "command-move-directory",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Move the /tmp/weaver-eval/src/utils directory to /tmp/weaver-eval/src/lib/helpers.",
-    expect: {
-      command: "move-directory",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/utils" },
-    },
-  },
+  {},
   {
     name: "command-move-symbol",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:360:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Move the /tmp/weaver-eval/src/utils directory to /tmp/weaver-eval/src/lib/helpers.",
-    expect: {
-      command: "move-directory",
-      keyArgs: { oldPath: "/tmp/weaver-eval/src/utils" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation moveDirectory has at least one command-stage case
statusReason: No command-stage case for operation "moveDirectory" (subcommand: "move-directory"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] ObjectLiteral
eval/cases/cases.ts:365:3
       keyArgs: { oldPath: "/tmp/weaver-eval/src/utils" },
     },
   },
-  {
-    name: "command-move-symbol",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Move the exported function `parseToken` from /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/utils/token.ts.",
-    expect: {
-      command: "move-symbol",
-      keyArgs: { symbolName: "parseToken" },
-    },
-  },
+  {},
   {
     name: "command-find-importers",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] ObjectLiteral
eval/cases/cases.ts:372:16
     task: "Move the exported function `parseToken` from /tmp/weaver-eval/src/auth.ts to /tmp/weaver-eval/src/utils/token.ts.",
     expect: {
       command: "move-symbol",
-      keyArgs: { symbolName: "parseToken" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:375:3
       keyArgs: { symbolName: "parseToken" },
     },
   },
-  {
-    name: "command-find-importers",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Which files import /tmp/weaver-eval/src/auth.ts?",
-    expect: {
-      command: "find-importers",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
-  },
+  {},
   {
     name: "command-find-references",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:380:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Which files import /tmp/weaver-eval/src/auth.ts?",
-    expect: {
-      command: "find-importers",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
-    },
+    expect: {},
   },
   {
killedBy: eval case coverage operation coverage operation findImporters has at least one command-stage case
statusReason: No command-stage case for operation "findImporters" (subcommand: "find-importers"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Survived] ObjectLiteral
eval/cases/cases.ts:382:16
     task: "Which files import /tmp/weaver-eval/src/auth.ts?",
     expect: {
       command: "find-importers",
-      keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:395:3
       keyArgs: { file: "/tmp/weaver-eval/src/auth.ts" },
     },
   },
-  {
-    name: "command-get-definition",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Where is `User` actually defined? I'm looking at line 8, column 12 of /tmp/weaver-eval/src/api.ts.",
-    expect: {
-      command: "get-definition",
-      keyArgs: { file: "/tmp/weaver-eval/src/api.ts" },
-    },
-  },
+  {},
   // Haiku's single most-habituated check-for-errors reflex is `npx tsc`, not
   // `weaver get-type-errors` — a decision-path router with an explicit
killedBy: eval case coverage operation coverage operation getDefinition has at least one command-stage case
statusReason: No command-stage case for operation "getDefinition" (subcommand: "get-definition"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] ObjectLiteral
eval/cases/cases.ts:400:13
     exposure: "front-loaded",
     momentumTurns: 3,
     task: "Where is `User` actually defined? I'm looking at line 8, column 12 of /tmp/weaver-eval/src/api.ts.",
-    expect: {
-      command: "get-definition",
-      keyArgs: { file: "/tmp/weaver-eval/src/api.ts" },
-    },
+    expect: {},
   },
   // Haiku's single most-habituated check-for-errors reflex is `npx tsc`, not
killedBy: eval case coverage operation coverage operation getDefinition has at least one command-stage case
statusReason: No command-stage case for operation "getDefinition" (subcommand: "get-definition"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality
