[Killed] ObjectLiteral
eval/cases/cases.ts:410:3
   // "Never: tsc/npx tsc" row still doesn't hold it under momentum, unlike the
   // sibling reflexes (search-text, find-importers, move-directory) the same
   // router style did hold. See docs/eval-baselines.md for the measured rate.
-  {
-    name: "command-get-type-errors",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Are there any TypeScript errors in /tmp/weaver-eval/src/auth.ts?",
-    expect: {
-      command: "get-type-errors",
-    },
-    observational: {
-      since: "2026-07-24",
-      reason: "tsc reflex — 3/5 at demotion",
-      models: ["anthropic/claude-haiku-4.5"],
-    },
-  },
+  {},
   {
     name: "command-search-text",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
eval/cases/cases.ts:434:3
       keyArgs: { pattern: "TODO" },
     },
   },
-  {
-    name: "command-delete-file",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: "Delete /tmp/weaver-eval/src/old-helper.ts and clean up all its imports.",
-    expect: {
-      command: "delete-file",
-      keyArgs: { file: "/tmp/weaver-eval/src/old-helper.ts" },
-    },
-  },
+  {},
   {
     name: "command-replace-text",
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] ObjectLiteral
eval/cases/cases.ts:441:16
     task: "Delete /tmp/weaver-eval/src/old-helper.ts and clean up all its imports.",
     expect: {
       command: "delete-file",
-      keyArgs: { file: "/tmp/weaver-eval/src/old-helper.ts" },
+      keyArgs: {},
     },
   },

[Killed] ObjectLiteral
eval/cases/cases.ts:444:3
       keyArgs: { file: "/tmp/weaver-eval/src/old-helper.ts" },
     },
   },
-  {
-    name: "command-replace-text",
-    exposure: "front-loaded",
-    momentumTurns: 3,
-    task: 'Replace every occurrence of "v1" with "v2" across all TypeScript files in the project.',
-    expect: {
-      command: "replace-text",
-      keyArgs: { replacement: "v2" },
-    },
-  },
+  {},
 
   // ── Two-step flows ────────────────────────────────────────────────────────
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] ObjectLiteral
eval/cases/cases.ts:451:16
     task: 'Replace every occurrence of "v1" with "v2" across all TypeScript files in the project.',
     expect: {
       command: "replace-text",
-      keyArgs: { replacement: "v2" },
+      keyArgs: {},
     },
   },

[Survived] ObjectLiteral
eval/cases/cases.ts:463:11
     name: "two-step-search-then-rename",
     exposure: "front-loaded",
     task: "Rename `userId` to `accountId` everywhere in the project. It's in /tmp/weaver-eval/src/auth.ts but I don't have the line number.",
-    seed: {
-      step1Command: `weaver search-text '{"pattern":"userId"}'`,
-      fixture: "searchText-userId.json",
-    },
+    seed: {},
     expect: {
       command: "rename",

[Killed] ObjectLiteral
eval/cases/cases.ts:472:3
       keyArgs: { file: "/tmp/weaver-eval/src/auth.ts", line: 12, col: 9, newName: "accountId" },
     },
   },
-  {
-    // The task gives the line range, but the model reads the file first; the
-    // seed carries that `cat` so the asserted follow-up is the extract itself.
-    name: "two-step-cat-then-extract",
-    exposure: "front-loaded",
-    task: "Extract lines 10–20 of /tmp/weaver-eval/src/auth.ts into a new function called `hashPassword`.",
-    seed: {
-      step1Command: "cat /tmp/weaver-eval/src/auth.ts",
-      fixture: "sources/auth.ts",
-    },
-    expect: {
-      command: "extract-function",
-      keyArgs: { functionName: "hashPassword" },
-    },
-  },
+  {},
 ]);
 
killedBy: case table structure invariants every two-step-named case is front-loaded with a seed
statusReason: Cannot read properties of undefined (reading 'startsWith')
