[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:246:27
 
   let finishReason: string | undefined;
 
-  for (let stepIndex = 1; stepIndex <= maxSteps; stepIndex++) {
+  for (let stepIndex = 1; false; stepIndex++) {
     const response = await step(messages, tools);
     const calls = response.toolCalls;
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n   …' to contain 'step 1'

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:251:9
     const calls = response.toolCalls;
     finishReason = response.finishReason;
 
-    if (calls.length === 0) {
+    if (true) {
       // Model answered with text instead of a tool call — it has abandoned the
       // tools and will not converge. Stop here rather than burn the budget.
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n   …' to contain 'step 1'

[Killed] EqualityOperator
eval/harness/agentic-loop.ts:251:9
     const calls = response.toolCalls;
     finishReason = response.finishReason;
 
-    if (calls.length === 0) {
+    if (calls.length !== 0) {
       // Model answered with text instead of a tool call — it has abandoned the
       // tools and will not converge. Stop here rather than burn the budget.
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n   …' to contain 'step 1'

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:266:9
       };
     }
 
-    if (debug) {
+    if (true) {
       const first = calls[0];
       const arg =
killedBy: runAgenticLoop debug tracing does not log anything when WEAVER_EVAL_DEBUG is unset, even across an echoed turn
statusReason: expected "error" to not be called at all, but actually been called 4 times

Received:

  1st error call:

    Array [
      "

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:269:9
     if (debug) {
       const first = calls[0];
       const arg =
-        first.name === "bash"
+        false
           ? String(first.arguments.command ?? "")
           : JSON.stringify(first.arguments);
killedBy: runAgenticLoop debug tracing logs a bash call's command verbatim rather than JSON-stringifying its arguments
statusReason: expected '═══ initial prompt ═══\n\n─ step 1 ─ …' to contain '→ bash(grep -rn userId src/)'

[Killed] EqualityOperator
eval/harness/agentic-loop.ts:269:9
     if (debug) {
       const first = calls[0];
       const arg =
-        first.name === "bash"
+        first.name !== "bash"
           ? String(first.arguments.command ?? "")
           : JSON.stringify(first.arguments);
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n   …' to contain '→ Grep({})'

[Killed] LogicalOperator
eval/harness/agentic-loop.ts:270:20
       const first = calls[0];
       const arg =
         first.name === "bash"
-          ? String(first.arguments.command ?? "")
+          ? String(first.arguments.command && "")
           : JSON.stringify(first.arguments);
       console.error(`\n─ step ${stepIndex} ─ model said: ${JSON.stringify(response.text)}`);
killedBy: runAgenticLoop debug tracing logs a bash call's command verbatim rather than JSON-stringifying its arguments
statusReason: expected '═══ initial prompt ═══\n\n─ step 1 ─ …' to contain '→ bash(grep -rn userId src/)'

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:284:36
     // operation, not the operation. The remaining calls are the ones that
     // count. A tool-style reach additionally credits skillCalledAsTool, which
     // by construction can never be set without skillMdRead also being set.
-    if (!skillMdRead && calls.some((c) => isNavigationCall(c))) {
+    if (!skillMdRead && calls.some(() => undefined)) {
       skillMdRead = true;
       readTurn = stepIndex;
killedBy: runAgenticLoop SKILL.md read tracking credits skill SKILL.md read, excludes it from trail, and matches at a later step
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:284:9
     // operation, not the operation. The remaining calls are the ones that
     // count. A tool-style reach additionally credits skillCalledAsTool, which
     // by construction can never be set without skillMdRead also being set.
-    if (!skillMdRead && calls.some((c) => isNavigationCall(c))) {
+    if (true) {
       skillMdRead = true;
       readTurn = stepIndex;
killedBy: runAgenticLoop SKILL.md read tracking credits skill SKILL.md read, excludes it from trail, and matches at a later step
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
eval/harness/agentic-loop.ts:285:21
     // count. A tool-style reach additionally credits skillCalledAsTool, which
     // by construction can never be set without skillMdRead also being set.
     if (!skillMdRead && calls.some((c) => isNavigationCall(c))) {
-      skillMdRead = true;
+      skillMdRead = false;
       readTurn = stepIndex;
     }
killedBy: runAgenticLoop SKILL.md read tracking credits skill SKILL.md read, excludes it from trail, and matches at a later step
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
eval/harness/agentic-loop.ts:288:31
       skillMdRead = true;
       readTurn = stepIndex;
     }
-    if (!skillCalledAsTool && calls.some((c) => isToolStyleReach(c))) {
+    if (!skillCalledAsTool && calls.every(c => isToolStyleReach(c))) {
       skillCalledAsTool = true;
     }
killedBy: runAgenticLoop SKILL.md read tracking hard-fails on a non-first competitor bundled with a tool-style reach, still crediting both flags
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:288:9
       skillMdRead = true;
       readTurn = stepIndex;
     }
-    if (!skillCalledAsTool && calls.some((c) => isToolStyleReach(c))) {
+    if (false) {
       skillCalledAsTool = true;
     }
killedBy: runAgenticLoop SKILL.md read tracking credits a tool-style reach as both skillMdRead and skillCalledAsTool, keeping it out of the trail and match
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
eval/harness/agentic-loop.ts:289:27
       readTurn = stepIndex;
     }
     if (!skillCalledAsTool && calls.some((c) => isToolStyleReach(c))) {
-      skillCalledAsTool = true;
+      skillCalledAsTool = false;
     }
 
killedBy: runAgenticLoop SKILL.md read tracking credits a tool-style reach as both skillMdRead and skillCalledAsTool, keeping it out of the trail and match
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
eval/harness/agentic-loop.ts:292:28
       skillCalledAsTool = true;
     }
 
-    const operationCalls = calls.filter((c) => !isNavigationCall(c));
+    const operationCalls = calls;
 
     trail.push(...operationCalls);
killedBy: runAgenticLoop SKILL.md read tracking credits skill SKILL.md read, excludes it from trail, and matches at a later step
statusReason: expected [ 'Read', 'bash' ] to not include 'Read'

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:292:41
       skillCalledAsTool = true;
     }
 
-    const operationCalls = calls.filter((c) => !isNavigationCall(c));
+    const operationCalls = calls.filter(() => undefined);
 
     trail.push(...operationCalls);
killedBy: runAgenticLoop finishReason carries the final step's finish_reason 'on a match'
statusReason: Cannot read properties of undefined (reading 'toolCalls')

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:296:9
 
     trail.push(...operationCalls);
 
-    if (operationCalls.some((c) => matches(c))) {
+    if (true) {
       return {
         matched: true,
killedBy: runAgenticLoop finishReason carries the last step's finish_reason when the budget is exhausted, not an earlier turn's
statusReason: expected 'turn-1' to be 'turn-3' // Object.is equality

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:296:29
 
     trail.push(...operationCalls);
 
-    if (operationCalls.some((c) => matches(c))) {
+    if (operationCalls.some(() => undefined)) {
       return {
         matched: true,
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: Cannot read properties of undefined (reading 'toolCalls')

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:309:9
       };
     }
 
-    if (hardFails !== undefined && operationCalls.some((c) => hardFails(c))) {
+    if (true) {
       return {
         matched: false,
killedBy: runAgenticLoop finishReason carries the last step's finish_reason when the budget is exhausted, not an earlier turn's
statusReason: expected 'turn-1' to be 'turn-3' // Object.is equality

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:309:9
       };
     }
 
-    if (hardFails !== undefined && operationCalls.some((c) => hardFails(c))) {
+    if (true && operationCalls.some((c) => hardFails(c))) {
       return {
         matched: false,
killedBy: runAgenticLoop finishReason carries the last step's finish_reason when the budget is exhausted, not an earlier turn's
statusReason: hardFails is not a function

[Killed] ObjectLiteral
eval/harness/agentic-loop.ts:325:10
     echoTurn(response.text, calls, stepIndex);
   }
 
-  return {
-    matched: false,
-    trail,
-    steps: maxSteps,
-    skillMdRead,
-    readTurn,
-    skillCalledAsTool,
-    finishReason,
-  };
+  return {};
 }
 
killedBy: runAgenticLoop finishReason carries the last step's finish_reason when the budget is exhausted, not an earlier turn's
statusReason: expected undefined to be 'turn-3' // Object.is equality

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:336:18
   };
 }
 
-const truncate = (text: string, max: number): string =>
-  text.length <= max ? text : `${text.slice(0, max)}… (${text.length - max} more chars)`;
+const truncate = () => undefined;
 
 const indent = (text: string): string =>
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ArithmeticOperator
eval/harness/agentic-loop.ts:337:58
 }
 
 const truncate = (text: string, max: number): string =>
-  text.length <= max ? text : `${text.slice(0, max)}… (${text.length - max} more chars)`;
+  text.length <= max ? text : `${text.slice(0, max)}… (${text.length + max} more chars)`;
 
 const indent = (text: string): string =>
killedBy: runAgenticLoop debug tracing truncates a debug-logged result over 800 characters with a remaining-chars suffix
statusReason: expected '═══ initial prompt ═══\n\n─ step 1 ─ …' to contain 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…'

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:337:3
 }
 
 const truncate = (text: string, max: number): string =>
-  text.length <= max ? text : `${text.slice(0, max)}… (${text.length - max} more chars)`;
+  false ? text : `${text.slice(0, max)}… (${text.length - max} more chars)`;
 
 const indent = (text: string): string =>
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n   …' not to contain 'more chars'

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:339:16
 const truncate = (text: string, max: number): string =>
   text.length <= max ? text : `${text.slice(0, max)}… (${text.length - max} more chars)`;
 
-const indent = (text: string): string =>
-  text
-    .split("\n")
-    .map((line) => `    ${line}`)
-    .join("\n");
+const indent = () => undefined;
 
 /**
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\nund…' to contain 'do the thing'

[Killed] ArrowFunction
eval/harness/agentic-loop.ts:342:10
 const indent = (text: string): string =>
   text
     .split("\n")
-    .map((line) => `    ${line}`)
+    .map(() => undefined)
     .join("\n");
 
killedBy: runAgenticLoop debug tracing logs the initial prompt, each step, and the echoed result when WEAVER_EVAL_DEBUG=1
statusReason: expected '═══ initial prompt ═══\n\n[user]\n\n\…' to contain 'do the thing'

[Killed] BlockStatement
eval/harness/agentic-loop.ts:354:99
  * would mean the model already knew to skip the skill and go straight to
  * the CLI, which is just as much a boundary violation.
  */
-export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {
-  if (result.skillMdRead) return false;
-  return !extractBashCommands(result.trail).some((cmd) => isAnyWeaverInvocation(cmd));
-}
+export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {}
 
killedBy: boundaryTrialClean returns true for 'a non-weaver bash command with no ski…'
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
eval/harness/agentic-loop.ts:355:34
  * the CLI, which is just as much a boundary violation.
  */
 export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {
-  if (result.skillMdRead) return false;
+  if (result.skillMdRead) return true;
   return !extractBashCommands(result.trail).some((cmd) => isAnyWeaverInvocation(cmd));
 }
killedBy: boundaryTrialClean returns false for 'a skill load with an otherwise empty …'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/agentic-loop.ts:355:7
  * the CLI, which is just as much a boundary violation.
  */
 export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {
-  if (result.skillMdRead) return false;
+  if (false) return false;
   return !extractBashCommands(result.trail).some((cmd) => isAnyWeaverInvocation(cmd));
 }
killedBy: boundaryTrialClean returns false for 'a skill load with an otherwise empty …'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
eval/harness/agentic-loop.ts:356:10
  */
 export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {
   if (result.skillMdRead) return false;
-  return !extractBashCommands(result.trail).some((cmd) => isAnyWeaverInvocation(cmd));
+  return extractBashCommands(result.trail).some(cmd => isAnyWeaverInvocation(cmd));
 }
 
killedBy: boundaryTrialClean returns true for 'a non-weaver bash command with no ski…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
eval/harness/agentic-loop.ts:356:11
  */
 export function boundaryTrialClean(result: Pick<AgenticResult, "skillMdRead" | "trail">): boolean {
   if (result.skillMdRead) return false;
-  return !extractBashCommands(result.trail).some((cmd) => isAnyWeaverInvocation(cmd));
+  return !extractBashCommands(result.trail).every(cmd => isAnyWeaverInvocation(cmd));
 }
 
killedBy: boundaryTrialClean returns true for 'an empty trail with no skill load'
statusReason: expected false to be true // Object.is equality
