[Killed] BlockStatement
eval/harness/assertions.ts:31:65
  * e.g. a boundary case that must not reach `weaver` at all, regardless of
  * which operation it would have been.
  */
-export function isAnyWeaverInvocation(command: string): boolean {
-  return /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+\S+/.test(command);
-}
+export function isAnyWeaverInvocation(command: string): boolean {}
 
 /**
killedBy: isAnyWeaverInvocation matching forms matches a bare weaver command regardless of subcommand
statusReason: expected undefined to be true // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:32:10
  * which operation it would have been.
  */
 export function isAnyWeaverInvocation(command: string): boolean {
-  return /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+\S+/.test(command);
+  return /^(?:npx\s+|pnpm\sexec\s+)?weaver\s+\S+/.test(command);
 }
 
killedBy: isAnyWeaverInvocation matching forms matches when extra whitespace separates pnpm from exec
statusReason: expected false to be true // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:32:10
  * which operation it would have been.
  */
 export function isAnyWeaverInvocation(command: string): boolean {
-  return /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+\S+/.test(command);
+  return /^(?:npx\s+|pnpm\s+exec\s+)?weaver\S+\S+/.test(command);
 }
 
killedBy: isAnyWeaverInvocation matching forms matches a bare weaver command regardless of subcommand
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:42:71
  * {@link isAnyWeaverInvocation} and is anchored the same way. The token is
  * returned verbatim, up to the first whitespace — no normalisation.
  */
-export function weaverSubcommand(command: string): string | undefined {
-  const match = command.match(/^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)/);
-  return match?.[1];
-}
+export function weaverSubcommand(command: string): string | undefined {}
 
 /**
killedBy: weaverSubcommand matching forms extracts the subcommand from a bare weaver invocation
statusReason: expected undefined to be 'search-text' // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:43:31
  * returned verbatim, up to the first whitespace — no normalisation.
  */
 export function weaverSubcommand(command: string): string | undefined {
-  const match = command.match(/^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)/);
+  const match = command.match(/^(?:npx\s+|pnpm\s+exec\S+)?weaver\s+(\S+)/);
   return match?.[1];
 }
killedBy: weaverSubcommand matching forms extracts the subcommand from a pnpm exec weaver prefix
statusReason: expected undefined to be 'rename' // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:43:31
  * returned verbatim, up to the first whitespace — no normalisation.
  */
 export function weaverSubcommand(command: string): string | undefined {
-  const match = command.match(/^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)/);
+  const match = command.match(/^(?:npx\s+|pnpm\s+exec\s+)?weaver\S+(\S+)/);
   return match?.[1];
 }
killedBy: weaverSubcommand matching forms extracts the subcommand from a bare weaver invocation
statusReason: expected undefined to be 'search-text' // Object.is equality

[Killed] OptionalChaining
eval/harness/assertions.ts:44:10
  */
 export function weaverSubcommand(command: string): string | undefined {
   const match = command.match(/^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)/);
-  return match?.[1];
+  return match[1];
 }
 
killedBy: weaverSubcommand non-matching cases returns undefined for a non-weaver command
statusReason: Cannot read properties of null (reading '1')

[Killed] BlockStatement
eval/harness/assertions.ts:56:70
  * stops at `&&` (not `;`) because semicolons appear inside legitimate JSON
  * pattern arguments. Returns an empty array when no bash calls exist.
  */
-export function extractBashCommands(toolCalls: ToolCall[]): string[] {
-  return toolCalls
-    .filter((tc) => tc.name === "bash")
-    .map((tc) => {
-      const cmd = tc.arguments.command;
-      return typeof cmd === "string" ? cmd : "";
-    })
-    .flatMap((cmd) => cmd.split(/\s*&&\s*/))
-    .map((cmd) => cmd.trim())
-    .filter((cmd) => cmd.length > 0);
-}
+export function extractBashCommands(toolCalls: ToolCall[]): string[] {}
 
 /**
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: expected undefined to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] MethodExpression
eval/harness/assertions.ts:57:10
  * pattern arguments. Returns an empty array when no bash calls exist.
  */
 export function extractBashCommands(toolCalls: ToolCall[]): string[] {
-  return toolCalls
-    .filter((tc) => tc.name === "bash")
-    .map((tc) => {
-      const cmd = tc.arguments.command;
-      return typeof cmd === "string" ? cmd : "";
-    })
-    .flatMap((cmd) => cmd.split(/\s*&&\s*/))
-    .map((cmd) => cmd.trim())
-    .filter((cmd) => cmd.length > 0);
+  return toolCalls.filter(tc => tc.name === "bash").map(tc => {
+  const cmd = tc.arguments.command;
+  return typeof cmd === "string" ? cmd : "";
+}).flatMap(cmd => cmd.split(/\s*&&\s*/)).map(cmd => cmd.trim());
 }
 
killedBy: extractBashCommands zero case returns empty array when the command is an empty string
statusReason: expected [ '' ] to deeply equal []

[Killed] MethodExpression
eval/harness/assertions.ts:57:10
  * pattern arguments. Returns an empty array when no bash calls exist.
  */
 export function extractBashCommands(toolCalls: ToolCall[]): string[] {
-  return toolCalls
-    .filter((tc) => tc.name === "bash")
+  return toolCalls
     .map((tc) => {
       const cmd = tc.arguments.command;
killedBy: extractBashCommands non-bash tool calls excludes a non-bash call by name even when its arguments carry a command field
statusReason: expected [ 'weaver rename \'{}\'' ] to deeply equal []

[Killed] ArrowFunction
eval/harness/assertions.ts:58:13
  */
 export function extractBashCommands(toolCalls: ToolCall[]): string[] {
   return toolCalls
-    .filter((tc) => tc.name === "bash")
+    .filter(() => undefined)
     .map((tc) => {
       const cmd = tc.arguments.command;
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: expected [] to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] EqualityOperator
eval/harness/assertions.ts:58:21
  */
 export function extractBashCommands(toolCalls: ToolCall[]): string[] {
   return toolCalls
-    .filter((tc) => tc.name === "bash")
+    .filter((tc) => tc.name !== "bash")
     .map((tc) => {
       const cmd = tc.arguments.command;
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: expected [] to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] BlockStatement
eval/harness/assertions.ts:59:18
 export function extractBashCommands(toolCalls: ToolCall[]): string[] {
   return toolCalls
     .filter((tc) => tc.name === "bash")
-    .map((tc) => {
-      const cmd = tc.arguments.command;
-      return typeof cmd === "string" ? cmd : "";
-    })
+    .map((tc) => {})
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
     .map((cmd) => cmd.trim())
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
eval/harness/assertions.ts:61:14
     .filter((tc) => tc.name === "bash")
     .map((tc) => {
       const cmd = tc.arguments.command;
-      return typeof cmd === "string" ? cmd : "";
+      return true ? cmd : "";
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
killedBy: extractBashCommands non-bash tool calls returns empty string for a bash call whose command argument is not a string
statusReason: cmd.split is not a function

[Killed] EqualityOperator
eval/harness/assertions.ts:61:14
     .filter((tc) => tc.name === "bash")
     .map((tc) => {
       const cmd = tc.arguments.command;
-      return typeof cmd === "string" ? cmd : "";
+      return typeof cmd !== "string" ? cmd : "";
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: expected [] to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] ArrowFunction
eval/harness/assertions.ts:63:14
       const cmd = tc.arguments.command;
       return typeof cmd === "string" ? cmd : "";
     })
-    .flatMap((cmd) => cmd.split(/\s*&&\s*/))
+    .flatMap(() => undefined)
     .map((cmd) => cmd.trim())
     .filter((cmd) => cmd.length > 0);
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] Regex
eval/harness/assertions.ts:63:33
       const cmd = tc.arguments.command;
       return typeof cmd === "string" ? cmd : "";
     })
-    .flatMap((cmd) => cmd.split(/\s*&&\s*/))
+    .flatMap((cmd) => cmd.split(/\S*&&\s*/))
     .map((cmd) => cmd.trim())
     .filter((cmd) => cmd.length > 0);
killedBy: extractBashCommands happy path splits on a bare && with no surrounding whitespace
statusReason: expected [ 'weaver rename', …(1) ] to deeply equal [ 'weaver rename \'{}\'', …(1) ]

[Killed] MethodExpression
eval/harness/assertions.ts:64:19
       return typeof cmd === "string" ? cmd : "";
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
-    .map((cmd) => cmd.trim())
+    .map((cmd) => cmd)
     .filter((cmd) => cmd.length > 0);
 }
killedBy: extractBashCommands happy path trims leading and trailing whitespace from a command
statusReason: expected [ '  weaver rename \'{}\'  ' ] to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] ArrowFunction
eval/harness/assertions.ts:64:10
       return typeof cmd === "string" ? cmd : "";
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
-    .map((cmd) => cmd.trim())
+    .map(() => undefined)
     .filter((cmd) => cmd.length > 0);
 }
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
eval/harness/assertions.ts:65:22
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
     .map((cmd) => cmd.trim())
-    .filter((cmd) => cmd.length > 0);
+    .filter((cmd) => false);
 }
 
killedBy: extractBashCommands happy path returns the command string from a bash tool call
statusReason: expected [] to deeply equal [ 'weaver rename \'{}\'' ]

[Killed] EqualityOperator
eval/harness/assertions.ts:65:22
     })
     .flatMap((cmd) => cmd.split(/\s*&&\s*/))
     .map((cmd) => cmd.trim())
-    .filter((cmd) => cmd.length > 0);
+    .filter((cmd) => cmd.length >= 0);
 }
 
killedBy: extractBashCommands zero case returns empty array when the command is an empty string
statusReason: expected [ '' ] to deeply equal []

[Killed] BlockStatement
eval/harness/assertions.ts:86:23
   command: string,
   subcommand: string,
   keyArgs?: Record<string, unknown>,
-): WeaverCommandMatch {
-  const { matched, reason } = classifyCommand(command, subcommand, keyArgs);
-  const outcome: CommandOutcome = matched
-    ? "correct"
-    : weaverSubcommand(command) === subcommand
-      ? "wrong-args"
-      : "wrong-tool";
-  return reason === undefined ? { matched, outcome } : { matched, outcome, reason };
-}
+): WeaverCommandMatch {}
 
 /**
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] EqualityOperator
eval/harness/assertions.ts:90:7
   const { matched, reason } = classifyCommand(command, subcommand, keyArgs);
   const outcome: CommandOutcome = matched
     ? "correct"
-    : weaverSubcommand(command) === subcommand
+    : weaverSubcommand(command) !== subcommand
       ? "wrong-args"
       : "wrong-tool";
killedBy: matchWeaverCommand path key args rejects a different directory whose name is not a trailing segment
statusReason: expected 'wrong-tool' to be 'wrong-args' // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:90:7
   const { matched, reason } = classifyCommand(command, subcommand, keyArgs);
   const outcome: CommandOutcome = matched
     ? "correct"
-    : weaverSubcommand(command) === subcommand
+    : true
       ? "wrong-args"
       : "wrong-tool";
killedBy: matchWeaverCommand outcome is 'wrong-tool' when a different subcommand is invoked
statusReason: expected 'wrong-args' to be 'wrong-tool' // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:93:10
     : weaverSubcommand(command) === subcommand
       ? "wrong-args"
       : "wrong-tool";
-  return reason === undefined ? { matched, outcome } : { matched, outcome, reason };
+  return true ? { matched, outcome } : { matched, outcome, reason };
 }
 
killedBy: matchWeaverCommand happy path does not match npx weaver with wrong subcommand
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
eval/harness/assertions.ts:93:10
     : weaverSubcommand(command) === subcommand
       ? "wrong-args"
       : "wrong-tool";
-  return reason === undefined ? { matched, outcome } : { matched, outcome, reason };
+  return false ? { matched, outcome } : { matched, outcome, reason };
 }
 
killedBy: matchWeaverCommand happy path does not carry a reason property on a successful match
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:109:12
   call: ToolCall,
   expectedCommand: string,
   keyArgs?: Record<string, unknown>,
-): boolean {
-  // extractBashCommands already filters to bash calls, so a non-bash call
-  // yields no candidates here and falls through to `false` on its own — no
-  // separate early-return guard needed.
-  return extractBashCommands([call]).some(
-    (cmd) => matchWeaverCommand(cmd, expectedCommand, keyArgs).matched,
-  );
-}
+): boolean {}
 
 function classifyCommand(
killedBy: matchesExpectedCommand 'is true for the right subcommand with…'
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
eval/harness/assertions.ts:113:10
   // extractBashCommands already filters to bash calls, so a non-bash call
   // yields no candidates here and falls through to `false` on its own — no
   // separate early-return guard needed.
-  return extractBashCommands([call]).some(
-    (cmd) => matchWeaverCommand(cmd, expectedCommand, keyArgs).matched,
-  );
+  return extractBashCommands([call]).every(cmd => matchWeaverCommand(cmd, expectedCommand, keyArgs).matched);
 }
 
killedBy: matchesExpectedCommand 'is false for a non-bash call regardle…'
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
eval/harness/assertions.ts:114:5
   // yields no candidates here and falls through to `false` on its own — no
   // separate early-return guard needed.
   return extractBashCommands([call]).some(
-    (cmd) => matchWeaverCommand(cmd, expectedCommand, keyArgs).matched,
+    () => undefined,
   );
 }
killedBy: matchesExpectedCommand 'is true for the right subcommand with…'
statusReason: expected false to be true // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:124:19
   keyArgs: Record<string, unknown> | undefined,
 ): { matched: boolean; reason?: string } {
   // Match: (npx |pnpm exec )?weaver <subcommand> ['"]...['"]\s*$
-  const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\s\S]*)\2\s*$/;
+  const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\s\S]*)\2\s$/;
   const m = command.match(pattern);
 
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] Regex
eval/harness/assertions.ts:124:19
   keyArgs: Record<string, unknown> | undefined,
 ): { matched: boolean; reason?: string } {
   // Match: (npx |pnpm exec )?weaver <subcommand> ['"]...['"]\s*$
-  const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\s\S]*)\2\s*$/;
+  const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\S\S]*)\2\s*$/;
   const m = command.match(pattern);
 
killedBy: matchWeaverCommand happy path parses JSON content containing spaces after colons and commas
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:127:11
   const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\s\S]*)\2\s*$/;
   const m = command.match(pattern);
 
-  if (!m) {
-    // No prefix alternation here: this check only distinguishes "weaver was
-    // attempted" from "weaver wasn't invoked at all", so a bare substring
-    // test is enough — the npx/pnpm prefix forms all contain the literal
-    // "weaver" token regardless of how they're spaced.
-    if (/weaver/.test(command)) {
-      // weaver is present but format is unexpected
-      return {
-        matched: false,
-        reason: `weaver attempted but command format not recognised: ${command}`,
-      };
-    }
-    return {
-      matched: false,
-      reason: `no weaver attempt — command does not invoke weaver: ${command}`,
-    };
-  }
+  if (!m) {}
 
   const [, actualSubcommand, quote, jsonText] = m;
killedBy: matchWeaverCommand malformed JSON distinguishes malformed JSON from a non-weaver command in the failure reason
statusReason: m is not iterable

[Killed] ConditionalExpression
eval/harness/assertions.ts:127:7
   const pattern = /^(?:npx\s+|pnpm\s+exec\s+)?weaver\s+(\S+)\s+(['"])([\s\S]*)\2\s*$/;
   const m = command.match(pattern);
 
-  if (!m) {
+  if (false) {
     // No prefix alternation here: this check only distinguishes "weaver was
     // attempted" from "weaver wasn't invoked at all", so a bare substring
killedBy: matchWeaverCommand malformed JSON distinguishes malformed JSON from a non-weaver command in the failure reason
statusReason: m is not iterable

[Killed] ConditionalExpression
eval/harness/assertions.ts:132:9
     // attempted" from "weaver wasn't invoked at all", so a bare substring
     // test is enough — the npx/pnpm prefix forms all contain the literal
     // "weaver" token regardless of how they're spaced.
-    if (/weaver/.test(command)) {
+    if (false) {
       // weaver is present but format is unexpected
       return {
killedBy: matchWeaverCommand command format anchoring reports command format not recognised for an unquoted argument, distinct from no weaver attempt
statusReason: expected 'no weaver attempt — command does not …' to contain 'command format not recognised'

[Killed] ConditionalExpression
eval/harness/assertions.ts:132:9
     // attempted" from "weaver wasn't invoked at all", so a bare substring
     // test is enough — the npx/pnpm prefix forms all contain the literal
     // "weaver" token regardless of how they're spaced.
-    if (/weaver/.test(command)) {
+    if (true) {
       // weaver is present but format is unexpected
       return {
killedBy: matchWeaverCommand malformed JSON distinguishes malformed JSON from a non-weaver command in the failure reason
statusReason: expected 'weaver attempted but command format n…' to contain 'no weaver attempt'

[Killed] BlockStatement
eval/harness/assertions.ts:147:40
 
   const [, actualSubcommand, quote, jsonText] = m;
 
-  if (actualSubcommand !== subcommand) {
-    return {
-      matched: false,
-      reason: `wrong subcommand: expected "${subcommand}", got "${actualSubcommand}"`,
-    };
-  }
+  if (actualSubcommand !== subcommand) {}
 
   const parsed = parseJsonArgument(jsonText, quote);
killedBy: matchWeaverCommand happy path does not match npx weaver with wrong subcommand
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
eval/harness/assertions.ts:147:7
 
   const [, actualSubcommand, quote, jsonText] = m;
 
-  if (actualSubcommand !== subcommand) {
+  if (actualSubcommand === subcommand) {
     return {
       matched: false,
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
eval/harness/assertions.ts:155:7
   }
 
   const parsed = parseJsonArgument(jsonText, quote);
-  if (parsed === undefined) {
+  if (parsed !== undefined) {
     return {
       matched: false,
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:155:7
   }
 
   const parsed = parseJsonArgument(jsonText, quote);
-  if (parsed === undefined) {
+  if (true) {
     return {
       matched: false,
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:162:16
     };
   }
 
-  if (keyArgs) {
-    for (const [key, expected] of Object.entries(keyArgs)) {
-      if (!(key in parsed)) {
-        return {
-          matched: false,
-          reason: `missing key arg "${key}" in ${JSON.stringify(parsed)}`,
-        };
-      }
-      const argMatches = PATH_KEY_ARGS.has(key)
-        ? pathArgMatches(expected, parsed[key])
-        : parsed[key] === expected;
-      if (!argMatches) {
-        return {
-          matched: false,
-          reason: `wrong key arg value for "${key}": expected ${JSON.stringify(expected)}, got ${JSON.stringify(parsed[key])}`,
-        };
-      }
-    }
-  }
+  if (keyArgs) {}
 
   return { matched: true };
killedBy: matchWeaverCommand missing key arg does not match when a required key is absent from the JSON
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:162:7
     };
   }
 
-  if (keyArgs) {
+  if (false) {
     for (const [key, expected] of Object.entries(keyArgs)) {
       if (!(key in parsed)) {
killedBy: matchWeaverCommand missing key arg does not match when a required key is absent from the JSON
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:163:60
   }
 
   if (keyArgs) {
-    for (const [key, expected] of Object.entries(keyArgs)) {
-      if (!(key in parsed)) {
-        return {
-          matched: false,
-          reason: `missing key arg "${key}" in ${JSON.stringify(parsed)}`,
-        };
-      }
-      const argMatches = PATH_KEY_ARGS.has(key)
-        ? pathArgMatches(expected, parsed[key])
-        : parsed[key] === expected;
-      if (!argMatches) {
-        return {
-          matched: false,
-          reason: `wrong key arg value for "${key}": expected ${JSON.stringify(expected)}, got ${JSON.stringify(parsed[key])}`,
-        };
-      }
-    }
+    for (const [key, expected] of Object.entries(keyArgs)) {}
   }
 
killedBy: matchWeaverCommand missing key arg does not match when a required key is absent from the JSON
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:164:11
 
   if (keyArgs) {
     for (const [key, expected] of Object.entries(keyArgs)) {
-      if (!(key in parsed)) {
+      if (false) {
         return {
           matched: false,
killedBy: matchWeaverCommand missing key arg does not match when a required key is absent from the JSON
statusReason: expected 'wrong key arg value for "newName": ex…' to contain 'missing key arg'

[Killed] BooleanLiteral
eval/harness/assertions.ts:164:11
 
   if (keyArgs) {
     for (const [key, expected] of Object.entries(keyArgs)) {
-      if (!(key in parsed)) {
+      if (key in parsed) {
         return {
           matched: false,
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:172:11
       }
       const argMatches = PATH_KEY_ARGS.has(key)
         ? pathArgMatches(expected, parsed[key])
-        : parsed[key] === expected;
+        : true;
       if (!argMatches) {
         return {
killedBy: matchWeaverCommand wrong key arg value does not match when a key has the wrong value
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
eval/harness/assertions.ts:172:11
       }
       const argMatches = PATH_KEY_ARGS.has(key)
         ? pathArgMatches(expected, parsed[key])
-        : parsed[key] === expected;
+        : parsed[key] !== expected;
       if (!argMatches) {
         return {
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:173:24
       const argMatches = PATH_KEY_ARGS.has(key)
         ? pathArgMatches(expected, parsed[key])
         : parsed[key] === expected;
-      if (!argMatches) {
-        return {
-          matched: false,
-          reason: `wrong key arg value for "${key}": expected ${JSON.stringify(expected)}, got ${JSON.stringify(parsed[key])}`,
-        };
-      }
+      if (!argMatches) {}
     }
   }
killedBy: matchWeaverCommand wrong key arg value does not match when a key has the wrong value
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:173:11
       const argMatches = PATH_KEY_ARGS.has(key)
         ? pathArgMatches(expected, parsed[key])
         : parsed[key] === expected;
-      if (!argMatches) {
+      if (true) {
         return {
           matched: false,
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
eval/harness/assertions.ts:182:21
     }
   }
 
-  return { matched: true };
+  return { matched: false };
 }
 
killedBy: matchWeaverCommand happy path matches a plain weaver subcommand with single-quoted JSON
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/assertions.ts:194:70
  * `/ws/src/utils.ts` while `utils.ts` does. A different directory (`src/wrong`)
  * is still rejected. Non-string values fall back to exact equality.
  */
-function pathArgMatches(expected: unknown, actual: unknown): boolean {
-  if (typeof expected !== "string" || typeof actual !== "string") {
-    return expected === actual;
-  }
-  return expected === actual || expected.endsWith(`/${actual}`);
-}
+function pathArgMatches(expected: unknown, actual: unknown): boolean {}
 
 // A double-quoted argument usually carries bash-escaped inner quotes
killedBy: matchWeaverCommand path key args accepts a workspace-relative path when the model cd'd into the workspace
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
eval/harness/assertions.ts:195:7
  * is still rejected. Non-string values fall back to exact equality.
  */
 function pathArgMatches(expected: unknown, actual: unknown): boolean {
-  if (typeof expected !== "string" || typeof actual !== "string") {
+  if (typeof expected === "string" || typeof actual !== "string") {
     return expected === actual;
   }
killedBy: matchWeaverCommand path key args accepts a workspace-relative path when the model cd'd into the workspace
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
eval/harness/assertions.ts:195:39
  * is still rejected. Non-string values fall back to exact equality.
  */
 function pathArgMatches(expected: unknown, actual: unknown): boolean {
-  if (typeof expected !== "string" || typeof actual !== "string") {
+  if (typeof expected !== "string" || typeof actual === "string") {
     return expected === actual;
   }
killedBy: matchWeaverCommand path key args accepts a workspace-relative path when the model cd'd into the workspace
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:196:12
  */
 function pathArgMatches(expected: unknown, actual: unknown): boolean {
   if (typeof expected !== "string" || typeof actual !== "string") {
-    return expected === actual;
+    return true;
   }
   return expected === actual || expected.endsWith(`/${actual}`);
killedBy: matchWeaverCommand path key args falls back to exact equality for a non-string actual value (no coercion into a suffix match)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/assertions.ts:196:12
  */
 function pathArgMatches(expected: unknown, actual: unknown): boolean {
   if (typeof expected !== "string" || typeof actual !== "string") {
-    return expected === actual;
+    return false;
   }
   return expected === actual || expected.endsWith(`/${actual}`);
killedBy: matchWeaverCommand path key args matches when a non-string expected and actual value are exactly equal
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
eval/harness/assertions.ts:198:33
   if (typeof expected !== "string" || typeof actual !== "string") {
     return expected === actual;
   }
-  return expected === actual || expected.endsWith(`/${actual}`);
+  return expected === actual || expected.startsWith(`/${actual}`);
 }
 
killedBy: matchWeaverCommand path key args accepts a workspace-relative path when the model cd'd into the workspace
statusReason: expected false to be true // Object.is equality
