[Killed] BlockStatement
eval/harness/command-prompt.ts:12:53
  * so the pressured lane grades the same emission the clean lane does — a change
  * to this wording must move both, not silently diverge them.
  */
-export function commandPrompt(task: string): string {
-  return `${skillContent}\n\n---\n\nTask: ${task}\n\nUse the bash tool to make a single call that accomplishes this task.`;
-}
+export function commandPrompt(task: string): string {}
 
killedBy: buildTrialConfig front-loaded case, single-step puts the skill bodies in the single user turn via the command prompt, not a system skills block
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
