[Killed] ObjectLiteral
eval/harness/config.ts:18:3
 export const GATING_MODELS: readonly GatingModel[] = [
   { id: "anthropic/claude-haiku-4.5", baseTrials: 3 },
   { id: "google/gemini-2.5-flash", baseTrials: 10 },
-  { id: "openai/gpt-5.6-luna", baseTrials: 10 },
+  {},
 ];
 
killedBy: GATING_MODELS names the three gating models with their base trial counts
statusReason: expected [ { …(2) }, { …(2) }, {} ] to deeply equal [ { …(2) }, { …(2) }, { …(2) } ]

[Killed] BlockStatement
eval/harness/config.ts:33:49
 // A set-but-non-numeric value throws rather than silently sending NaN — or,
 // for an empty string, Number("") === 0, which would quietly pin the rate
 // lane to deterministic sampling.
-function parseTemperature(): number | undefined {
-  const raw = process.env.WEAVER_EVAL_TEMPERATURE;
-  if (raw === undefined || raw === "") {
-    return undefined;
-  }
-  const parsed = Number(raw);
-  if (!Number.isFinite(parsed)) {
-    throw new Error(`WEAVER_EVAL_TEMPERATURE must be a finite number, got "${raw}"`);
-  }
-  return parsed;
-}
+function parseTemperature(): number | undefined {}
 
 export function isCleanMode(): boolean {
killedBy: modelConfig temperature parses WEAVER_EVAL_TEMPERATURE as a number when set
statusReason: expected undefined to be 0.3 // Object.is equality

[Killed] EqualityOperator
eval/harness/config.ts:35:28
 // lane to deterministic sampling.
 function parseTemperature(): number | undefined {
   const raw = process.env.WEAVER_EVAL_TEMPERATURE;
-  if (raw === undefined || raw === "") {
+  if (raw === undefined || raw !== "") {
     return undefined;
   }
killedBy: modelConfig temperature parses WEAVER_EVAL_TEMPERATURE as a number when set
statusReason: expected undefined to be 0.3 // Object.is equality

[Killed] BlockStatement
eval/harness/config.ts:35:40
 // lane to deterministic sampling.
 function parseTemperature(): number | undefined {
   const raw = process.env.WEAVER_EVAL_TEMPERATURE;
-  if (raw === undefined || raw === "") {
-    return undefined;
-  }
+  if (raw === undefined || raw === "") {}
   const parsed = Number(raw);
   if (!Number.isFinite(parsed)) {
killedBy: modelConfig temperature leaves temperature undefined when WEAVER_EVAL_TEMPERATURE is not set
statusReason: WEAVER_EVAL_TEMPERATURE must be a finite number, got "undefined"

[Killed] ConditionalExpression
eval/harness/config.ts:39:7
     return undefined;
   }
   const parsed = Number(raw);
-  if (!Number.isFinite(parsed)) {
+  if (true) {
     throw new Error(`WEAVER_EVAL_TEMPERATURE must be a finite number, got "${raw}"`);
   }
killedBy: modelConfig temperature parses WEAVER_EVAL_TEMPERATURE as a number when set
statusReason: WEAVER_EVAL_TEMPERATURE must be a finite number, got "0.3"

[Killed] BlockStatement
eval/harness/config.ts:39:33
     return undefined;
   }
   const parsed = Number(raw);
-  if (!Number.isFinite(parsed)) {
-    throw new Error(`WEAVER_EVAL_TEMPERATURE must be a finite number, got "${raw}"`);
-  }
+  if (!Number.isFinite(parsed)) {}
   return parsed;
 }
killedBy: modelConfig temperature throws when WEAVER_EVAL_TEMPERATURE is set to a non-numeric value
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
eval/harness/config.ts:45:40
   return parsed;
 }
 
-export function isCleanMode(): boolean {
-  return process.env.WEAVER_EVAL_CLEAN === "1";
-}
+export function isCleanMode(): boolean {}
 
 export function modelConfig(): ModelConfig {
killedBy: isCleanMode returns false when WEAVER_EVAL_CLEAN is not set
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/config.ts:46:10
 }
 
 export function isCleanMode(): boolean {
-  return process.env.WEAVER_EVAL_CLEAN === "1";
+  return true;
 }
 
killedBy: isCleanMode returns false when WEAVER_EVAL_CLEAN is not set
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
eval/harness/config.ts:46:10
 }
 
 export function isCleanMode(): boolean {
-  return process.env.WEAVER_EVAL_CLEAN === "1";
+  return process.env.WEAVER_EVAL_CLEAN !== "1";
 }
 
killedBy: isCleanMode returns false when WEAVER_EVAL_CLEAN is not set
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/config.ts:49:44
   return process.env.WEAVER_EVAL_CLEAN === "1";
 }
 
-export function modelConfig(): ModelConfig {
-  return {
-    baseUrl: process.env.WEAVER_EVAL_BASE_URL ?? "",
-    model: process.env.WEAVER_EVAL_MODEL ?? "",
-    // Intentionally undefined when unset so callModel's "no header" branch keys off absence.
-    apiKey: process.env.WEAVER_EVAL_API_KEY,
-    temperature: parseTemperature(),
-  };
-}
+export function modelConfig(): ModelConfig {}
 
 // Printed once at the top of a run so a mislabelled model or knob is visible
killedBy: modelConfig temperature leaves temperature undefined when WEAVER_EVAL_TEMPERATURE is not set
statusReason: Cannot read properties of undefined (reading 'temperature')

[Killed] ObjectLiteral
eval/harness/config.ts:50:10
 }
 
 export function modelConfig(): ModelConfig {
-  return {
-    baseUrl: process.env.WEAVER_EVAL_BASE_URL ?? "",
-    model: process.env.WEAVER_EVAL_MODEL ?? "",
-    // Intentionally undefined when unset so callModel's "no header" branch keys off absence.
-    apiKey: process.env.WEAVER_EVAL_API_KEY,
-    temperature: parseTemperature(),
-  };
+  return {};
 }
 
killedBy: modelConfig temperature parses WEAVER_EVAL_TEMPERATURE as a number when set
statusReason: expected undefined to be 0.3 // Object.is equality

[Killed] LogicalOperator
eval/harness/config.ts:51:14
 
 export function modelConfig(): ModelConfig {
   return {
-    baseUrl: process.env.WEAVER_EVAL_BASE_URL ?? "",
+    baseUrl: process.env.WEAVER_EVAL_BASE_URL && "",
     model: process.env.WEAVER_EVAL_MODEL ?? "",
     // Intentionally undefined when unset so callModel's "no header" branch keys off absence.
killedBy: modelConfig other fields returns all three model config fields
statusReason: expected '' to be 'http://openrouter:8080/v1' // Object.is equality

[Killed] LogicalOperator
eval/harness/config.ts:52:12
 export function modelConfig(): ModelConfig {
   return {
     baseUrl: process.env.WEAVER_EVAL_BASE_URL ?? "",
-    model: process.env.WEAVER_EVAL_MODEL ?? "",
+    model: process.env.WEAVER_EVAL_MODEL && "",
     // Intentionally undefined when unset so callModel's "no header" branch keys off absence.
     apiKey: process.env.WEAVER_EVAL_API_KEY,
killedBy: modelConfig other fields returns all three model config fields
statusReason: expected '' to be 'anthropic/claude-haiku-4.5' // Object.is equality

[Killed] BlockStatement
eval/harness/config.ts:61:65
 
 // Printed once at the top of a run so a mislabelled model or knob is visible
 // in the output itself rather than silently determining what the rates mean.
-export function formatRunHeader(baseTrialCount: number): string {
-  const { model, temperature } = modelConfig();
-  return (
-    `eval run — model ${model} | trials ${baseTrialCount} | ` +
-    `temperature ${temperature ?? "default"} | clean-mode ${isCleanMode() ? "on" : "off"}`
-  );
-}
+export function formatRunHeader(baseTrialCount: number): string {}
 
killedBy: formatRunHeader includes the model, trial count, and default temperature and clean-mode
statusReason: expected undefined to be 'eval run — model anthropic/claude-hai…' // Object.is equality

[Killed] LogicalOperator
eval/harness/config.ts:65:20
   const { model, temperature } = modelConfig();
   return (
     `eval run — model ${model} | trials ${baseTrialCount} | ` +
-    `temperature ${temperature ?? "default"} | clean-mode ${isCleanMode() ? "on" : "off"}`
+    `temperature ${temperature && "default"} | clean-mode ${isCleanMode() ? "on" : "off"}`
   );
 }
killedBy: formatRunHeader includes the model, trial count, and default temperature and clean-mode
statusReason: expected 'eval run — model anthropic/claude-hai…' to be 'eval run — model anthropic/claude-hai…' // Object.is equality
