[Killed] BlockStatement
eval/harness/fixtures.ts:7:66
 export const FIXTURES_DIR = path.resolve(import.meta.dirname, "../fixtures");
 
 /** camelCase operation name → kebab-case CLI subcommand, matching src/adapters/cli/operations.ts */
-export function operationToSubcommand(operation: string): string {
-  return operation.replace(/([A-Z])/g, (m) => `-${m.toLowerCase()}`);
-}
+export function operationToSubcommand(operation: string): string {}
 
 /**
killedBy: eval case coverage operation coverage operation rename has at least one command-stage case
statusReason: No command-stage case for operation "rename" (subcommand: "undefined"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] ArrowFunction
eval/harness/fixtures.ts:8:40
 
 /** camelCase operation name → kebab-case CLI subcommand, matching src/adapters/cli/operations.ts */
 export function operationToSubcommand(operation: string): string {
-  return operation.replace(/([A-Z])/g, (m) => `-${m.toLowerCase()}`);
+  return operation.replace(/([A-Z])/g, () => undefined);
 }
 
killedBy: eval case coverage operation coverage operation moveFile has at least one command-stage case
statusReason: No command-stage case for operation "moveFile" (subcommand: "moveundefinedile"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] MethodExpression
eval/harness/fixtures.ts:8:51
 
 /** camelCase operation name → kebab-case CLI subcommand, matching src/adapters/cli/operations.ts */
 export function operationToSubcommand(operation: string): string {
-  return operation.replace(/([A-Z])/g, (m) => `-${m.toLowerCase()}`);
+  return operation.replace(/([A-Z])/g, (m) => `-${m.toUpperCase()}`);
 }
 
killedBy: eval case coverage operation coverage operation moveFile has at least one command-stage case
statusReason: No command-stage case for operation "moveFile" (subcommand: "move-File"). Add a case to eval/cases/cases.ts.: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/fixtures.ts:15:51
  * Reads a fixture file (path relative to `eval/fixtures/`, extension included)
  * and returns its content — the canned stdout a tool call is fed.
  */
-export function loadFixture(name: string): string {
-  const fixturePath = path.join(FIXTURES_DIR, name);
-  return readFileOrThrow(
-    fixturePath,
-    `Case table references fixture "${name}" but ${fixturePath} does not exist`,
-  );
-}
+export function loadFixture(name: string): string {}
 
statusReason: Unexpected token 'N', "No results"... is not valid JSON
