[Killed] BlockStatement
eval/harness/gate-plan.ts:23:88
 // A set-but-non-numeric override throws rather than reaching the child as
 // "NaN", where every case would run zero trials and alarm — a wasted run that
 // reads as a suite-wide regression instead of a typo.
-function resolveTrials(model: GatingModel, trialsOverride: string | undefined): number {
-  if (trialsOverride === undefined || trialsOverride === "") {
-    return model.baseTrials;
-  }
-  const parsed = Number(trialsOverride);
-  if (!Number.isInteger(parsed) || parsed < 1) {
-    throw new Error(`WEAVER_EVAL_TRIALS must be a positive integer, got "${trialsOverride}"`);
-  }
-  return parsed;
-}
+function resolveTrials(model: GatingModel, trialsOverride: string | undefined): number {}
 
 /**
killedBy: buildGatePlans uses each model's roster trial count when the caller set none
statusReason: expected [ undefined, undefined ] to deeply equal [ 3, 10 ]

[Killed] ConditionalExpression
eval/harness/gate-plan.ts:24:39
 // "NaN", where every case would run zero trials and alarm — a wasted run that
 // reads as a suite-wide regression instead of a typo.
 function resolveTrials(model: GatingModel, trialsOverride: string | undefined): number {
-  if (trialsOverride === undefined || trialsOverride === "") {
+  if (trialsOverride === undefined || false) {
     return model.baseTrials;
   }
killedBy: buildGatePlans uses the roster trial count when WEAVER_EVAL_TRIALS is blank
statusReason: WEAVER_EVAL_TRIALS must be a positive integer, got ""

[Killed] BlockStatement
eval/harness/gate-plan.ts:24:62
 // "NaN", where every case would run zero trials and alarm — a wasted run that
 // reads as a suite-wide regression instead of a typo.
 function resolveTrials(model: GatingModel, trialsOverride: string | undefined): number {
-  if (trialsOverride === undefined || trialsOverride === "") {
-    return model.baseTrials;
-  }
+  if (trialsOverride === undefined || trialsOverride === "") {}
   const parsed = Number(trialsOverride);
   if (!Number.isInteger(parsed) || parsed < 1) {
killedBy: buildGatePlans builds one plan per roster model, in roster order
statusReason: WEAVER_EVAL_TRIALS must be a positive integer, got "undefined"

[Killed] BlockStatement
eval/harness/gate-plan.ts:28:48
     return model.baseTrials;
   }
   const parsed = Number(trialsOverride);
-  if (!Number.isInteger(parsed) || parsed < 1) {
-    throw new Error(`WEAVER_EVAL_TRIALS must be a positive integer, got "${trialsOverride}"`);
-  }
+  if (!Number.isInteger(parsed) || parsed < 1) {}
   return parsed;
 }
killedBy: buildGatePlans rejects a WEAVER_EVAL_TRIALS override of abc rather than passing it to the child
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
eval/harness/gate-plan.ts:28:7
     return model.baseTrials;
   }
   const parsed = Number(trialsOverride);
-  if (!Number.isInteger(parsed) || parsed < 1) {
+  if (!Number.isInteger(parsed) && parsed < 1) {
     throw new Error(`WEAVER_EVAL_TRIALS must be a positive integer, got "${trialsOverride}"`);
   }
killedBy: buildGatePlans rejects a WEAVER_EVAL_TRIALS override of abc rather than passing it to the child
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
eval/harness/gate-plan.ts:44:18
 export function buildGatePlans(
   roster: readonly GatingModel[],
   options: GatePlanOptions = {},
-): GateRunPlan[] {
-  const extraArgv = options.extraArgv ?? [];
-  return roster.map((model) => ({
-    modelId: model.id,
-    trials: resolveTrials(model, options.trialsOverride),
-    argv: ["eval", "--disable-console-intercept", ...extraArgv],
-  }));
-}
+): GateRunPlan[] {}
 
 // Coupled to the exact line gate.llm.test.ts's afterAll prints:
killedBy: buildGatePlans builds one plan per roster model, in roster order
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
eval/harness/gate-plan.ts:45:21
   roster: readonly GatingModel[],
   options: GatePlanOptions = {},
 ): GateRunPlan[] {
-  const extraArgv = options.extraArgv ?? [];
+  const extraArgv = options.extraArgv && [];
   return roster.map((model) => ({
     modelId: model.id,
killedBy: buildGatePlans builds one plan per roster model, in roster order
statusReason: extraArgv is not iterable

[Killed] ArrowFunction
eval/harness/gate-plan.ts:46:21
   options: GatePlanOptions = {},
 ): GateRunPlan[] {
   const extraArgv = options.extraArgv ?? [];
-  return roster.map((model) => ({
-    modelId: model.id,
-    trials: resolveTrials(model, options.trialsOverride),
-    argv: ["eval", "--disable-console-intercept", ...extraArgv],
-  }));
+  return roster.map(() => undefined);
 }
 
killedBy: buildGatePlans builds one plan per roster model, in roster order
statusReason: Cannot read properties of undefined (reading 'modelId')

[Killed] Regex
eval/harness/gate-plan.ts:55:19
 
 // Coupled to the exact line gate.llm.test.ts's afterAll prints:
 // `eval run cost — $${getTotalCost().toFixed(4)}`. Update this pattern if that line's format changes.
-const COST_LINE = /eval run cost — \$([\d.]+)/;
+const COST_LINE = /eval run cost — \$([^\d.]+)/;
 
 /**
killedBy: extractRunCost extracts the cost from the run's reported cost line
statusReason: expected undefined to be 0.1234 // Object.is equality

[Killed] BlockStatement
eval/harness/gate-plan.ts:62:68
  * Returns undefined — never $0 — when the line is absent, so a run that
  * crashed before reporting never reads as a free one.
  */
-export function extractRunCost(output: string): number | undefined {
-  const match = output.match(COST_LINE);
-  return match ? Number.parseFloat(match[1]) : undefined;
-}
+export function extractRunCost(output: string): number | undefined {}
 
killedBy: extractRunCost extracts the cost from the run's reported cost line
statusReason: expected undefined to be 0.1234 // Object.is equality
