[Killed] BlockStatement
eval/harness/run-case.ts:7:87
 import { decideEscalation } from "./verdict.js";
 
 /** Runs one trial for `c`: assembles the exposure-specific config and drives it through {@link runAgenticLoop}. */
-export async function runTrial(c: CaseEntry, step: ModelStep): Promise<AgenticResult> {
-  return runAgenticLoop({ ...buildTrialConfig(c), step });
-}
+export async function runTrial(c: CaseEntry, step: ModelStep): Promise<AgenticResult> {}
 
 export interface CaseRun {
killedBy: runTrial drives the case's assembled config through the agentic loop and reports a match
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] BlockStatement
eval/harness/run-case.ts:27:21
   c: CaseEntry,
   step: ModelStep,
   baseTrials: number,
-): Promise<CaseRun> {
-  const trials: AgenticResult[] = [];
-  for (let i = 0; i < baseTrials; i++) {
-    trials.push(await runTrial(c, step));
-  }
-
-  const passed = trials.filter((t) => t.matched).length;
-  // decideEscalation guarantees additionalTrials is 0 whenever escalate is
-  // false, so the loop is already a no-op in that case — no separate branch
-  // needed on `escalate` itself.
-  const { additionalTrials } = decideEscalation(passed, trials.length);
-  for (let i = 0; i < additionalTrials; i++) {
-    trials.push(await runTrial(c, step));
-  }
-
-  return { trials, hardFailed: trials.some((t) => t.failedAtStep !== undefined) };
-}
+): Promise<CaseRun> {}
 
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: Cannot read properties of undefined (reading 'trials')

[Killed] EqualityOperator
eval/harness/run-case.ts:29:19
   baseTrials: number,
 ): Promise<CaseRun> {
   const trials: AgenticResult[] = [];
-  for (let i = 0; i < baseTrials; i++) {
+  for (let i = 0; i >= baseTrials; i++) {
     trials.push(await runTrial(c, step));
   }
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: expected [ { matched: true, …(7) }, …(5) ] to have a length of 3 but got 6

[Killed] BlockStatement
eval/harness/run-case.ts:29:40
   baseTrials: number,
 ): Promise<CaseRun> {
   const trials: AgenticResult[] = [];
-  for (let i = 0; i < baseTrials; i++) {
-    trials.push(await runTrial(c, step));
-  }
+  for (let i = 0; i < baseTrials; i++) {}
 
   const passed = trials.filter((t) => t.matched).length;
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: expected [ { matched: true, …(7) }, …(5) ] to have a length of 3 but got 6

[Killed] ArrowFunction
eval/harness/run-case.ts:33:32
     trials.push(await runTrial(c, step));
   }
 
-  const passed = trials.filter((t) => t.matched).length;
+  const passed = trials.filter(() => undefined).length;
   // decideEscalation guarantees additionalTrials is 0 whenever escalate is
   // false, so the loop is already a no-op in that case — no separate branch
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: expected [ { matched: true, …(7) }, …(5) ] to have a length of 3 but got 6

[Killed] MethodExpression
eval/harness/run-case.ts:33:18
     trials.push(await runTrial(c, step));
   }
 
-  const passed = trials.filter((t) => t.matched).length;
+  const passed = trials.length;
   // decideEscalation guarantees additionalTrials is 0 whenever escalate is
   // false, so the loop is already a no-op in that case — no separate branch
killedBy: runCaseTrials escalates to the total escalated trial count when the base result falls below the floor
statusReason: expected [ { matched: false, …(6) }, …(2) ] to have a length of 6 but got 3

[Killed] EqualityOperator
eval/harness/run-case.ts:38:19
   // false, so the loop is already a no-op in that case — no separate branch
   // needed on `escalate` itself.
   const { additionalTrials } = decideEscalation(passed, trials.length);
-  for (let i = 0; i < additionalTrials; i++) {
+  for (let i = 0; i <= additionalTrials; i++) {
     trials.push(await runTrial(c, step));
   }
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: expected [ { matched: true, …(7) }, …(3) ] to have a length of 3 but got 4

[Killed] BlockStatement
eval/harness/run-case.ts:38:46
   // false, so the loop is already a no-op in that case — no separate branch
   // needed on `escalate` itself.
   const { additionalTrials } = decideEscalation(passed, trials.length);
-  for (let i = 0; i < additionalTrials; i++) {
-    trials.push(await runTrial(c, step));
-  }
+  for (let i = 0; i < additionalTrials; i++) {}
 
   return { trials, hardFailed: trials.some((t) => t.failedAtStep !== undefined) };
killedBy: runCaseTrials escalates to the total escalated trial count when the base result falls below the floor
statusReason: expected [ { matched: false, …(6) }, …(2) ] to have a length of 6 but got 3

[Killed] ArrowFunction
eval/harness/run-case.ts:42:44
     trials.push(await runTrial(c, step));
   }
 
-  return { trials, hardFailed: trials.some((t) => t.failedAtStep !== undefined) };
+  return { trials, hardFailed: trials.some(() => undefined) };
 }
 
killedBy: runCaseTrials reports hardFailed true when any trial hard-fails on a mutating competitor
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/run-case.ts:42:51
     trials.push(await runTrial(c, step));
   }
 
-  return { trials, hardFailed: trials.some((t) => t.failedAtStep !== undefined) };
+  return { trials, hardFailed: trials.some((t) => false) };
 }
 
killedBy: runCaseTrials reports hardFailed true when any trial hard-fails on a mutating competitor
statusReason: expected false to be true // Object.is equality
