[Killed] ObjectLiteral
eval/harness/seed.ts:19:3
  * principle in docs/eval-design.md).
  */
 const TRUE_SHELL_POOL: TrueShellStep[] = [
-  {
-    userRequest: "Check the build log for any error lines.",
-    assistantIntent: "I'll grep the build log for ERROR lines.",
-    command: 'grep -n "ERROR" /tmp/weaver-eval/build.log',
-    toolOutput: "/tmp/weaver-eval/build.log:42:ERROR: connection timed out after 30s",
-    assistantSummary: "Found one ERROR line: a connection timeout at line 42.",
-  },
+  {},
   {
     userRequest: "Has anyone touched the auth module recently? Check the commit history.",
killedBy: buildHabitMomentumSeed anti-substitution guard every seeded bash command is a true shell tool, never a weaver invocation
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
eval/harness/seed.ts:35:3
     assistantSummary:
       "Found two recent commits touching auth: a session-token fix and a refresh-flow feature.",
   },
-  {
-    userRequest: "Are there any test files for the parser?",
-    assistantIntent: "I'll find files matching the parser test naming pattern.",
-    command: 'find /tmp/weaver-eval -name "*parser*.test.ts"',
-    toolOutput:
-      "/tmp/weaver-eval/src/parser/parser.test.ts\n/tmp/weaver-eval/src/parser/tokenizer.test.ts",
-    assistantSummary: "Found two parser-related test files: parser.test.ts and tokenizer.test.ts.",
-  },
+  {},
 ];
 
killedBy: buildHabitMomentumSeed anti-substitution guard every seeded bash command is a true shell tool, never a weaver invocation
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
eval/harness/seed.ts:60:65
  * throws rather than cycling or silently under-seeding — a typo in a case's
  * `momentumTurns` must fail loud, not quietly weaken the pressure ladder.
  */
-export function buildMomentumPreSteps(turns = 1): ChatMessage[] {
-  if (turns > TRUE_SHELL_POOL.length) {
-    throw new Error(
-      `buildMomentumPreSteps: requested ${turns} turns but the true-shell pool only has ${TRUE_SHELL_POOL.length}`,
-    );
-  }
-
-  return TRUE_SHELL_POOL.slice(0, turns).flatMap((step, index) => {
-    const callId = `seed-shell-${index}`;
-    return [
-      { role: "user", content: step.userRequest },
-      {
-        role: "assistant",
-        content: step.assistantIntent,
-        tool_calls: [{ id: callId, name: "bash", arguments: { command: step.command } }],
-      },
-      { role: "tool", tool_call_id: callId, content: step.toolOutput },
-      { role: "assistant", content: step.assistantSummary },
-    ] as ChatMessage[];
-  });
-}
+export function buildMomentumPreSteps(turns = 1): ChatMessage[] {}
 
 /**
killedBy: runTrial drives the case's assembled config through the agentic loop and reports a match
statusReason: momentum is not iterable

[Killed] EqualityOperator
eval/harness/seed.ts:61:7
  * `momentumTurns` must fail loud, not quietly weaken the pressure ladder.
  */
 export function buildMomentumPreSteps(turns = 1): ChatMessage[] {
-  if (turns > TRUE_SHELL_POOL.length) {
+  if (turns >= TRUE_SHELL_POOL.length) {
     throw new Error(
       `buildMomentumPreSteps: requested ${turns} turns but the true-shell pool only has ${TRUE_SHELL_POOL.length}`,
killedBy: seedForCase momentumTurns present seeds the requested number of turns
statusReason: buildMomentumPreSteps: requested 3 turns but the true-shell pool only has 3

[Killed] ConditionalExpression
eval/harness/seed.ts:61:7
  * `momentumTurns` must fail loud, not quietly weaken the pressure ladder.
  */
 export function buildMomentumPreSteps(turns = 1): ChatMessage[] {
-  if (turns > TRUE_SHELL_POOL.length) {
+  if (true) {
     throw new Error(
       `buildMomentumPreSteps: requested ${turns} turns but the true-shell pool only has ${TRUE_SHELL_POOL.length}`,
killedBy: runTrial drives the case's assembled config through the agentic loop and reports a match
statusReason: buildMomentumPreSteps: requested 0 turns but the true-shell pool only has 3

[Killed] MethodExpression
eval/harness/seed.ts:67:10
     );
   }
 
-  return TRUE_SHELL_POOL.slice(0, turns).flatMap((step, index) => {
+  return TRUE_SHELL_POOL.flatMap((step, index) => {
     const callId = `seed-shell-${index}`;
     return [
killedBy: buildMomentumPreSteps returns no messages for zero turns
statusReason: expected [ { role: 'user', …(1) }, …(11) ] to deeply equal []

[Killed] BlockStatement
eval/harness/seed.ts:67:67
     );
   }
 
-  return TRUE_SHELL_POOL.slice(0, turns).flatMap((step, index) => {
-    const callId = `seed-shell-${index}`;
-    return [
-      { role: "user", content: step.userRequest },
-      {
-        role: "assistant",
-        content: step.assistantIntent,
-        tool_calls: [{ id: callId, name: "bash", arguments: { command: step.command } }],
-      },
-      { role: "tool", tool_call_id: callId, content: step.toolOutput },
-      { role: "assistant", content: step.assistantSummary },
-    ] as ChatMessage[];
-  });
+  return TRUE_SHELL_POOL.slice(0, turns).flatMap((step, index) => {});
 }
 
killedBy: seedForCase momentumTurns absent seeds exactly one true-shell turn, producing five messages
statusReason: expected [ undefined, { role: 'user', …(1) } ] to have a length of 5 but got 2

[Killed] BlockStatement
eval/harness/seed.ts:87:80
  * {@link buildMomentumPreSteps}'s pre-step exchanges followed by the real
  * trigger task as the final user turn.
  */
-export function buildHabitMomentumSeed(task: string, turns = 1): ChatMessage[] {
-  return [...buildMomentumPreSteps(turns), { role: "user", content: task }];
-}
+export function buildHabitMomentumSeed(task: string, turns = 1): ChatMessage[] {}
 
 /**
killedBy: buildHabitMomentumSeed turns omitted defaults to one pre-step, producing five messages
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
eval/harness/seed.ts:99:96
  * pre-steps (e.g. habit momentum) supplies that turn itself, so the task
  * appears exactly once in the resulting conversation.
  */
-export function buildSeedFollowup(step1Command: string, fixtureContent: string): ChatMessage[] {
-  const step1CallId = "seed-step1";
-  return [
-    {
-      role: "assistant",
-      content: null,
-      tool_calls: [{ id: step1CallId, name: "bash", arguments: { command: step1Command } }],
-    },
-    {
-      role: "tool",
-      tool_call_id: step1CallId,
-      content: fixtureContent,
-    },
-  ];
-}
+export function buildSeedFollowup(step1Command: string, fixtureContent: string): ChatMessage[] {}
 
killedBy: buildSeedFollowup produces exactly two messages — no user task turn
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
eval/harness/seed.ts:102:5
 export function buildSeedFollowup(step1Command: string, fixtureContent: string): ChatMessage[] {
   const step1CallId = "seed-step1";
   return [
-    {
-      role: "assistant",
-      content: null,
-      tool_calls: [{ id: step1CallId, name: "bash", arguments: { command: step1Command } }],
-    },
+    {},
     {
       role: "tool",
killedBy: buildTrialConfig front-loaded case, two-step appends the scripted step-1 exchange after a single task turn, not duplicated or reordered
statusReason: expected [ 'system', 'user', undefined, 'tool' ] to deeply equal [ 'system', 'user', 'assistant', …(1) ]

[Killed] ObjectLiteral
eval/harness/seed.ts:105:20
     {
       role: "assistant",
       content: null,
-      tool_calls: [{ id: step1CallId, name: "bash", arguments: { command: step1Command } }],
+      tool_calls: [{}],
     },
     {
killedBy: buildSeedFollowup the assistant turn carries a single bash call for the step-1 command
statusReason: expected undefined to be 'bash' // Object.is equality

[Killed] ObjectLiteral
eval/harness/seed.ts:107:5
       content: null,
       tool_calls: [{ id: step1CallId, name: "bash", arguments: { command: step1Command } }],
     },
-    {
-      role: "tool",
-      tool_call_id: step1CallId,
-      content: fixtureContent,
-    },
+    {},
   ];
 }
killedBy: buildSeedFollowup produces exactly two messages — no user task turn
statusReason: expected [ 'assistant', undefined ] to deeply equal [ 'assistant', 'tool' ]
