[Killed] BlockStatement
eval/harness/verdict.ts:13:68
  * No trials at all is below the floor. Integer comparison would otherwise read
  * 0/0 as clearing, so a harness fault that ran nothing would gate green.
  */
-export function belowFloor(passed: number, total: number): boolean {
-  if (total === 0) return true;
-  return passed * 3 < total * 2;
-}
+export function belowFloor(passed: number, total: number): boolean {}
 
 export interface EscalationDecision {
killedBy: decideEscalation escalates when no trials ran at all
statusReason: expected { escalate: false, …(1) } to deeply equal { escalate: true, additionalTrials: 6 }

[Killed] ConditionalExpression
eval/harness/verdict.ts:14:7
  * 0/0 as clearing, so a harness fault that ran nothing would gate green.
  */
 export function belowFloor(passed: number, total: number): boolean {
-  if (total === 0) return true;
+  if (true) return true;
   return passed * 3 < total * 2;
 }
killedBy: runCaseTrials stops at the base trial count when every trial passes
statusReason: expected [ { matched: true, …(7) }, …(5) ] to have a length of 3 but got 6

[Killed] ConditionalExpression
eval/harness/verdict.ts:14:7
  * 0/0 as clearing, so a harness fault that ran nothing would gate green.
  */
 export function belowFloor(passed: number, total: number): boolean {
-  if (total === 0) return true;
+  if (false) return true;
   return passed * 3 < total * 2;
 }
killedBy: decideEscalation escalates when no trials ran at all
statusReason: expected { escalate: false, …(1) } to deeply equal { escalate: true, additionalTrials: 6 }

[Killed] EqualityOperator
eval/harness/verdict.ts:15:10
  */
 export function belowFloor(passed: number, total: number): boolean {
   if (total === 0) return true;
-  return passed * 3 < total * 2;
+  return passed * 3 >= total * 2;
 }
 
killedBy: decideEscalation a clean sweep does not escalate when every trial passes
statusReason: expected { escalate: true, additionalTrials: 3 } to deeply equal { escalate: false, …(1) }

[Killed] ArithmeticOperator
eval/harness/verdict.ts:15:10
  */
 export function belowFloor(passed: number, total: number): boolean {
   if (total === 0) return true;
-  return passed * 3 < total * 2;
+  return passed / 3 < total * 2;
 }
 
killedBy: decideEscalation a clean sweep does not escalate when every trial passes
statusReason: expected { escalate: true, additionalTrials: 3 } to deeply equal { escalate: false, …(1) }

[Killed] BlockStatement
eval/harness/verdict.ts:35:85
  * {@link ESCALATED_TRIALS} — a case already at or past that total has no
  * headroom left to escalate into, regardless of its rate.
  */
-export function decideEscalation(passed: number, total: number): EscalationDecision {
-  const hasHeadroom = total < ESCALATED_TRIALS;
-  const sweptClean = passed === total;
-  const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
-  return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
-}
+export function decideEscalation(passed: number, total: number): EscalationDecision {}
 
 /**
killedBy: decideEscalation at the 2/3 floor (inclusive) but not a clean sweep still escalates at 2/3 — cleared the floor but unresolved
statusReason: expected undefined to deeply equal { escalate: true, additionalTrials: 3 }

[Killed] EqualityOperator
eval/harness/verdict.ts:36:23
  * headroom left to escalate into, regardless of its rate.
  */
 export function decideEscalation(passed: number, total: number): EscalationDecision {
-  const hasHeadroom = total < ESCALATED_TRIALS;
+  const hasHeadroom = total >= ESCALATED_TRIALS;
   const sweptClean = passed === total;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
killedBy: decideEscalation at the 2/3 floor (inclusive) but not a clean sweep still escalates at 2/3 — cleared the floor but unresolved
statusReason: expected { escalate: false, …(1) } to deeply equal { escalate: true, additionalTrials: 3 }

[Killed] ConditionalExpression
eval/harness/verdict.ts:36:23
  * headroom left to escalate into, regardless of its rate.
  */
 export function decideEscalation(passed: number, total: number): EscalationDecision {
-  const hasHeadroom = total < ESCALATED_TRIALS;
+  const hasHeadroom = true;
   const sweptClean = passed === total;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
killedBy: decideEscalation already at or past the escalated total does not escalate at 9/10 — past the escalated total despite being unresolved
statusReason: expected { Object (escalate, additionalTrials) } to deeply equal { escalate: false, …(1) }

[Killed] ConditionalExpression
eval/harness/verdict.ts:37:22
  */
 export function decideEscalation(passed: number, total: number): EscalationDecision {
   const hasHeadroom = total < ESCALATED_TRIALS;
-  const sweptClean = passed === total;
+  const sweptClean = false;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
   return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
killedBy: decideEscalation a clean sweep does not escalate when every trial passes
statusReason: expected { escalate: true, additionalTrials: 3 } to deeply equal { escalate: false, …(1) }

[Killed] ConditionalExpression
eval/harness/verdict.ts:37:22
  */
 export function decideEscalation(passed: number, total: number): EscalationDecision {
   const hasHeadroom = total < ESCALATED_TRIALS;
-  const sweptClean = passed === total;
+  const sweptClean = true;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
   return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
killedBy: decideEscalation at the 2/3 floor (inclusive) but not a clean sweep still escalates at 2/3 — cleared the floor but unresolved
statusReason: expected { escalate: false, …(1) } to deeply equal { escalate: true, additionalTrials: 3 }

[Killed] LogicalOperator
eval/harness/verdict.ts:38:20
 export function decideEscalation(passed: number, total: number): EscalationDecision {
   const hasHeadroom = total < ESCALATED_TRIALS;
   const sweptClean = passed === total;
-  const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
+  const escalate = hasHeadroom || belowFloor(passed, total) || !sweptClean;
   return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
 }
killedBy: decideEscalation a clean sweep does not escalate when every trial passes
statusReason: expected { escalate: true, additionalTrials: 3 } to deeply equal { escalate: false, …(1) }

[Killed] ConditionalExpression
eval/harness/verdict.ts:38:36
 export function decideEscalation(passed: number, total: number): EscalationDecision {
   const hasHeadroom = total < ESCALATED_TRIALS;
   const sweptClean = passed === total;
-  const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
+  const escalate = hasHeadroom && (true);
   return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
 }
killedBy: decideEscalation a clean sweep does not escalate when every trial passes
statusReason: expected { escalate: true, additionalTrials: 3 } to deeply equal { escalate: false, …(1) }

[Killed] ArithmeticOperator
eval/harness/verdict.ts:39:51
   const hasHeadroom = total < ESCALATED_TRIALS;
   const sweptClean = passed === total;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
-  return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
+  return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS + total : 0 };
 }
 
killedBy: decideEscalation at the 2/3 floor (inclusive) but not a clean sweep still escalates at 2/3 — cleared the floor but unresolved
statusReason: expected { escalate: true, additionalTrials: 9 } to deeply equal { escalate: true, additionalTrials: 3 }

[Killed] ObjectLiteral
eval/harness/verdict.ts:39:10
   const hasHeadroom = total < ESCALATED_TRIALS;
   const sweptClean = passed === total;
   const escalate = hasHeadroom && (belowFloor(passed, total) || !sweptClean);
-  return { escalate, additionalTrials: escalate ? ESCALATED_TRIALS - total : 0 };
+  return {};
 }
 
killedBy: decideEscalation at the 2/3 floor (inclusive) but not a clean sweep still escalates at 2/3 — cleared the floor but unresolved
statusReason: expected {} to deeply equal { escalate: true, additionalTrials: 3 }

[Killed] BlockStatement
eval/harness/verdict.ts:50:12
 export function isDemotedForModel(
   models: readonly string[] | undefined,
   activeModel: string,
-): boolean {
-  return (models ?? []).includes(activeModel);
-}
+): boolean {}
 
 /**
killedBy: isDemotedForModel is false when the case carries no marker at all
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
eval/harness/verdict.ts:51:11
   models: readonly string[] | undefined,
   activeModel: string,
 ): boolean {
-  return (models ?? []).includes(activeModel);
+  return (models && []).includes(activeModel);
 }
 
killedBy: isDemotedForModel is false when the case carries no marker at all
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
eval/harness/verdict.ts:66:13
   total: number;
   hardFailed: boolean;
   observational: boolean;
-}): boolean {
-  if (input.hardFailed) {
-    return true;
-  }
-  if (input.observational) {
-    return false;
-  }
-  return belowFloor(input.passed, input.total);
-}
+}): boolean {}
 
 /**
killedBy: caseAlarms normal case, boundaries pinned at both trial counts clears at 2/3
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
eval/harness/verdict.ts:67:25
   hardFailed: boolean;
   observational: boolean;
 }): boolean {
-  if (input.hardFailed) {
-    return true;
-  }
+  if (input.hardFailed) {}
   if (input.observational) {
     return false;
killedBy: caseAlarms hard-failed trial alarms regardless of an otherwise-clearing rate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/verdict.ts:67:7
   hardFailed: boolean;
   observational: boolean;
 }): boolean {
-  if (input.hardFailed) {
+  if (false) {
     return true;
   }
killedBy: caseAlarms hard-failed trial alarms regardless of an otherwise-clearing rate
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
eval/harness/verdict.ts:68:12
   observational: boolean;
 }): boolean {
   if (input.hardFailed) {
-    return true;
+    return false;
   }
   if (input.observational) {
killedBy: caseAlarms hard-failed trial alarms regardless of an otherwise-clearing rate
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
eval/harness/verdict.ts:70:7
   if (input.hardFailed) {
     return true;
   }
-  if (input.observational) {
+  if (false) {
     return false;
   }
killedBy: caseAlarms observational marking never alarms on a below-floor rate alone
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/verdict.ts:70:28
   if (input.hardFailed) {
     return true;
   }
-  if (input.observational) {
-    return false;
-  }
+  if (input.observational) {}
   return belowFloor(input.passed, input.total);
 }
killedBy: caseAlarms observational marking never alarms on a below-floor rate alone
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
eval/harness/verdict.ts:71:12
     return true;
   }
   if (input.observational) {
-    return false;
+    return true;
   }
   return belowFloor(input.passed, input.total);
killedBy: caseAlarms observational marking never alarms on a below-floor rate alone
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/verdict.ts:82:93
  * the case is demoted on the active model, in which case the over-trigger is
  * still measured and printed but never fails the case there.
  */
-export function boundaryCaseAlarms(input: { allClean: boolean; demoted: boolean }): boolean {
-  return !input.allClean && !input.demoted;
-}
+export function boundaryCaseAlarms(input: { allClean: boolean; demoted: boolean }): boolean {}
 
 /** True when an observational case passed every trial — reportable as "at ceiling — consider promoting". */
killedBy: boundaryCaseAlarms does not alarm when every trial stayed clean
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
eval/harness/verdict.ts:83:10
  * still measured and printed but never fails the case there.
  */
 export function boundaryCaseAlarms(input: { allClean: boolean; demoted: boolean }): boolean {
-  return !input.allClean && !input.demoted;
+  return !input.allClean || !input.demoted;
 }
 
killedBy: boundaryCaseAlarms does not alarm when every trial stayed clean
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
eval/harness/verdict.ts:83:10
  * still measured and printed but never fails the case there.
  */
 export function boundaryCaseAlarms(input: { allClean: boolean; demoted: boolean }): boolean {
-  return !input.allClean && !input.demoted;
+  return input.allClean && !input.demoted;
 }
 
killedBy: boundaryCaseAlarms does not alarm when every trial stayed clean
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
eval/harness/verdict.ts:91:13
   passed: number;
   total: number;
   observational: boolean;
-}): boolean {
-  return input.observational && input.total > 0 && input.passed === input.total;
-}
+}): boolean {}
 
killedBy: isAtCeiling is true for an observational case that passed every trial
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
eval/harness/verdict.ts:92:33
   total: number;
   observational: boolean;
 }): boolean {
-  return input.observational && input.total > 0 && input.passed === input.total;
+  return input.observational && input.total >= 0 && input.passed === input.total;
 }
 
killedBy: isAtCeiling is false when there are no trials to have passed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
eval/harness/verdict.ts:92:52
   total: number;
   observational: boolean;
 }): boolean {
-  return input.observational && input.total > 0 && input.passed === input.total;
+  return input.observational && input.total > 0 && true;
 }
 
killedBy: isAtCeiling is false for an observational case with any failing trial
statusReason: expected true to be false // Object.is equality
