[Killed] EqualityOperator
src/daemon/daemon.ts:51:7
     const raw = fs.readFile(lockfilePath(workspaceRoot));
     const parsed = JSON.parse(raw) as unknown;
     if (
-      typeof parsed === "object" &&
+      typeof parsed !== "object" &&
       parsed !== null &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:98:7
 ): Promise<void> {
   const { timeoutMs = 5_000, fs = defaultFs } = opts;
   const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return;
+  if (false) return;
   try {
     process.kill(lock.pid, "SIGTERM");

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:105:10
     // already gone
   }
   const deadline = Date.now() + timeoutMs;
-  while (Date.now() < deadline) {
+  while (false) {
     if (!isDaemonAlive(workspaceRoot, fs)) break;
     await new Promise((r) => setTimeout(r, 50));

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:106:9
   }
   const deadline = Date.now() + timeoutMs;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(workspaceRoot, fs)) break;
+    if (isDaemonAlive(workspaceRoot, fs)) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:114:7
 
 export async function runStop(opts: { workspace: string }): Promise<void> {
   const wsResult = validateWorkspace(opts.workspace, new NodeFileSystem());
-  if (!wsResult.ok) {
+  if (false) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:122:7
   }
   const absWorkspace = wsResult.workspace;
 
-  if (!isDaemonAlive(absWorkspace)) {
+  if (true) {
     process.stdout.write(
       `${JSON.stringify({ status: "success", stopped: false, message: "No daemon running for this workspace" })}\n`,

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:130:7
   }
 
   const lock = readLockfile(absWorkspace);
-  if (lock === null) {
+  if (true) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Could not read lockfile" })}\n`,

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:130:7
   }
 
   const lock = readLockfile(absWorkspace);
-  if (lock === null) {
+  if (lock !== null) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Could not read lockfile" })}\n`,

[NoCoverage] BlockStatement
src/daemon/daemon.ts:140:33
 
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
-  while (Date.now() < deadline) {
-    if (!isDaemonAlive(absWorkspace)) break;
-    await new Promise((r) => setTimeout(r, 50));
-  }
+  while (Date.now() < deadline) {}
 
   // Defensive cleanup in case the daemon didn't remove files before exiting

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:141:9
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(absWorkspace)) break;
+    if (isDaemonAlive(absWorkspace)) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:187:7
 }
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
-  if (opts.verbose !== undefined) return opts.verbose;
+  if (opts.verbose === undefined) return opts.verbose;
   return process.env.WEAVER_VERBOSE === "1";
 }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:188:10
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
   if (opts.verbose !== undefined) return opts.verbose;
-  return process.env.WEAVER_VERBOSE === "1";
+  return false;
 }
 

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:222:36
 
   // Only ever runs inside a spawned daemon, so the whole of `runDaemon` is outside the
   // mutation lane's reach (it excludes subprocess-spawning tests).
-  const idleTimer = startIdleTimer({
-    now: Date.now,
-    evict: evictAllDiagnosticParses,
-  });
+  const idleTimer = startIdleTimer({});
 
   await runLifecycle({

[NoCoverage] BlockStatement
src/daemon/daemon.ts:233:23
     pid: process.pid,
     fs: nodeFs,
     host,
-    onShutdown: () => {
-      idleTimer.stop();
-    },
+    onShutdown: () => {},
     startServer: () => {
       const server = net.createServer((socket) => {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:239:46
     startServer: () => {
       const server = net.createServer((socket) => {
         let buf = "";
-        socket.on("data", (chunk: Buffer) => {
-          buf += chunk.toString();
-          const lines = buf.split("\n");
-          buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() =>
-                handleSocketRequest(socket, trimmed, absWorkspace, logger, idleTimer.reset),
-              );
-            }
-          }
-        });
+        socket.on("data", (chunk: Buffer) => {});
         socket.on("error", (err) => {
           if (logger) {

[NoCoverage] CallExpression
src/daemon/daemon.ts:239:9
     startServer: () => {
       const server = net.createServer((socket) => {
         let buf = "";
-        socket.on("data", (chunk: Buffer) => {
-          buf += chunk.toString();
-          const lines = buf.split("\n");
-          buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() =>
-                handleSocketRequest(socket, trimmed, absWorkspace, logger, idleTimer.reset),
-              );
-            }
-          }
-        });
+        ;
         socket.on("error", (err) => {
           if (logger) {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:243:37
           buf += chunk.toString();
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() =>
-                handleSocketRequest(socket, trimmed, absWorkspace, logger, idleTimer.reset),
-              );
-            }
-          }
+          for (const line of lines) {}
         });
         socket.on("error", (err) => {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:244:17
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";
           for (const line of lines) {
-            if (line.trim()) {
+            if (true) {
               const trimmed = line.trim();
               queue = queue.then(() =>

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:246:34
           for (const line of lines) {
             if (line.trim()) {
               const trimmed = line.trim();
-              queue = queue.then(() =>
-                handleSocketRequest(socket, trimmed, absWorkspace, logger, idleTimer.reset),
+              queue = queue.then(() => undefined,
               );
             }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:253:15
           }
         });
         socket.on("error", (err) => {
-          if (logger) {
+          if (false) {
             const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
             logger.log({

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:328:7
   let response: DispatchResponse | { status: "success"; buildId: number };
 
   const parsed = parseLine(line);
-  if (!parsed.ok) {
+  if (false) {
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:330:10
   const parsed = parseLine(line);
   if (!parsed.ok) {
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
-  } else {
-    const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
-    if (!envelope.success) {
-      const message = envelope.error.issues.map((i) => i.message).join("; ");
-      response = { status: "error", error: "PARSE_ERROR", message };
-    } else {
-      method = envelope.data.method;
-      response =
-        method === "ping"
-          ? { status: "success", buildId: RUNNING_BUILD_ID }
-          : await dispatchRequest(envelope.data, workspace, onActivity);
-    }
-  }
+  } else {}
 
   socket.write(serialiseResponse(response));

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:332:9
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {
     const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
-    if (!envelope.success) {
+    if (false) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };

[NoCoverage] BlockStatement
src/daemon/daemon.ts:335:12
     if (!envelope.success) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };
-    } else {
-      method = envelope.data.method;
-      response =
-        method === "ping"
-          ? { status: "success", buildId: RUNNING_BUILD_ID }
-          : await dispatchRequest(envelope.data, workspace, onActivity);
-    }
+    } else {}
   }
 

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:338:9
     } else {
       method = envelope.data.method;
       response =
-        method === "ping"
+        false
           ? { status: "success", buildId: RUNNING_BUILD_ID }
           : await dispatchRequest(envelope.data, workspace, onActivity);

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:346:17
 
   socket.write(serialiseResponse(response));
 
-  if (logger && method !== "ping") {
+  if (logger && method === "ping") {
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:350:7
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;
     const status =
-      typeof res.status === "string" ? (res.status as "success" | "warn" | "error") : "error";
+      typeof res.status !== "string" ? (res.status as "success" | "warn" | "error") : "error";
     const entry: import("./logger.js").LogEntry = {
       ts: new Date().toISOString(),

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:360:11
 
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
-      if (typeof res.message === "string") entry.message = res.message;
+      if (false) entry.message = res.message;
       if (typeof res.stack === "string") entry.stack = res.stack;
     }

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:361:11
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;
-      if (typeof res.stack === "string") entry.stack = res.stack;
+      if (typeof res.stack !== "string") entry.stack = res.stack;
     }
 

[NoCoverage] BlockStatement
src/daemon/daemon.ts:364:58
       if (typeof res.stack === "string") entry.stack = res.stack;
     }
 
-    if (status !== "error" && WRITE_METHODS.has(method)) {
-      const modified = res.filesModified;
-      if (Array.isArray(modified)) {
-        entry.filesModified = modified.length;
-      } else if (typeof modified === "number") {
-        entry.filesModified = modified;
-      }
-    }
+    if (status !== "error" && WRITE_METHODS.has(method)) {}
 
     logger.log(entry);

[NoCoverage] BlockStatement
src/daemon/daemon.ts:368:48
       const modified = res.filesModified;
       if (Array.isArray(modified)) {
         entry.filesModified = modified.length;
-      } else if (typeof modified === "number") {
-        entry.filesModified = modified;
-      }
+      } else if (typeof modified === "number") {}
     }
 
