[Killed] ObjectLiteral
src/daemon/dispatcher.ts:123:15
     },
   },
 
-  moveSymbol: {
-    pathParams: ["sourceFile", "destFile"],
-    schema: MoveSymbolArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { sourceFile, symbolName, destFile, force } = params as {
-        sourceFile: string;
-        symbolName: string;
-        destFile: string;
-        force?: boolean;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      const { moveSymbol } = await import("../operations/moveSymbol.js");
-      return moveSymbol(engine, sourceFile, symbolName, destFile, scope, { force });
-    },
-  },
+  moveSymbol: {},
 
   extractFunction: {
killedBy: dispatchRequest per-operation dispatch dispatches moveSymbol and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:136:74
       const engine = await registry.projectEngine();
       const scope = new WorkspaceScope(workspace, defaultFs);
       const { moveSymbol } = await import("../operations/moveSymbol.js");
-      return moveSymbol(engine, sourceFile, symbolName, destFile, scope, { force });
+      return moveSymbol(engine, sourceFile, symbolName, destFile, scope, {});
     },
   },
killedBy: dispatchRequest moveSymbol force option with force:true, a same-named symbol already in destFile is replaced
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:202:18
     },
   },
 
-  getDefinition: {
-    pathParams: ["file"],
-    schema: GetDefinitionArgsSchema,
-    async invoke(registry, params) {
-      const { file, line, col } = params as { file: string; line: number; col: number };
-      const engine = await registry.projectEngine();
-      return getDefinition(engine, file, line, col, defaultFs);
-    },
-  },
+  getDefinition: {},
 
   getTypeErrors: {
killedBy: dispatchRequest per-operation dispatch dispatches getDefinition and returns definition shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:270:33
         }>;
       };
       const scope = new WorkspaceScope(workspace, defaultFs);
-      return replaceText(scope, { pattern, replacement, glob, excludeGlob, edits });
+      return replaceText(scope, {});
     },
   },
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:315:28
 }
 
 function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {
-  if (EngineError.is(err)) {
-    return { status: "error", error: err.code, message: err.message };
-  }
+  if (EngineError.is(err)) {}
   if (err instanceof Error) {
     return {
killedBy: dispatchRequest moveSymbol force option without force, a same-named symbol already in destFile is rejected
statusReason: expected 'INTERNAL_ERROR' to be 'SYMBOL_EXISTS' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:318:7
   if (EngineError.is(err)) {
     return { status: "error", error: err.code, message: err.message };
   }
-  if (err instanceof Error) {
+  if (false) {
     return {
       status: "error",
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected { status: 'error', …(2) } to match object { status: 'error', …(2) }

[Killed] BlockStatement
src/daemon/dispatcher.ts:356:26
     }
 
     const parsed = descriptor.schema.safeParse(req.params);
-    if (!parsed.success) {
-      const message = parsed.error.issues.map((i) => i.message).join("; ");
-      return { status: "error" as const, error: "VALIDATION_ERROR", message };
-    }
+    if (!parsed.success) {}
 
     for (const paramKey of descriptor.pathParams) {
killedBy: dispatchRequest param validation returns VALIDATION_ERROR — rename with line as string
statusReason: expected { status: 'error', …(3) } to match object { status: 'error', …(1) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:356:9
     }
 
     const parsed = descriptor.schema.safeParse(req.params);
-    if (!parsed.success) {
+    if (true) {
       const message = parsed.error.issues.map((i) => i.message).join("; ");
       return { status: "error" as const, error: "VALIDATION_ERROR", message };
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] EqualityOperator
src/daemon/dispatcher.ts:366:11
       // Every current caller of this operation supplies every pathParam it declares, except
       // getTypeErrors's `file`/`tsconfig` — both optional, and mutually exclusive with each
       // other, so either (or neither) can be absent from a given request.
-      if (value === undefined) continue;
+      if (value !== undefined) continue;
       const pathResult = validateFilePath(value);
       if (!pathResult.ok) {
killedBy: dispatchRequest per-operation dispatch dispatches getTypeErrors and returns diagnostics shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:368:11
       // other, so either (or neither) can be absent from a given request.
       if (value === undefined) continue;
       const pathResult = validateFilePath(value);
-      if (!pathResult.ok) {
+      if (false) {
         return {
           status: "error" as const,
killedBy: dispatchRequest path character validation returns INVALID_PATH and does not invoke the operation when file contains a control character — null byte
statusReason: expected 'FILE_NOT_FOUND' to be 'INVALID_PATH' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:373:13
           status: "error" as const,
           error: "INVALID_PATH",
           message:
-            pathResult.reason === "CONTROL_CHARS"
+            true
               ? `path contains control characters: ${paramKey}`
               : `path contains URI fragment or query character: ${paramKey}`,
killedBy: dispatchRequest path character validation returns INVALID_PATH when file contains URI character — question mark (?)
statusReason: expected 'path contains control characters: file' to contain 'URI fragment or query character'

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:378:11
               : `path contains URI fragment or query character: ${paramKey}`,
         };
       }
-      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
+      if (true) {
         return {
           status: "error" as const,
killedBy: dispatchRequest per-operation dispatch dispatches findReferences and returns references shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:378:11
               : `path contains URI fragment or query character: ${paramKey}`,
         };
       }
-      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
+      if (false) {
         return {
           status: "error" as const,
killedBy: dispatchRequest workspace boundary enforcement returns WORKSPACE_VIOLATION when a path param is outside the workspace
statusReason: expected 'FILE_NOT_FOUND' to be 'WORKSPACE_VIOLATION' // Object.is equality

[Killed] BooleanLiteral
src/daemon/dispatcher.ts:397:11
       // routes above it doesn't tolerate a miss — checked here, before that read, so a
       // missing or directory tsconfig comes back as FILE_NOT_FOUND rather than whatever
       // ts-morph/TypeScript does when handed a path that isn't a file.
-      if (!defaultFs.exists(explicitTsConfig) || defaultFs.stat(explicitTsConfig).isDirectory()) {
+      if (defaultFs.exists(explicitTsConfig) || defaultFs.stat(explicitTsConfig).isDirectory()) {
         return {
           status: "error" as const,
killedBy: getTypeErrors scenarios a project-wide check answers for a named tsconfig instead of the discovered one
statusReason: tsconfig.json (the discovered default) excludes tests/, but naming tsconfig.test.json directly answers for that config's own program instead — the excluded file's error surfaces, and checked.tsconfig names the config that actually answered.


response: expected { status: 'error', …(2) } to deeply equal { status: 'success', …(5) }

[Killed] LogicalOperator
src/daemon/dispatcher.ts:417:7
     >;
 
     if (
-      parsed.data.checkTypeErrors !== false &&
-      Array.isArray(result.filesModified) &&
-      (result.filesModified as string[]).length > 0
+      parsed.data.checkTypeErrors !== false && Array.isArray(result.filesModified) || (result.filesModified as string[]).length > 0
     ) {
       const engine = await registry.projectEngine();
killedBy: dispatchRequest getTypeErrors engine routing in a Vue project single-file call on a .vue file returns that file's diagnostics instead of throwing
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:419:7
     if (
       parsed.data.checkTypeErrors !== false &&
       Array.isArray(result.filesModified) &&
-      (result.filesModified as string[]).length > 0
+      true
     ) {
       const engine = await registry.projectEngine();
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) produces no typeErrors fields when no files are modified
statusReason: expected { status: 'success', …(5) } to not have property "typeErrors"

[Killed] EqualityOperator
src/daemon/dispatcher.ts:433:52
     }
 
     const status =
-      typeof result.typeErrorCount === "number" && result.typeErrorCount > 0
+      typeof result.typeErrorCount === "number" && result.typeErrorCount >= 0
         ? ("warn" as const)
         : ("success" as const);
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'warn' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:437:17
         ? ("warn" as const)
         : ("success" as const);
     return { status, ...result };
-  } catch (err) {
-    return toDispatchError(err, req.method, workspace);
-  } finally {
+  } catch (err) {} finally {
     onActivity?.();
   }
killedBy: moveFile scenarios refuses to move a file that does not exist, leaving the workspace alone
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/daemon/dispatcher.ts:439:13
     return { status, ...result };
   } catch (err) {
     return toDispatchError(err, req.method, workspace);
-  } finally {
-    onActivity?.();
-  }
+  } finally {}
 }
 
killedBy: idle activity signal reports activity after a request has been dispatched
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] OptionalChaining
src/daemon/dispatcher.ts:440:5
   } catch (err) {
     return toDispatchError(err, req.method, workspace);
   } finally {
-    onActivity?.();
+    onActivity();
   }
 }
killedBy: dispatchRequest param validation returns VALIDATION_ERROR — rename with line as string
statusReason: onActivity is not a function
