[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:267:20
    * Evicts the diagnostic service and every parse across all tsconfigs, so the
    * next `get` rebuilds from disk.
    */
-  evictAll(): void {
-    this.entries.clear();
-  }
+  evictAll(): void {}
 }
 
killedBy: DiagnosticServiceCache evictAll rebuilds every tsconfig's program on the next get
statusReason: expected "readFile" to be called at least once

[Killed] CallExpression
src/ts-engine/diagnostic-service.ts:268:5
    * next `get` rebuilds from disk.
    */
   evictAll(): void {
-    this.entries.clear();
+    ;
   }
 }
killedBy: DiagnosticServiceCache evictAll rebuilds every tsconfig's program on the next get
statusReason: expected "readFile" to be called at least once
