[Killed] BlockStatement
src/daemon/daemon.ts:47:46
 function readLockfile(
   workspaceRoot: string,
   fs: FileSystem = defaultFs,
-): { pid: number; startedAt: number } | null {
-  try {
-    const raw = fs.readFile(lockfilePath(workspaceRoot));
-    const parsed = JSON.parse(raw) as unknown;
-    if (
-      typeof parsed === "object" &&
-      parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
-      typeof (parsed as Record<string, unknown>).startedAt === "number"
-    ) {
-      return parsed as { pid: number; startedAt: number };
-    }
-    return null;
-  } catch {
-    return null;
-  }
-}
+): { pid: number; startedAt: number } | null {}
 
 export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:48:7
   workspaceRoot: string,
   fs: FileSystem = defaultFs,
 ): { pid: number; startedAt: number } | null {
-  try {
-    const raw = fs.readFile(lockfilePath(workspaceRoot));
-    const parsed = JSON.parse(raw) as unknown;
-    if (
-      typeof parsed === "object" &&
-      parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
-      typeof (parsed as Record<string, unknown>).startedAt === "number"
-    ) {
-      return parsed as { pid: number; startedAt: number };
-    }
-    return null;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/daemon.ts:52:7
     const raw = fs.readFile(lockfilePath(workspaceRoot));
     const parsed = JSON.parse(raw) as unknown;
     if (
-      typeof parsed === "object" &&
-      parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
-      typeof (parsed as Record<string, unknown>).startedAt === "number"
+      false
     ) {
       return parsed as { pid: number; startedAt: number };
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/daemon/daemon.ts:52:7
     const raw = fs.readFile(lockfilePath(workspaceRoot));
     const parsed = JSON.parse(raw) as unknown;
     if (
-      typeof parsed === "object" &&
-      parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
+      typeof parsed === "object" && parsed !== null || typeof (parsed as Record<string, unknown>).pid === "number" &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"
     ) {
killedBy: isDaemonAlive returns false when lockfile pid is a numeric string, even if it names a live PID and a socket file exists
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/daemon/daemon.ts:53:7
     const parsed = JSON.parse(raw) as unknown;
     if (
       typeof parsed === "object" &&
-      parsed !== null &&
+      parsed === null &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/daemon/daemon.ts:53:7
     const parsed = JSON.parse(raw) as unknown;
     if (
       typeof parsed === "object" &&
-      parsed !== null &&
+      true &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"

[Killed] EqualityOperator
src/daemon/daemon.ts:54:7
     if (
       typeof parsed === "object" &&
       parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
+      typeof (parsed as Record<string, unknown>).pid !== "number" &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"
     ) {
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/daemon.ts:54:7
     if (
       typeof parsed === "object" &&
       parsed !== null &&
-      typeof (parsed as Record<string, unknown>).pid === "number" &&
+      true &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"
     ) {
killedBy: isDaemonAlive returns false when lockfile pid is a numeric string, even if it names a live PID and a socket file exists
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/daemon/daemon.ts:55:7
       typeof parsed === "object" &&
       parsed !== null &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
-      typeof (parsed as Record<string, unknown>).startedAt === "number"
+      typeof (parsed as Record<string, unknown>).startedAt !== "number"
     ) {
       return parsed as { pid: number; startedAt: number };
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/daemon/daemon.ts:55:7
       typeof parsed === "object" &&
       parsed !== null &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
-      typeof (parsed as Record<string, unknown>).startedAt === "number"
+      true
     ) {
       return parsed as { pid: number; startedAt: number };

[Killed] BlockStatement
src/daemon/daemon.ts:56:7
       parsed !== null &&
       typeof (parsed as Record<string, unknown>).pid === "number" &&
       typeof (parsed as Record<string, unknown>).startedAt === "number"
-    ) {
-      return parsed as { pid: number; startedAt: number };
-    }
+    ) {}
     return null;
   } catch {
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/daemon/daemon.ts:60:11
       return parsed as { pid: number; startedAt: number };
     }
     return null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/daemon/daemon.ts:65:91
   }
 }
 
-export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {
-  const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return false;
-  try {
-    process.kill(lock.pid, 0); // throws if process doesn't exist
-  } catch {
-    return false;
-  }
-  // A running daemon always has a socket file. If the socket is gone but the
-  // PID is alive, it's likely a recycled PID from a crashed daemon.
-  return fs.exists(socketPath(workspaceRoot));
-}
+export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {}
 
 export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {
killedBy: isDaemonAlive returns false when no lockfile exists
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/daemon/daemon.ts:67:7
 
 export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {
   const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return false;
+  if (true) return false;
   try {
     process.kill(lock.pid, 0); // throws if process doesn't exist
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/daemon/daemon.ts:67:7
 
 export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {
   const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return false;
+  if (lock !== null) return false;
   try {
     process.kill(lock.pid, 0); // throws if process doesn't exist
killedBy: isDaemonAlive returns true when lockfile has a live PID and socket file exists
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:68:7
 export function isDaemonAlive(workspaceRoot: string, fs: FileSystem = defaultFs): boolean {
   const lock = readLockfile(workspaceRoot, fs);
   if (lock === null) return false;
-  try {
-    process.kill(lock.pid, 0); // throws if process doesn't exist
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: isDaemonAlive returns false when lockfile has a non-existent PID even if a stale socket file exists
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/daemon.ts:69:5
   const lock = readLockfile(workspaceRoot, fs);
   if (lock === null) return false;
   try {
-    process.kill(lock.pid, 0); // throws if process doesn't exist
+    ; // throws if process doesn't exist
   } catch {
     return false;
killedBy: isDaemonAlive returns false when lockfile has a non-existent PID even if a stale socket file exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:70:11
   if (lock === null) return false;
   try {
     process.kill(lock.pid, 0); // throws if process doesn't exist
-  } catch {
-    return false;
-  }
+  } catch {}
   // A running daemon always has a socket file. If the socket is gone but the
   // PID is alive, it's likely a recycled PID from a crashed daemon.
killedBy: isDaemonAlive returns false when lockfile has a non-existent PID even if a stale socket file exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:78:92
   return fs.exists(socketPath(workspaceRoot));
 }
 
-export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {
-  for (const p of [socketPath(workspaceRoot), lockfilePath(workspaceRoot)]) {
-    try {
-      fs.unlink(p);
-    } catch {
-      // already gone
-    }
-  }
-}
+export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {}
 
 /**
killedBy: isDaemonAlive returns false when lockfile has a live PID but socket file is missing
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:79:77
 }
 
 export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {
-  for (const p of [socketPath(workspaceRoot), lockfilePath(workspaceRoot)]) {
-    try {
-      fs.unlink(p);
-    } catch {
-      // already gone
-    }
-  }
+  for (const p of [socketPath(workspaceRoot), lockfilePath(workspaceRoot)]) {}
 }
 
killedBy: isDaemonAlive returns false when no lockfile exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/daemon.ts:80:9
 
 export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {
   for (const p of [socketPath(workspaceRoot), lockfilePath(workspaceRoot)]) {
-    try {
-      fs.unlink(p);
-    } catch {
+    try {} catch {
       // already gone
     }
killedBy: isDaemonAlive returns false when no lockfile exists
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/daemon.ts:81:7
 export function removeDaemonFiles(workspaceRoot: string, fs: FileSystem = defaultFs): void {
   for (const p of [socketPath(workspaceRoot), lockfilePath(workspaceRoot)]) {
     try {
-      fs.unlink(p);
+      ;
     } catch {
       // already gone
killedBy: isDaemonAlive returns false when lockfile has a live PID but socket file is missing
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
src/daemon/daemon.ts:96:18
 export async function stopDaemon(
   workspaceRoot: string,
   opts: { timeoutMs?: number; fs?: FileSystem } = {},
-): Promise<void> {
-  const { timeoutMs = 5_000, fs = defaultFs } = opts;
-  const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return;
-  try {
-    process.kill(lock.pid, "SIGTERM");
-  } catch {
-    // already gone
-  }
-  const deadline = Date.now() + timeoutMs;
-  while (Date.now() < deadline) {
-    if (!isDaemonAlive(workspaceRoot, fs)) break;
-    await new Promise((r) => setTimeout(r, 50));
-  }
-  removeDaemonFiles(workspaceRoot, fs);
-}
+): Promise<void> {}
 
 export async function runStop(opts: { workspace: string }): Promise<void> {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:99:7
 ): Promise<void> {
   const { timeoutMs = 5_000, fs = defaultFs } = opts;
   const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return;
+  if (true) return;
   try {
     process.kill(lock.pid, "SIGTERM");

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:99:7
 ): Promise<void> {
   const { timeoutMs = 5_000, fs = defaultFs } = opts;
   const lock = readLockfile(workspaceRoot, fs);
-  if (lock === null) return;
+  if (lock !== null) return;
   try {
     process.kill(lock.pid, "SIGTERM");

[NoCoverage] BlockStatement
src/daemon/daemon.ts:100:7
   const { timeoutMs = 5_000, fs = defaultFs } = opts;
   const lock = readLockfile(workspaceRoot, fs);
   if (lock === null) return;
-  try {
-    process.kill(lock.pid, "SIGTERM");
-  } catch {
+  try {} catch {
     // already gone
   }

[NoCoverage] CallExpression
src/daemon/daemon.ts:101:5
   const lock = readLockfile(workspaceRoot, fs);
   if (lock === null) return;
   try {
-    process.kill(lock.pid, "SIGTERM");
+    ;
   } catch {
     // already gone

[NoCoverage] ArithmeticOperator
src/daemon/daemon.ts:105:20
   } catch {
     // already gone
   }
-  const deadline = Date.now() + timeoutMs;
+  const deadline = Date.now() - timeoutMs;
   while (Date.now() < deadline) {
     if (!isDaemonAlive(workspaceRoot, fs)) break;

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:106:10
     // already gone
   }
   const deadline = Date.now() + timeoutMs;
-  while (Date.now() < deadline) {
+  while (Date.now() >= deadline) {
     if (!isDaemonAlive(workspaceRoot, fs)) break;
     await new Promise((r) => setTimeout(r, 50));

[NoCoverage] BlockStatement
src/daemon/daemon.ts:106:33
     // already gone
   }
   const deadline = Date.now() + timeoutMs;
-  while (Date.now() < deadline) {
-    if (!isDaemonAlive(workspaceRoot, fs)) break;
-    await new Promise((r) => setTimeout(r, 50));
-  }
+  while (Date.now() < deadline) {}
   removeDaemonFiles(workspaceRoot, fs);
 }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:107:9
   }
   const deadline = Date.now() + timeoutMs;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(workspaceRoot, fs)) break;
+    if (false) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:107:9
   }
   const deadline = Date.now() + timeoutMs;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(workspaceRoot, fs)) break;
+    if (true) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:108:23
   const deadline = Date.now() + timeoutMs;
   while (Date.now() < deadline) {
     if (!isDaemonAlive(workspaceRoot, fs)) break;
-    await new Promise((r) => setTimeout(r, 50));
+    await new Promise(() => undefined);
   }
   removeDaemonFiles(workspaceRoot, fs);

[NoCoverage] CallExpression
src/daemon/daemon.ts:110:3
     if (!isDaemonAlive(workspaceRoot, fs)) break;
     await new Promise((r) => setTimeout(r, 50));
   }
-  removeDaemonFiles(workspaceRoot, fs);
+  ;
 }
 

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:115:7
 
 export async function runStop(opts: { workspace: string }): Promise<void> {
   const wsResult = validateWorkspace(opts.workspace, new NodeFileSystem());
-  if (!wsResult.ok) {
+  if (wsResult.ok) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:115:7
 
 export async function runStop(opts: { workspace: string }): Promise<void> {
   const wsResult = validateWorkspace(opts.workspace, new NodeFileSystem());
-  if (!wsResult.ok) {
+  if (true) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:117:25
   const wsResult = validateWorkspace(opts.workspace, new NodeFileSystem());
   if (!wsResult.ok) {
     process.stdout.write(
-      `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,
+      `${JSON.stringify({})}\n`,
     );
     process.exit(1);

[NoCoverage] CallExpression
src/daemon/daemon.ts:119:5
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,
     );
-    process.exit(1);
+    ;
   }
   const absWorkspace = wsResult.workspace;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:123:7
   }
   const absWorkspace = wsResult.workspace;
 
-  if (!isDaemonAlive(absWorkspace)) {
+  if (false) {
     process.stdout.write(
       `${JSON.stringify({ status: "success", stopped: false, message: "No daemon running for this workspace" })}\n`,

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:123:7
   }
   const absWorkspace = wsResult.workspace;
 
-  if (!isDaemonAlive(absWorkspace)) {
+  if (isDaemonAlive(absWorkspace)) {
     process.stdout.write(
       `${JSON.stringify({ status: "success", stopped: false, message: "No daemon running for this workspace" })}\n`,

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:125:55
 
   if (!isDaemonAlive(absWorkspace)) {
     process.stdout.write(
-      `${JSON.stringify({ status: "success", stopped: false, message: "No daemon running for this workspace" })}\n`,
+      `${JSON.stringify({ status: "success", stopped: true, message: "No daemon running for this workspace" })}\n`,
     );
     return;

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:125:25
 
   if (!isDaemonAlive(absWorkspace)) {
     process.stdout.write(
-      `${JSON.stringify({ status: "success", stopped: false, message: "No daemon running for this workspace" })}\n`,
+      `${JSON.stringify({})}\n`,
     );
     return;

[NoCoverage] BlockStatement
src/daemon/daemon.ts:131:22
   }
 
   const lock = readLockfile(absWorkspace);
-  if (lock === null) {
-    process.stdout.write(
-      `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Could not read lockfile" })}\n`,
-    );
-    process.exit(1);
-  }
+  if (lock === null) {}
   process.kill(lock.pid, "SIGTERM");
 

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:131:7
   }
 
   const lock = readLockfile(absWorkspace);
-  if (lock === null) {
+  if (false) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Could not read lockfile" })}\n`,

[NoCoverage] CallExpression
src/daemon/daemon.ts:137:3
     );
     process.exit(1);
   }
-  process.kill(lock.pid, "SIGTERM");
+  ;
 
   // Wait for daemon to stop; it removes its own files on SIGTERM

[NoCoverage] ArithmeticOperator
src/daemon/daemon.ts:140:20
   process.kill(lock.pid, "SIGTERM");
 
   // Wait for daemon to stop; it removes its own files on SIGTERM
-  const deadline = Date.now() + 5_000;
+  const deadline = Date.now() - 5_000;
   while (Date.now() < deadline) {
     if (!isDaemonAlive(absWorkspace)) break;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:141:10
 
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
-  while (Date.now() < deadline) {
+  while (false) {
     if (!isDaemonAlive(absWorkspace)) break;
     await new Promise((r) => setTimeout(r, 50));

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:141:10
 
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
-  while (Date.now() < deadline) {
+  while (Date.now() <= deadline) {
     if (!isDaemonAlive(absWorkspace)) break;
     await new Promise((r) => setTimeout(r, 50));

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:142:9
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(absWorkspace)) break;
+    if (true) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:142:9
   // Wait for daemon to stop; it removes its own files on SIGTERM
   const deadline = Date.now() + 5_000;
   while (Date.now() < deadline) {
-    if (!isDaemonAlive(absWorkspace)) break;
+    if (false) break;
     await new Promise((r) => setTimeout(r, 50));
   }

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:143:23
   const deadline = Date.now() + 5_000;
   while (Date.now() < deadline) {
     if (!isDaemonAlive(absWorkspace)) break;
-    await new Promise((r) => setTimeout(r, 50));
+    await new Promise(() => undefined);
   }
 

[NoCoverage] CallExpression
src/daemon/daemon.ts:147:3
   }
 
   // Defensive cleanup in case the daemon didn't remove files before exiting
-  removeDaemonFiles(absWorkspace);
+  ;
 
   if (isDaemonAlive(absWorkspace)) {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:149:7
   // Defensive cleanup in case the daemon didn't remove files before exiting
   removeDaemonFiles(absWorkspace);
 
-  if (isDaemonAlive(absWorkspace)) {
+  if (false) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Daemon did not stop within the timeout" })}\n`,

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:149:7
   // Defensive cleanup in case the daemon didn't remove files before exiting
   removeDaemonFiles(absWorkspace);
 
-  if (isDaemonAlive(absWorkspace)) {
+  if (true) {
     process.stdout.write(
       `${JSON.stringify({ status: "error", error: "ENGINE_ERROR", message: "Daemon did not stop within the timeout" })}\n`,

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:156:72
     process.exit(1);
   }
 
-  process.stdout.write(`${JSON.stringify({ status: "success", stopped: true })}\n`);
+  process.stdout.write(`${JSON.stringify({ status: "success", stopped: false })}\n`);
 }
 

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:156:42
     process.exit(1);
   }
 
-  process.stdout.write(`${JSON.stringify({ status: "success", stopped: true })}\n`);
+  process.stdout.write(`${JSON.stringify({})}\n`);
 }
 

[Killed] BlockStatement
src/daemon/daemon.ts:170:22
   shouldSuppress: (filePath: string) => boolean;
   invalidateFile: (filePath: string) => void;
   invalidateAll: () => void;
-}): WatcherCallbacks {
-  return {
-    onFileChanged: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateFile(filePath);
-    },
-    onFileAdded: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
-    onFileRemoved: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
-  };
-}
+}): WatcherCallbacks {}
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
killedBy: buildWatcherCallbacks for a .ts file onFileChanged skips invalidateFile when the ledger marks the write as the daemon's own
statusReason: Cannot read properties of undefined (reading 'onFileChanged')

[Killed] ObjectLiteral
src/daemon/daemon.ts:171:10
   invalidateFile: (filePath: string) => void;
   invalidateAll: () => void;
 }): WatcherCallbacks {
-  return {
-    onFileChanged: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateFile(filePath);
-    },
-    onFileAdded: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
-    onFileRemoved: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
-  };
+  return {};
 }
 
killedBy: buildWatcherCallbacks for a .ts file onFileChanged skips invalidateFile when the ledger marks the write as the daemon's own
statusReason: callbacks.onFileChanged is not a function

[Killed] BlockStatement
src/daemon/daemon.ts:172:34
   invalidateAll: () => void;
 }): WatcherCallbacks {
   return {
-    onFileChanged: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateFile(filePath);
-    },
+    onFileChanged: (filePath) => {},
     onFileAdded: (filePath) => {
       if (deps.shouldSuppress(filePath)) return;
killedBy: buildWatcherCallbacks for a .ts file onFileChanged invalidates the file when the ledger does not recognise the write
statusReason: expected "vi.fn()" to be called once with arguments: [ '/workspace/src/utils.ts' ]

Number of calls: 0

[Killed] ConditionalExpression
src/daemon/daemon.ts:173:11
 }): WatcherCallbacks {
   return {
     onFileChanged: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (false) return;
       deps.invalidateFile(filePath);
     },
killedBy: buildWatcherCallbacks for a .ts file onFileChanged skips invalidateFile when the ledger marks the write as the daemon's own
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/workspace/src/utils.ts",

[Killed] ConditionalExpression
src/daemon/daemon.ts:173:11
 }): WatcherCallbacks {
   return {
     onFileChanged: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (true) return;
       deps.invalidateFile(filePath);
     },
killedBy: buildWatcherCallbacks for a .ts file onFileChanged invalidates the file when the ledger does not recognise the write
statusReason: expected "vi.fn()" to be called once with arguments: [ '/workspace/src/utils.ts' ]

Number of calls: 0

[Killed] CallExpression
src/daemon/daemon.ts:174:7
   return {
     onFileChanged: (filePath) => {
       if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateFile(filePath);
+      ;
     },
     onFileAdded: (filePath) => {
killedBy: buildWatcherCallbacks for a .ts file onFileChanged invalidates the file when the ledger does not recognise the write
statusReason: expected "vi.fn()" to be called once with arguments: [ '/workspace/src/utils.ts' ]

Number of calls: 0

[Killed] BlockStatement
src/daemon/daemon.ts:176:32
       if (deps.shouldSuppress(filePath)) return;
       deps.invalidateFile(filePath);
     },
-    onFileAdded: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
+    onFileAdded: (filePath) => {},
     onFileRemoved: (filePath) => {
       if (deps.shouldSuppress(filePath)) return;
killedBy: buildWatcherCallbacks for a .ts file onFileAdded invalidates all compilers when the ledger does not recognise the add
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/daemon/daemon.ts:177:11
       deps.invalidateFile(filePath);
     },
     onFileAdded: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (true) return;
       deps.invalidateAll();
     },
killedBy: buildWatcherCallbacks for a .ts file onFileAdded invalidates all compilers when the ledger does not recognise the add
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/daemon/daemon.ts:177:11
       deps.invalidateFile(filePath);
     },
     onFileAdded: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (false) return;
       deps.invalidateAll();
     },
killedBy: buildWatcherCallbacks for a .ts file onFileAdded skips invalidateAll when the ledger marks the add as the daemon's own
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] CallExpression
src/daemon/daemon.ts:178:7
     },
     onFileAdded: (filePath) => {
       if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
+      ;
     },
     onFileRemoved: (filePath) => {
killedBy: buildWatcherCallbacks for a .ts file onFileAdded invalidates all compilers when the ledger does not recognise the add
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/daemon/daemon.ts:180:34
       if (deps.shouldSuppress(filePath)) return;
       deps.invalidateAll();
     },
-    onFileRemoved: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
-      deps.invalidateAll();
-    },
+    onFileRemoved: (filePath) => {},
   };
 }
killedBy: buildWatcherCallbacks for a .ts file onFileRemoved invalidates all compilers when the ledger does not recognise the removal
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/daemon/daemon.ts:181:11
       deps.invalidateAll();
     },
     onFileRemoved: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (false) return;
       deps.invalidateAll();
     },
killedBy: buildWatcherCallbacks for a .ts file onFileRemoved skips invalidateAll when the ledger marks the removal as the daemon's own
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/daemon/daemon.ts:181:11
       deps.invalidateAll();
     },
     onFileRemoved: (filePath) => {
-      if (deps.shouldSuppress(filePath)) return;
+      if (true) return;
       deps.invalidateAll();
     },
killedBy: buildWatcherCallbacks for a .ts file onFileRemoved invalidates all compilers when the ledger does not recognise the removal
statusReason: expected "vi.fn()" to be called once, but got 0 times
