[NoCoverage] BlockStatement
src/daemon/daemon.ts:187:63
   };
 }
 
-function resolveVerbose(opts: { verbose?: boolean }): boolean {
-  if (opts.verbose !== undefined) return opts.verbose;
-  return process.env.WEAVER_VERBOSE === "1";
-}
+function resolveVerbose(opts: { verbose?: boolean }): boolean {}
 
 export async function runDaemon(opts: { workspace: string; verbose?: boolean }): Promise<void> {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:188:7
 }
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
-  if (opts.verbose !== undefined) return opts.verbose;
+  if (true) return opts.verbose;
   return process.env.WEAVER_VERBOSE === "1";
 }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:188:7
 }
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
-  if (opts.verbose !== undefined) return opts.verbose;
+  if (false) return opts.verbose;
   return process.env.WEAVER_VERBOSE === "1";
 }

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:189:10
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
   if (opts.verbose !== undefined) return opts.verbose;
-  return process.env.WEAVER_VERBOSE === "1";
+  return process.env.WEAVER_VERBOSE !== "1";
 }
 

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:189:10
 
 function resolveVerbose(opts: { verbose?: boolean }): boolean {
   if (opts.verbose !== undefined) return opts.verbose;
-  return process.env.WEAVER_VERBOSE === "1";
+  return true;
 }
 

[NoCoverage] BlockStatement
src/daemon/daemon.ts:194:21
 
 export async function runDaemon(opts: { workspace: string; verbose?: boolean }): Promise<void> {
   const wsResult = validateWorkspace(opts.workspace, new NodeFileSystem());
-  if (!wsResult.ok) {
-    process.stdout.write(
-      `${JSON.stringify({ status: "error", error: "VALIDATION_ERROR", message: wsResult.error })}\n`,
-    );
-    process.exit(1);
-  }
+  if (!wsResult.ok) {}
   const absWorkspace = wsResult.workspace;
   const verbose = resolveVerbose(opts);

[NoCoverage] CallExpression
src/daemon/daemon.ts:203:3
   const absWorkspace = wsResult.workspace;
   const verbose = resolveVerbose(opts);
 
-  ensureCacheDir();
+  ;
 
   const sockPath = socketPath(absWorkspace);

[NoCoverage] CallExpression
src/daemon/daemon.ts:209:3
   const pidPath = lockfilePath(absWorkspace);
   const logger = verbose ? createLogger(absWorkspace) : null;
 
-  removeDaemonFiles(absWorkspace);
+  ;
 
   const nodeFs = new NodeFileSystem();

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:213:15
 
   const nodeFs = new NodeFileSystem();
   const host: DaemonHost = {
-    onSignal: (signal, handler) => process.on(signal, handler),
+    onSignal: () => undefined,
     exit: (code) => process.exit(code),
   };

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:214:11
   const nodeFs = new NodeFileSystem();
   const host: DaemonHost = {
     onSignal: (signal, handler) => process.on(signal, handler),
-    exit: (code) => process.exit(code),
+    exit: () => undefined,
   };
 

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:224:36
   // Only ever runs inside a spawned daemon, so the whole of `runDaemon` is outside the
   // mutation lane's reach (it excludes subprocess-spawning tests). The idle eviction is
   // verified end to end against a live daemon instead.
-  const idleTimer = startIdleTimer({
-    now: Date.now,
-    evict: evictAllDiagnosticParses,
-  });
+  const idleTimer = startIdleTimer({});
   setActivityCallback(idleTimer.reset);
 

[NoCoverage] CallExpression
src/daemon/daemon.ts:228:3
     now: Date.now,
     evict: evictAllDiagnosticParses,
   });
-  setActivityCallback(idleTimer.reset);
+  ;
 
   await runLifecycle({

[NoCoverage] BlockStatement
src/daemon/daemon.ts:236:23
     pid: process.pid,
     fs: nodeFs,
     host,
-    onShutdown: () => {
-      idleTimer.stop();
-      setActivityCallback(undefined);
-    },
+    onShutdown: () => {},
     startServer: () => {
       const server = net.createServer((socket) => {

[NoCoverage] CallExpression
src/daemon/daemon.ts:237:7
     fs: nodeFs,
     host,
     onShutdown: () => {
-      idleTimer.stop();
+      ;
       setActivityCallback(undefined);
     },

[NoCoverage] CallExpression
src/daemon/daemon.ts:238:7
     host,
     onShutdown: () => {
       idleTimer.stop();
-      setActivityCallback(undefined);
+      ;
     },
     startServer: () => {

[NoCoverage] CallExpression
src/daemon/daemon.ts:243:9
     startServer: () => {
       const server = net.createServer((socket) => {
         let buf = "";
-        socket.on("data", (chunk: Buffer) => {
-          buf += chunk.toString();
-          const lines = buf.split("\n");
-          buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
-            }
-          }
-        });
+        ;
         socket.on("error", (err) => {
           if (logger) {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:243:46
     startServer: () => {
       const server = net.createServer((socket) => {
         let buf = "";
-        socket.on("data", (chunk: Buffer) => {
-          buf += chunk.toString();
-          const lines = buf.split("\n");
-          buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
-            }
-          }
-        });
+        socket.on("data", (chunk: Buffer) => {});
         socket.on("error", (err) => {
           if (logger) {

[NoCoverage] AssignmentOperator
src/daemon/daemon.ts:244:11
       const server = net.createServer((socket) => {
         let buf = "";
         socket.on("data", (chunk: Buffer) => {
-          buf += chunk.toString();
+          buf -= chunk.toString();
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";

[NoCoverage] LogicalOperator
src/daemon/daemon.ts:246:17
         socket.on("data", (chunk: Buffer) => {
           buf += chunk.toString();
           const lines = buf.split("\n");
-          buf = lines.pop() ?? "";
+          buf = lines.pop() && "";
           for (const line of lines) {
             if (line.trim()) {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:247:37
           buf += chunk.toString();
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";
-          for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
-            }
-          }
+          for (const line of lines) {}
         });
         socket.on("error", (err) => {

[NoCoverage] MethodExpression
src/daemon/daemon.ts:248:17
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";
           for (const line of lines) {
-            if (line.trim()) {
+            if (line) {
               const trimmed = line.trim();
               queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));

[NoCoverage] BlockStatement
src/daemon/daemon.ts:248:30
           const lines = buf.split("\n");
           buf = lines.pop() ?? "";
           for (const line of lines) {
-            if (line.trim()) {
-              const trimmed = line.trim();
-              queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
-            }
+            if (line.trim()) {}
           }
         });

[NoCoverage] MethodExpression
src/daemon/daemon.ts:249:31
           buf = lines.pop() ?? "";
           for (const line of lines) {
             if (line.trim()) {
-              const trimmed = line.trim();
+              const trimmed = line;
               queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
             }

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:250:34
           for (const line of lines) {
             if (line.trim()) {
               const trimmed = line.trim();
-              queue = queue.then(() => handleSocketRequest(socket, trimmed, absWorkspace, logger));
+              queue = queue.then(() => undefined);
             }
           }

[NoCoverage] BlockStatement
src/daemon/daemon.ts:254:37
             }
           }
         });
-        socket.on("error", (err) => {
-          if (logger) {
-            const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
-            logger.log({
-              ts: new Date().toISOString(),
-              method: "socket.error",
-              durationMs: 0,
-              status: "error",
-              error: code,
-              message: err.message,
-            });
-          }
-        });
+        socket.on("error", (err) => {});
       });
       return server;

[NoCoverage] CallExpression
src/daemon/daemon.ts:254:9
             }
           }
         });
-        socket.on("error", (err) => {
-          if (logger) {
-            const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
-            logger.log({
-              ts: new Date().toISOString(),
-              method: "socket.error",
-              durationMs: 0,
-              status: "error",
-              error: code,
-              message: err.message,
-            });
-          }
-        });
+        ;
       });
       return server;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:255:15
           }
         });
         socket.on("error", (err) => {
-          if (logger) {
+          if (true) {
             const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
             logger.log({

[NoCoverage] BlockStatement
src/daemon/daemon.ts:255:23
           }
         });
         socket.on("error", (err) => {
-          if (logger) {
-            const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
-            logger.log({
-              ts: new Date().toISOString(),
-              method: "socket.error",
-              durationMs: 0,
-              status: "error",
-              error: code,
-              message: err.message,
-            });
-          }
+          if (logger) {}
         });
       });

[NoCoverage] LogicalOperator
src/daemon/daemon.ts:256:26
         });
         socket.on("error", (err) => {
           if (logger) {
-            const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
+            const code = (err as NodeJS.ErrnoException).code && "UNKNOWN";
             logger.log({
               ts: new Date().toISOString(),

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:257:24
         socket.on("error", (err) => {
           if (logger) {
             const code = (err as NodeJS.ErrnoException).code ?? "UNKNOWN";
-            logger.log({
-              ts: new Date().toISOString(),
-              method: "socket.error",
-              durationMs: 0,
-              status: "error",
-              error: code,
-              message: err.message,
-            });
+            logger.log({});
           }
         });

[NoCoverage] BlockStatement
src/daemon/daemon.ts:270:25
       });
       return server;
     },
-    startWatcher: () => {
-      // Watch VUE_EXTENSIONS unconditionally rather than choosing based on the
-      // project's structure at startup: a TS-only project that gains its first
-      // .vue file mid-session needs edits to that file observed too, and engine
-      // selection (see resetDiscoveryCaches) is already re-evaluated per dispatch
-      // regardless of what the watcher reports.
-      return startWatcher(
-        absWorkspace,
-        VUE_EXTENSIONS,
-        buildWatcherCallbacks({
-          shouldSuppress: shouldSuppressSelfWrite,
-          invalidateFile,
-          invalidateAll,
-        }),
-      );
-    },
+    startWatcher: () => {},
     signalReady: () => {
       process.stderr.write(`${JSON.stringify({ status: "ready", workspace: absWorkspace })}\n`);

[NoCoverage] BlockStatement
src/daemon/daemon.ts:286:24
         }),
       );
     },
-    signalReady: () => {
-      process.stderr.write(`${JSON.stringify({ status: "ready", workspace: absWorkspace })}\n`);
-    },
+    signalReady: () => {},
     logger: logger ?? undefined,
   });

[NoCoverage] LogicalOperator
src/daemon/daemon.ts:289:13
     signalReady: () => {
       process.stderr.write(`${JSON.stringify({ status: "ready", workspace: absWorkspace })}\n`);
     },
-    logger: logger ?? undefined,
+    logger: logger && undefined,
   });
 }

[Survived] ObjectLiteral
src/daemon/daemon.ts:293:40
   });
 }
 
-const RequestEnvelopeSchema = z.object({
-  method: z.string().min(1, "method is required"),
-  params: z.record(z.string(), z.unknown()).default({}),
-});
+const RequestEnvelopeSchema = z.object({});
 
 /** Write operations that return a filesModified count in their response. */

[Survived] MethodExpression
src/daemon/daemon.ts:294:11
 }
 
 const RequestEnvelopeSchema = z.object({
-  method: z.string().min(1, "method is required"),
+  method: z.string().max(1, "method is required"),
   params: z.record(z.string(), z.unknown()).default({}),
 });

[NoCoverage] BlockStatement
src/daemon/daemon.ts:310:97
 ]);
 
 /** Parse a socket line as JSON, isolating the one throw source in the request path. */
-function parseLine(line: string): { ok: true; value: unknown } | { ok: false; message: string } {
-  try {
-    return { ok: true, value: JSON.parse(line) };
-  } catch (err) {
-    return { ok: false, message: err instanceof Error ? err.message : String(err) };
-  }
-}
+function parseLine(line: string): { ok: true; value: unknown } | { ok: false; message: string } {}
 
 async function handleSocketRequest(

[NoCoverage] BlockStatement
src/daemon/daemon.ts:311:7
 
 /** Parse a socket line as JSON, isolating the one throw source in the request path. */
 function parseLine(line: string): { ok: true; value: unknown } | { ok: false; message: string } {
-  try {
-    return { ok: true, value: JSON.parse(line) };
-  } catch (err) {
+  try {} catch (err) {
     return { ok: false, message: err instanceof Error ? err.message : String(err) };
   }

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:312:18
 /** Parse a socket line as JSON, isolating the one throw source in the request path. */
 function parseLine(line: string): { ok: true; value: unknown } | { ok: false; message: string } {
   try {
-    return { ok: true, value: JSON.parse(line) };
+    return { ok: false, value: JSON.parse(line) };
   } catch (err) {
     return { ok: false, message: err instanceof Error ? err.message : String(err) };

[NoCoverage] BlockStatement
src/daemon/daemon.ts:313:17
 function parseLine(line: string): { ok: true; value: unknown } | { ok: false; message: string } {
   try {
     return { ok: true, value: JSON.parse(line) };
-  } catch (err) {
-    return { ok: false, message: err instanceof Error ? err.message : String(err) };
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:314:18
   try {
     return { ok: true, value: JSON.parse(line) };
   } catch (err) {
-    return { ok: false, message: err instanceof Error ? err.message : String(err) };
+    return { ok: true, message: err instanceof Error ? err.message : String(err) };
   }
 }

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:314:12
   try {
     return { ok: true, value: JSON.parse(line) };
   } catch (err) {
-    return { ok: false, message: err instanceof Error ? err.message : String(err) };
+    return {};
   }
 }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:329:7
   let response: DispatchResponse | { status: "success"; buildId: number };
 
   const parsed = parseLine(line);
-  if (!parsed.ok) {
+  if (true) {
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:329:7
   let response: DispatchResponse | { status: "success"; buildId: number };
 
   const parsed = parseLine(line);
-  if (!parsed.ok) {
+  if (parsed.ok) {
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {

[NoCoverage] BlockStatement
src/daemon/daemon.ts:331:10
   const parsed = parseLine(line);
   if (!parsed.ok) {
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
-  } else {
-    const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
-    if (!envelope.success) {
-      const message = envelope.error.issues.map((i) => i.message).join("; ");
-      response = { status: "error", error: "PARSE_ERROR", message };
-    } else {
-      method = envelope.data.method;
-      response =
-        method === "ping"
-          ? { status: "success", buildId: RUNNING_BUILD_ID }
-          : await dispatchRequest(envelope.data, workspace);
-    }
-  }
+  } else {}
 
   socket.write(serialiseResponse(response));

[NoCoverage] BooleanLiteral
src/daemon/daemon.ts:333:9
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {
     const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
-    if (!envelope.success) {
+    if (envelope.success) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:333:9
     response = { status: "error", error: "PARSE_ERROR", message: parsed.message };
   } else {
     const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
-    if (!envelope.success) {
+    if (true) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };

[NoCoverage] ArrowFunction
src/daemon/daemon.ts:334:49
   } else {
     const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
     if (!envelope.success) {
-      const message = envelope.error.issues.map((i) => i.message).join("; ");
+      const message = envelope.error.issues.map(() => undefined).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };
     } else {

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:335:18
     const envelope = RequestEnvelopeSchema.safeParse(parsed.value);
     if (!envelope.success) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
-      response = { status: "error", error: "PARSE_ERROR", message };
+      response = {};
     } else {
       method = envelope.data.method;

[NoCoverage] BlockStatement
src/daemon/daemon.ts:336:12
     if (!envelope.success) {
       const message = envelope.error.issues.map((i) => i.message).join("; ");
       response = { status: "error", error: "PARSE_ERROR", message };
-    } else {
-      method = envelope.data.method;
-      response =
-        method === "ping"
-          ? { status: "success", buildId: RUNNING_BUILD_ID }
-          : await dispatchRequest(envelope.data, workspace);
-    }
+    } else {}
   }
 

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:339:9
     } else {
       method = envelope.data.method;
       response =
-        method === "ping"
+        method !== "ping"
           ? { status: "success", buildId: RUNNING_BUILD_ID }
           : await dispatchRequest(envelope.data, workspace);

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:339:9
     } else {
       method = envelope.data.method;
       response =
-        method === "ping"
+        true
           ? { status: "success", buildId: RUNNING_BUILD_ID }
           : await dispatchRequest(envelope.data, workspace);

[NoCoverage] CallExpression
src/daemon/daemon.ts:345:3
     }
   }
 
-  socket.write(serialiseResponse(response));
+  ;
 
   if (logger && method !== "ping") {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:347:17
 
   socket.write(serialiseResponse(response));
 
-  if (logger && method !== "ping") {
+  if (logger && true) {
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:347:7
 
   socket.write(serialiseResponse(response));
 
-  if (logger && method !== "ping") {
+  if (false) {
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;

[NoCoverage] ArithmeticOperator
src/daemon/daemon.ts:348:24
   socket.write(serialiseResponse(response));
 
   if (logger && method !== "ping") {
-    const durationMs = Date.now() - start;
+    const durationMs = Date.now() + start;
     const res = response as Record<string, unknown>;
     const status =

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:351:7
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;
     const status =
-      typeof res.status === "string" ? (res.status as "success" | "warn" | "error") : "error";
+      false ? (res.status as "success" | "warn" | "error") : "error";
     const entry: import("./logger.js").LogEntry = {
       ts: new Date().toISOString(),

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:351:7
     const durationMs = Date.now() - start;
     const res = response as Record<string, unknown>;
     const status =
-      typeof res.status === "string" ? (res.status as "success" | "warn" | "error") : "error";
+      true ? (res.status as "success" | "warn" | "error") : "error";
     const entry: import("./logger.js").LogEntry = {
       ts: new Date().toISOString(),

[NoCoverage] ObjectLiteral
src/daemon/daemon.ts:352:51
     const res = response as Record<string, unknown>;
     const status =
       typeof res.status === "string" ? (res.status as "success" | "warn" | "error") : "error";
-    const entry: import("./logger.js").LogEntry = {
-      ts: new Date().toISOString(),
-      method,
-      durationMs,
-      status,
-    };
+    const entry: import("./logger.js").LogEntry = {};
 
     if (status === "error") {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:359:9
       status,
     };
 
-    if (status === "error") {
+    if (true) {
       if (typeof res.error === "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:359:9
       status,
     };
 
-    if (status === "error") {
+    if (false) {
       if (typeof res.error === "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:360:11
     };
 
     if (status === "error") {
-      if (typeof res.error === "string") entry.error = res.error;
+      if (true) entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;
       if (typeof res.stack === "string") entry.stack = res.stack;

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:360:11
     };
 
     if (status === "error") {
-      if (typeof res.error === "string") entry.error = res.error;
+      if (typeof res.error !== "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;
       if (typeof res.stack === "string") entry.stack = res.stack;

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:361:11
 
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
-      if (typeof res.message === "string") entry.message = res.message;
+      if (true) entry.message = res.message;
       if (typeof res.stack === "string") entry.stack = res.stack;
     }

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:361:11
 
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
-      if (typeof res.message === "string") entry.message = res.message;
+      if (typeof res.message !== "string") entry.message = res.message;
       if (typeof res.stack === "string") entry.stack = res.stack;
     }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:362:11
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;
-      if (typeof res.stack === "string") entry.stack = res.stack;
+      if (false) entry.stack = res.stack;
     }
 

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:362:11
     if (status === "error") {
       if (typeof res.error === "string") entry.error = res.error;
       if (typeof res.message === "string") entry.message = res.message;
-      if (typeof res.stack === "string") entry.stack = res.stack;
+      if (true) entry.stack = res.stack;
     }
 

[NoCoverage] EqualityOperator
src/daemon/daemon.ts:365:9
       if (typeof res.stack === "string") entry.stack = res.stack;
     }
 
-    if (status !== "error" && WRITE_METHODS.has(method)) {
+    if (status === "error" && WRITE_METHODS.has(method)) {
       const modified = res.filesModified;
       if (Array.isArray(modified)) {

[NoCoverage] LogicalOperator
src/daemon/daemon.ts:365:9
       if (typeof res.stack === "string") entry.stack = res.stack;
     }
 
-    if (status !== "error" && WRITE_METHODS.has(method)) {
+    if (status !== "error" || WRITE_METHODS.has(method)) {
       const modified = res.filesModified;
       if (Array.isArray(modified)) {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:367:11
 
     if (status !== "error" && WRITE_METHODS.has(method)) {
       const modified = res.filesModified;
-      if (Array.isArray(modified)) {
+      if (false) {
         entry.filesModified = modified.length;
       } else if (typeof modified === "number") {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:367:11
 
     if (status !== "error" && WRITE_METHODS.has(method)) {
       const modified = res.filesModified;
-      if (Array.isArray(modified)) {
+      if (true) {
         entry.filesModified = modified.length;
       } else if (typeof modified === "number") {

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:369:18
       const modified = res.filesModified;
       if (Array.isArray(modified)) {
         entry.filesModified = modified.length;
-      } else if (typeof modified === "number") {
+      } else if (false) {
         entry.filesModified = modified;
       }

[NoCoverage] ConditionalExpression
src/daemon/daemon.ts:369:18
       const modified = res.filesModified;
       if (Array.isArray(modified)) {
         entry.filesModified = modified.length;
-      } else if (typeof modified === "number") {
+      } else if (true) {
         entry.filesModified = modified;
       }

[NoCoverage] CallExpression
src/daemon/daemon.ts:374:5
       }
     }
 
-    logger.log(entry);
+    ;
   }
 }
