[Killed] BlockStatement
src/daemon/dispatcher.ts:42:73
  */
 let onActivity: (() => void) | undefined;
 
-export function setActivityCallback(cb: (() => void) | undefined): void {
-  onActivity = cb;
-}
+export function setActivityCallback(cb: (() => void) | undefined): void {}
 
 /**
killedBy: idle activity signal calls the activity callback on every dispatch
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:95:11
 }
 
 const OPERATIONS: Record<string, OperationDescriptor> = {
-  rename: {
-    pathParams: ["file"],
-    schema: RenameArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, line, col, newName } = params as {
-        file: string;
-        line: number;
-        col: number;
-        newName: string;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return rename(engine, file, line, col, newName, scope);
-    },
-  },
+  rename: {},
 
   moveFile: {
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: src/main.ts was listed as changed but is identical: expected 'export const metaValue = import.meta;…' not to be 'export const metaValue = import.meta;…' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:98:47
   rename: {
     pathParams: ["file"],
     schema: RenameArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, line, col, newName } = params as {
-        file: string;
-        line: number;
-        col: number;
-        newName: string;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return rename(engine, file, line, col, newName, scope);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: src/main.ts was listed as changed but is identical: expected 'export const metaValue = import.meta;…' not to be 'export const metaValue = import.meta;…' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:111:13
     },
   },
 
-  moveFile: {
-    pathParams: ["oldPath", "newPath"],
-    schema: MoveArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { oldPath, newPath } = params as { oldPath: string; newPath: string };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return moveFile(engine, oldPath, newPath, scope);
-    },
-  },
+  moveFile: {},
 
   moveDirectory: {
killedBy: dispatchRequest per-operation dispatch dispatches moveFile and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:114:47
   moveFile: {
     pathParams: ["oldPath", "newPath"],
     schema: MoveArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { oldPath, newPath } = params as { oldPath: string; newPath: string };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return moveFile(engine, oldPath, newPath, scope);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] BlockStatement
src/daemon/dispatcher.ts:125:47
   moveDirectory: {
     pathParams: ["oldPath", "newPath"],
     schema: MoveDirectoryArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { oldPath, newPath } = params as { oldPath: string; newPath: string };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return moveDirectory(engine, oldPath, newPath, scope);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches moveDirectory and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:136:47
   moveSymbol: {
     pathParams: ["sourceFile", "destFile"],
     schema: MoveSymbolArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { sourceFile, symbolName, destFile, force } = params as {
-        sourceFile: string;
-        symbolName: string;
-        destFile: string;
-        force?: boolean;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      const { moveSymbol } = await import("../operations/moveSymbol.js");
-      return moveSymbol(engine, sourceFile, symbolName, destFile, scope, { force });
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches moveSymbol and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:153:47
   extractFunction: {
     pathParams: ["file"],
     schema: ExtractFunctionArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, startLine, startCol, endLine, endCol, functionName } = params as {
-        file: string;
-        startLine: number;
-        startCol: number;
-        endLine: number;
-        endCol: number;
-        functionName: string;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return extractFunction(
-        engine,
-        file,
-        startLine,
-        startCol,
-        endLine,
-        endCol,
-        functionName,
-        scope,
-      );
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches extractFunction and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:177:14
     },
   },
 
-  setExport: {
-    pathParams: ["file"],
-    schema: SetExportArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, symbolName, exported } = params as {
-        file: string;
-        symbolName: string;
-        exported: boolean;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return setExport(engine, file, symbolName, exported, scope);
-    },
-  },
+  setExport: {},
 
   findImporters: {
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:180:47
   setExport: {
     pathParams: ["file"],
     schema: SetExportArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, symbolName, exported } = params as {
-        file: string;
-        symbolName: string;
-        exported: boolean;
-      };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return setExport(engine, file, symbolName, exported, scope);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:195:36
   findImporters: {
     pathParams: ["file"],
     schema: FindImportersArgsSchema,
-    async invoke(registry, params) {
-      const { file } = params as { file: string };
-      const engine = await registry.projectEngine();
-      return findImporters(engine, file, defaultFs);
-    },
+    async invoke(registry, params) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches findImporters and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:202:19
     },
   },
 
-  findReferences: {
-    pathParams: ["file"],
-    schema: FindReferencesArgsSchema,
-    async invoke(registry, params) {
-      const { file, line, col } = params as { file: string; line: number; col: number };
-      const engine = await registry.projectEngine();
-      return findReferences(engine, file, line, col, defaultFs);
-    },
-  },
+  findReferences: {},
 
   getDefinition: {
killedBy: dispatchRequest param validation returns VALIDATION_ERROR — findReferences with col as null
statusReason: expected { status: 'error', …(3) } to match object { status: 'error', …(1) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/daemon/dispatcher.ts:205:36
   findReferences: {
     pathParams: ["file"],
     schema: FindReferencesArgsSchema,
-    async invoke(registry, params) {
-      const { file, line, col } = params as { file: string; line: number; col: number };
-      const engine = await registry.projectEngine();
-      return findReferences(engine, file, line, col, defaultFs);
-    },
+    async invoke(registry, params) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches findReferences and returns references shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:215:36
   getDefinition: {
     pathParams: ["file"],
     schema: GetDefinitionArgsSchema,
-    async invoke(registry, params) {
-      const { file, line, col } = params as { file: string; line: number; col: number };
-      const engine = await registry.projectEngine();
-      return getDefinition(engine, file, line, col, defaultFs);
-    },
+    async invoke(registry, params) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches getDefinition and returns definition shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:226:47
     pathParams: ["file", "tsconfig"],
     tsConfigParam: "tsconfig",
     schema: GetTypeErrorsArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file, tsconfig } = params as { file?: string; tsconfig?: string };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return getTypeErrors(engine, file, scope, tsconfig);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches getTypeErrors and returns diagnostics shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:237:48
   searchText: {
     pathParams: [],
     schema: SearchTextArgsSchema,
-    async invoke(_registry, params, workspace) {
-      const { pattern, glob, excludeGlob, context, maxResults } = params as {
-        pattern: string;
-        glob?: string;
-        excludeGlob?: string;
-        context?: number;
-        maxResults?: number;
-      };
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return searchText(pattern, scope, { glob, excludeGlob, context, maxResults });
-    },
+    async invoke(_registry, params, workspace) {},
   },
 
killedBy: dispatchRequest success format returns status:success and result fields without an ok or message field
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:246:41
         maxResults?: number;
       };
       const scope = new WorkspaceScope(workspace, defaultFs);
-      return searchText(pattern, scope, { glob, excludeGlob, context, maxResults });
+      return searchText(pattern, scope, {});
     },
   },
killedBy: dispatchRequest searchText options passes context through and includes surrounding lines in the response
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/daemon/dispatcher.ts:253:47
   deleteFile: {
     pathParams: ["file"],
     schema: DeleteFileArgsSchema,
-    async invoke(registry, params, workspace) {
-      const { file } = params as { file: string };
-      const engine = await registry.projectEngine();
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      const { deleteFile } = await import("../operations/deleteFile.js");
-      return deleteFile(engine, file, scope);
-    },
+    async invoke(registry, params, workspace) {},
   },
 
killedBy: dispatchRequest per-operation dispatch dispatches deleteFile and returns result shape
statusReason: expected 'error' to be 'warn' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:265:48
   replaceText: {
     pathParams: [],
     schema: ReplaceTextArgsSchema,
-    async invoke(_registry, params, workspace) {
-      const { pattern, replacement, glob, excludeGlob, edits } = params as {
-        pattern?: string;
-        replacement?: string;
-        glob?: string;
-        excludeGlob?: string;
-        edits?: Array<{
-          file: string;
-          line: number;
-          col: number;
-          oldText: string;
-          newText: string;
-        }>;
-      };
-      const scope = new WorkspaceScope(workspace, defaultFs);
-      return replaceText(scope, { pattern, replacement, glob, excludeGlob, edits });
-    },
+    async invoke(_registry, params, workspace) {},
   },
 };
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:289:57
 export const OPERATION_NAMES: string[] = Object.keys(OPERATIONS);
 
 /** The param keys a method declares as file paths; empty for methods with none. */
-export function pathParamsFor(method: string): string[] {
-  return OPERATIONS[method]?.pathParams ?? [];
-}
+export function pathParamsFor(method: string): string[] {}
 
 // ─── Response types ────────────────────────────────────────────────────────
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: pathParams is not iterable

[Killed] LogicalOperator
src/daemon/dispatcher.ts:290:10
 
 /** The param keys a method declares as file paths; empty for methods with none. */
 export function pathParamsFor(method: string): string[] {
-  return OPERATIONS[method]?.pathParams ?? [];
+  return OPERATIONS[method]?.pathParams && [];
 }
 
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Survived] OptionalChaining
src/daemon/dispatcher.ts:290:10
 
 /** The param keys a method declares as file paths; empty for methods with none. */
 export function pathParamsFor(method: string): string[] {
-  return OPERATIONS[method]?.pathParams ?? [];
+  return OPERATIONS[method].pathParams ?? [];
 }
 

[Killed] BlockStatement
src/daemon/dispatcher.ts:314:73
  * `workspace` always arrives resolved (validateWorkspace runs path.resolve and
  * rejects "/"), so it never carries a trailing slash to normalise away.
  */
-function stripWorkspacePrefix(stack: string, workspace: string): string {
-  return stack.replaceAll(`${workspace}/`, "");
-}
+function stripWorkspacePrefix(stack: string, workspace: string): string {}
 
 /** Frame lines only (drops the leading `Name: message` line), capped and workspace-stripped. */
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:319:64
 }
 
 /** Frame lines only (drops the leading `Name: message` line), capped and workspace-stripped. */
-function formatStack(stack: string, workspace: string): string {
-  const frames = stack.split("\n").slice(1, 11);
-  return stripWorkspacePrefix(frames.join("\n"), workspace);
-}
+function formatStack(stack: string, workspace: string): string {}
 
 function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] MethodExpression
src/daemon/dispatcher.ts:320:18
 
 /** Frame lines only (drops the leading `Name: message` line), capped and workspace-stripped. */
 function formatStack(stack: string, workspace: string): string {
-  const frames = stack.split("\n").slice(1, 11);
+  const frames = stack.split("\n");
   return stripWorkspacePrefix(frames.join("\n"), workspace);
 }
killedBy: dispatchRequest error responses caps the returned stack at 10 frames, drops the message line, and strips the workspace prefix
statusReason: expected 'TypeError: boom\n    at fn (src/utils…' not to contain 'TypeError: boom'

[Killed] BlockStatement
src/daemon/dispatcher.ts:324:90
   return stripWorkspacePrefix(frames.join("\n"), workspace);
 }
 
-function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {
-  if (EngineError.is(err)) {
-    return { status: "error", error: err.code, message: err.message };
-  }
-  if (err instanceof Error) {
-    return {
-      status: "error",
-      error: "INTERNAL_ERROR",
-      message: `${err.name} during '${method}': ${err.message}`,
-      ...(err.stack ? { stack: formatStack(err.stack, workspace) } : {}),
-    };
-  }
-  return { status: "error", error: "INTERNAL_ERROR", message: String(err) };
-}
+function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {}
 
 // ─── Dispatcher ────────────────────────────────────────────────────────────
killedBy: dispatchRequest moveSymbol force option without force, a same-named symbol already in destFile is rejected
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:325:7
 }
 
 function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {
-  if (EngineError.is(err)) {
+  if (true) {
     return { status: "error", error: err.code, message: err.message };
   }
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected { status: 'error', …(2) } to match object { status: 'error', …(2) }

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:325:7
 }
 
 function toDispatchError(err: unknown, method: string, workspace: string): DispatchError {
-  if (EngineError.is(err)) {
+  if (false) {
     return { status: "error", error: err.code, message: err.message };
   }
killedBy: dispatchRequest moveSymbol force option without force, a same-named symbol already in destFile is rejected
statusReason: expected 'INTERNAL_ERROR' to be 'SYMBOL_EXISTS' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:328:7
   if (EngineError.is(err)) {
     return { status: "error", error: err.code, message: err.message };
   }
-  if (err instanceof Error) {
+  if (true) {
     return {
       status: "error",
killedBy: dispatchRequest error responses resolves a thrown non-Error value to an INTERNAL_ERROR response with no stack
statusReason: expected { status: 'error', …(2) } to deeply equal { status: 'error', …(2) }

[Killed] BlockStatement
src/daemon/dispatcher.ts:328:29
   if (EngineError.is(err)) {
     return { status: "error", error: err.code, message: err.message };
   }
-  if (err instanceof Error) {
-    return {
-      status: "error",
-      error: "INTERNAL_ERROR",
-      message: `${err.name} during '${method}': ${err.message}`,
-      ...(err.stack ? { stack: formatStack(err.stack, workspace) } : {}),
-    };
-  }
+  if (err instanceof Error) {}
   return { status: "error", error: "INTERNAL_ERROR", message: String(err) };
 }
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected { status: 'error', …(2) } to match object { status: 'error', …(2) }

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:329:12
     return { status: "error", error: err.code, message: err.message };
   }
   if (err instanceof Error) {
-    return {
-      status: "error",
-      error: "INTERNAL_ERROR",
-      message: `${err.name} during '${method}': ${err.message}`,
-      ...(err.stack ? { stack: formatStack(err.stack, workspace) } : {}),
-    };
+    return {};
   }
   return { status: "error", error: "INTERNAL_ERROR", message: String(err) };
killedBy: dispatchRequest error responses resolves an unexpected throw to an INTERNAL_ERROR response with a stack
statusReason: expected {} to match object { status: 'error', …(2) }

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:336:10
       ...(err.stack ? { stack: formatStack(err.stack, workspace) } : {}),
     };
   }
-  return { status: "error", error: "INTERNAL_ERROR", message: String(err) };
+  return {};
 }
 
killedBy: dispatchRequest error responses resolves a thrown non-Error value to an INTERNAL_ERROR response with no stack
statusReason: expected {} to deeply equal { status: 'error', …(2) }

[Killed] OptionalChaining
src/daemon/dispatcher.ts:345:3
   req: { method: string; params: Record<string, unknown> },
   workspace: string,
 ): Promise<DispatchResponse> {
-  onActivity?.();
+  onActivity();
 
   try {
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: onActivity is not a function

[Survived] CallExpression
src/daemon/dispatcher.ts:350:5
   try {
     // Fresh per dispatch so a tsconfig.json or the workspace's first .vue file added
     // since the last request is picked up before engine selection or project discovery.
-    resetDiscoveryCaches();
+    ;
 
     const descriptor = OPERATIONS[req.method];

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:353:9
     resetDiscoveryCaches();
 
     const descriptor = OPERATIONS[req.method];
-    if (!descriptor) {
+    if (true) {
       return {
         status: "error" as const,
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:353:9
     resetDiscoveryCaches();
 
     const descriptor = OPERATIONS[req.method];
-    if (!descriptor) {
+    if (false) {
       return {
         status: "error" as const,
killedBy: dispatchRequest param validation returns UNKNOWN_METHOD for an unrecognised method
statusReason: expected { status: 'error', …(3) } to match object { status: 'error', …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/daemon/dispatcher.ts:362:9
     }
 
     const parsed = descriptor.schema.safeParse(req.params);
-    if (!parsed.success) {
+    if (parsed.success) {
       const message = parsed.error.issues.map((i) => i.message).join("; ");
       return { status: "error" as const, error: "VALIDATION_ERROR", message };
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:362:9
     }
 
     const parsed = descriptor.schema.safeParse(req.params);
-    if (!parsed.success) {
+    if (false) {
       const message = parsed.error.issues.map((i) => i.message).join("; ");
       return { status: "error" as const, error: "VALIDATION_ERROR", message };
killedBy: dispatchRequest param validation returns VALIDATION_ERROR — rename with line as string
statusReason: expected { status: 'error', …(3) } to match object { status: 'error', …(1) }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/daemon/dispatcher.ts:363:47
 
     const parsed = descriptor.schema.safeParse(req.params);
     if (!parsed.success) {
-      const message = parsed.error.issues.map((i) => i.message).join("; ");
+      const message = parsed.error.issues.map(() => undefined).join("; ");
       return { status: "error" as const, error: "VALIDATION_ERROR", message };
     }
killedBy: dispatchRequest param validation VALIDATION_ERROR message reports the real Zod issues, not a blank list
statusReason: expected '; ; ' to contain 'expected number, received NaN'

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:364:14
     const parsed = descriptor.schema.safeParse(req.params);
     if (!parsed.success) {
       const message = parsed.error.issues.map((i) => i.message).join("; ");
-      return { status: "error" as const, error: "VALIDATION_ERROR", message };
+      return {};
     }
 
killedBy: dispatchRequest param validation returns VALIDATION_ERROR — rename with line as string
statusReason: expected {} to match object { status: 'error', …(1) }

[Killed] BlockStatement
src/daemon/dispatcher.ts:367:51
       return { status: "error" as const, error: "VALIDATION_ERROR", message };
     }
 
-    for (const paramKey of descriptor.pathParams) {
-      const value = req.params[paramKey] as string | undefined;
-      // Every current caller of this operation supplies every pathParam it declares, except
-      // getTypeErrors's `file`/`tsconfig` — both optional, and mutually exclusive with each
-      // other, so either (or neither) can be absent from a given request.
-      if (value === undefined) continue;
-      const pathResult = validateFilePath(value);
-      if (!pathResult.ok) {
-        return {
-          status: "error" as const,
-          error: "INVALID_PATH",
-          message:
-            pathResult.reason === "CONTROL_CHARS"
-              ? `path contains control characters: ${paramKey}`
-              : `path contains URI fragment or query character: ${paramKey}`,
-        };
-      }
-      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
-        return {
-          status: "error" as const,
-          error: "WORKSPACE_VIOLATION",
-          message: `${paramKey} is outside the workspace: ${value}`,
-        };
-      }
-    }
+    for (const paramKey of descriptor.pathParams) {}
 
     const explicitTsConfig =
killedBy: dispatchRequest workspace boundary enforcement returns WORKSPACE_VIOLATION when a path param is outside the workspace
statusReason: expected 'FILE_NOT_FOUND' to be 'WORKSPACE_VIOLATION' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:372:11
       // Every current caller of this operation supplies every pathParam it declares, except
       // getTypeErrors's `file`/`tsconfig` — both optional, and mutually exclusive with each
       // other, so either (or neither) can be absent from a given request.
-      if (value === undefined) continue;
+      if (true) continue;
       const pathResult = validateFilePath(value);
       if (!pathResult.ok) {
killedBy: dispatchRequest workspace boundary enforcement returns WORKSPACE_VIOLATION when a path param is outside the workspace
statusReason: expected 'FILE_NOT_FOUND' to be 'WORKSPACE_VIOLATION' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:372:11
       // Every current caller of this operation supplies every pathParam it declares, except
       // getTypeErrors's `file`/`tsconfig` — both optional, and mutually exclusive with each
       // other, so either (or neither) can be absent from a given request.
-      if (value === undefined) continue;
+      if (false) continue;
       const pathResult = validateFilePath(value);
       if (!pathResult.ok) {
killedBy: dispatchRequest per-operation dispatch dispatches getTypeErrors and returns diagnostics shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BooleanLiteral
src/daemon/dispatcher.ts:374:11
       // other, so either (or neither) can be absent from a given request.
       if (value === undefined) continue;
       const pathResult = validateFilePath(value);
-      if (!pathResult.ok) {
+      if (pathResult.ok) {
         return {
           status: "error" as const,
killedBy: dispatchRequest per-operation dispatch dispatches findReferences and returns references shape
statusReason: expected 'error' to be 'success' // Object.is equality
