[Killed] BlockStatement
src/daemon/dispatcher.ts:374:27
       // other, so either (or neither) can be absent from a given request.
       if (value === undefined) continue;
       const pathResult = validateFilePath(value);
-      if (!pathResult.ok) {
-        return {
-          status: "error" as const,
-          error: "INVALID_PATH",
-          message:
-            pathResult.reason === "CONTROL_CHARS"
-              ? `path contains control characters: ${paramKey}`
-              : `path contains URI fragment or query character: ${paramKey}`,
-        };
-      }
+      if (!pathResult.ok) {}
       if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
         return {
killedBy: dispatchRequest path character validation returns INVALID_PATH and does not invoke the operation when file contains a control character — null byte
statusReason: expected 'FILE_NOT_FOUND' to be 'INVALID_PATH' // Object.is equality

[Killed] ObjectLiteral
src/daemon/dispatcher.ts:375:16
       if (value === undefined) continue;
       const pathResult = validateFilePath(value);
       if (!pathResult.ok) {
-        return {
-          status: "error" as const,
-          error: "INVALID_PATH",
-          message:
-            pathResult.reason === "CONTROL_CHARS"
-              ? `path contains control characters: ${paramKey}`
-              : `path contains URI fragment or query character: ${paramKey}`,
-        };
+        return {};
       }
       if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
killedBy: dispatchRequest path character validation returns INVALID_PATH and does not invoke the operation when file contains a control character — null byte
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:379:13
           status: "error" as const,
           error: "INVALID_PATH",
           message:
-            pathResult.reason === "CONTROL_CHARS"
+            false
               ? `path contains control characters: ${paramKey}`
               : `path contains URI fragment or query character: ${paramKey}`,
killedBy: dispatchRequest path character validation returns INVALID_PATH and does not invoke the operation when file contains a control character — null byte
statusReason: expected 'path contains URI fragment or query c…' to be 'path contains control characters: file' // Object.is equality

[Killed] EqualityOperator
src/daemon/dispatcher.ts:379:13
           status: "error" as const,
           error: "INVALID_PATH",
           message:
-            pathResult.reason === "CONTROL_CHARS"
+            pathResult.reason !== "CONTROL_CHARS"
               ? `path contains control characters: ${paramKey}`
               : `path contains URI fragment or query character: ${paramKey}`,
killedBy: dispatchRequest path character validation returns INVALID_PATH and does not invoke the operation when file contains a control character — null byte
statusReason: expected 'path contains URI fragment or query c…' to be 'path contains control characters: file' // Object.is equality

[Killed] BooleanLiteral
src/daemon/dispatcher.ts:384:11
               : `path contains URI fragment or query character: ${paramKey}`,
         };
       }
-      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
+      if (new WorkspaceScope(workspace, defaultFs).contains(value)) {
         return {
           status: "error" as const,
killedBy: dispatchRequest per-operation dispatch dispatches findReferences and returns references shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:384:70
               : `path contains URI fragment or query character: ${paramKey}`,
         };
       }
-      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {
-        return {
-          status: "error" as const,
-          error: "WORKSPACE_VIOLATION",
-          message: `${paramKey} is outside the workspace: ${value}`,
-        };
-      }
+      if (!new WorkspaceScope(workspace, defaultFs).contains(value)) {}
     }
 
killedBy: dispatchRequest workspace boundary enforcement returns WORKSPACE_VIOLATION when a path param is outside the workspace
statusReason: expected 'FILE_NOT_FOUND' to be 'WORKSPACE_VIOLATION' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:394:7
     }
 
     const explicitTsConfig =
-      descriptor.tsConfigParam && typeof req.params[descriptor.tsConfigParam] === "string"
+      false
         ? (req.params[descriptor.tsConfigParam] as string)
         : undefined;
killedBy: getTypeErrors scenarios a project-wide check with a named tsconfig that doesn't exist reports FILE_NOT_FOUND
statusReason: A missing tsconfig can't answer for anything — engine selection reads it directly rather than tolerating a miss the way discovery does, so this must fail before either engine is ever chosen.


response: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] EqualityOperator
src/daemon/dispatcher.ts:394:35
     }
 
     const explicitTsConfig =
-      descriptor.tsConfigParam && typeof req.params[descriptor.tsConfigParam] === "string"
+      descriptor.tsConfigParam && typeof req.params[descriptor.tsConfigParam] !== "string"
         ? (req.params[descriptor.tsConfigParam] as string)
         : undefined;
killedBy: getTypeErrors scenarios a project-wide check with a named tsconfig that doesn't exist reports FILE_NOT_FOUND
statusReason: A missing tsconfig can't answer for anything — engine selection reads it directly rather than tolerating a miss the way discovery does, so this must fail before either engine is ever chosen.


response: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:398:9
         ? (req.params[descriptor.tsConfigParam] as string)
         : undefined;
 
-    if (explicitTsConfig !== undefined) {
+    if (false) {
       // Engine selection reads this path directly (isVueProject), unlike the discovery
       // routes above it doesn't tolerate a miss — checked here, before that read, so a
killedBy: getTypeErrors scenarios a project-wide check with a named tsconfig that doesn't exist reports FILE_NOT_FOUND
statusReason: A missing tsconfig can't answer for anything — engine selection reads it directly rather than tolerating a miss the way discovery does, so this must fail before either engine is ever chosen.


response: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] EqualityOperator
src/daemon/dispatcher.ts:398:9
         ? (req.params[descriptor.tsConfigParam] as string)
         : undefined;
 
-    if (explicitTsConfig !== undefined) {
+    if (explicitTsConfig === undefined) {
       // Engine selection reads this path directly (isVueProject), unlike the discovery
       // routes above it doesn't tolerate a miss — checked here, before that read, so a
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(2) } to deeply equal { status: 'success', …(5) }

[Killed] LogicalOperator
src/daemon/dispatcher.ts:403:11
       // routes above it doesn't tolerate a miss — checked here, before that read, so a
       // missing or directory tsconfig comes back as FILE_NOT_FOUND rather than whatever
       // ts-morph/TypeScript does when handed a path that isn't a file.
-      if (!defaultFs.exists(explicitTsConfig) || defaultFs.stat(explicitTsConfig).isDirectory()) {
+      if (!defaultFs.exists(explicitTsConfig) && defaultFs.stat(explicitTsConfig).isDirectory()) {
         return {
           status: "error" as const,
killedBy: getTypeErrors scenarios a project-wide check with a named tsconfig that doesn't exist reports FILE_NOT_FOUND
statusReason: A missing tsconfig can't answer for anything — engine selection reads it directly rather than tolerating a miss the way discovery does, so this must fail before either engine is ever chosen.


response: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] BlockStatement
src/daemon/dispatcher.ts:403:98
       // routes above it doesn't tolerate a miss — checked here, before that read, so a
       // missing or directory tsconfig comes back as FILE_NOT_FOUND rather than whatever
       // ts-morph/TypeScript does when handed a path that isn't a file.
-      if (!defaultFs.exists(explicitTsConfig) || defaultFs.stat(explicitTsConfig).isDirectory()) {
-        return {
-          status: "error" as const,
-          error: "FILE_NOT_FOUND",
-          message: `tsconfig not found: ${explicitTsConfig}`,
-        };
-      }
+      if (!defaultFs.exists(explicitTsConfig) || defaultFs.stat(explicitTsConfig).isDirectory()) {}
     }
 
killedBy: getTypeErrors scenarios a project-wide check with a named tsconfig that doesn't exist reports FILE_NOT_FOUND
statusReason: A missing tsconfig can't answer for anything — engine selection reads it directly rather than tolerating a miss the way discovery does, so this must fail before either engine is ever chosen.


response: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] EqualityOperator
src/daemon/dispatcher.ts:413:7
     }
 
     const registry =
-      descriptor.pathParams.length > 0
+      descriptor.pathParams.length <= 0
         ? makeRegistry(req.params[descriptor.pathParams[0]] as string, workspace, explicitTsConfig)
         : makeRegistry(undefined, workspace, explicitTsConfig);
killedBy: dispatchRequest getTypeErrors engine routing in a Vue project single-file call resolves the tsconfig nearest the given file, not the workspace root's
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:413:7
     }
 
     const registry =
-      descriptor.pathParams.length > 0
+      false
         ? makeRegistry(req.params[descriptor.pathParams[0]] as string, workspace, explicitTsConfig)
         : makeRegistry(undefined, workspace, explicitTsConfig);
killedBy: dispatchRequest getTypeErrors engine routing in a Vue project single-file call resolves the tsconfig nearest the given file, not the workspace root's
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] LogicalOperator
src/daemon/dispatcher.ts:423:7
     >;
 
     if (
-      parsed.data.checkTypeErrors !== false &&
-      Array.isArray(result.filesModified) &&
+      parsed.data.checkTypeErrors !== false || Array.isArray(result.filesModified) &&
       (result.filesModified as string[]).length > 0
     ) {
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) checkTypeErrors:false suppresses typeErrors even when files are modified
statusReason: expected { status: 'success', …(5) } to not have property "typeErrors"

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:423:7
     >;
 
     if (
-      parsed.data.checkTypeErrors !== false &&
-      Array.isArray(result.filesModified) &&
-      (result.filesModified as string[]).length > 0
+      true
     ) {
       const engine = await registry.projectEngine();
killedBy: setExport scenarios leaves an already-exported symbol alone
statusReason: A retry after a crash mid-write must read as done, not as a fresh change — the empty filesModified is what tells a caller "already in that state" apart from a failure.


response: expected { status: 'success', …(6) } to deeply equal { status: 'success', …(3) }

[Killed] EqualityOperator
src/daemon/dispatcher.ts:425:7
     if (
       parsed.data.checkTypeErrors !== false &&
       Array.isArray(result.filesModified) &&
-      (result.filesModified as string[]).length > 0
+      (result.filesModified as string[]).length <= 0
     ) {
       const engine = await registry.projectEngine();
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected { status: 'success', …(2) } to have property "typeErrors"

[Killed] EqualityOperator
src/daemon/dispatcher.ts:425:7
     if (
       parsed.data.checkTypeErrors !== false &&
       Array.isArray(result.filesModified) &&
-      (result.filesModified as string[]).length > 0
+      (result.filesModified as string[]).length >= 0
     ) {
       const engine = await registry.projectEngine();
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) produces no typeErrors fields when no files are modified
statusReason: expected { status: 'success', …(5) } to not have property "typeErrors"

[Killed] BlockStatement
src/daemon/dispatcher.ts:426:7
       parsed.data.checkTypeErrors !== false &&
       Array.isArray(result.filesModified) &&
       (result.filesModified as string[]).length > 0
-    ) {
-      const engine = await registry.projectEngine();
-      const diagnostics = await getTypeErrorsForFiles(
-        engine,
-        result.filesModified as string[],
-        new WorkspaceScope(workspace, defaultFs),
-      );
-      result.typeErrors = diagnostics.typeErrors;
-      result.typeErrorCount = diagnostics.typeErrorCount;
-      result.typeErrorsTruncated = diagnostics.typeErrorsTruncated;
-    }
+    ) {}
 
     const status =
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: response: expected { status: 'success', …(4) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/daemon/dispatcher.ts:439:7
     }
 
     const status =
-      typeof result.typeErrorCount === "number" && result.typeErrorCount > 0
+      true
         ? ("warn" as const)
         : ("success" as const);
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'warn' to be 'success' // Object.is equality

[Killed] EqualityOperator
src/daemon/dispatcher.ts:439:52
     }
 
     const status =
-      typeof result.typeErrorCount === "number" && result.typeErrorCount > 0
+      typeof result.typeErrorCount === "number" && result.typeErrorCount <= 0
         ? ("warn" as const)
         : ("success" as const);
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'warn' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/dispatcher.ts:443:17
         ? ("warn" as const)
         : ("success" as const);
     return { status, ...result };
-  } catch (err) {
-    return toDispatchError(err, req.method, workspace);
-  }
+  } catch (err) {}
 }
 
killedBy: setExport scenarios reports an enum name as not found
statusReason: Enums are outside the supported declaration forms. Reporting the name as absent keeps the operation's answer honest — a half-supported form that silently did nothing would be worse than a clear miss.


Cannot read properties of undefined (reading 'split')
