[Killed] ArithmeticOperator
src/daemon/idle-eviction.ts:19:28
   stop: () => void;
 }
 
-const DEFAULT_TIMEOUT_MS = 5 * 60 * 1000;
+const DEFAULT_TIMEOUT_MS = 5 / 60 * 1000;
 const DEFAULT_INTERVAL_MS = 60 * 1000;
 
killedBy: startIdleTimer uses default timeout of 5 minutes and interval of 60 seconds when not specified
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ArithmeticOperator
src/daemon/idle-eviction.ts:19:28
   stop: () => void;
 }
 
-const DEFAULT_TIMEOUT_MS = 5 * 60 * 1000;
+const DEFAULT_TIMEOUT_MS = 5 * 60 / 1000;
 const DEFAULT_INTERVAL_MS = 60 * 1000;
 
killedBy: startIdleTimer uses default timeout of 5 minutes and interval of 60 seconds when not specified
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Timeout] ArithmeticOperator
src/daemon/idle-eviction.ts:20:29
 }
 
 const DEFAULT_TIMEOUT_MS = 5 * 60 * 1000;
-const DEFAULT_INTERVAL_MS = 60 * 1000;
+const DEFAULT_INTERVAL_MS = 60 / 1000;
 
 export function startIdleTimer(opts: IdleTimerOpts): IdleTimer {

[Killed] LogicalOperator
src/daemon/idle-eviction.ts:23:21
 const DEFAULT_INTERVAL_MS = 60 * 1000;
 
 export function startIdleTimer(opts: IdleTimerOpts): IdleTimer {
-  const timeoutMs = opts.timeoutMs ?? DEFAULT_TIMEOUT_MS;
+  const timeoutMs = opts.timeoutMs && DEFAULT_TIMEOUT_MS;
   const intervalMs = opts.intervalMs ?? DEFAULT_INTERVAL_MS;
 
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] LogicalOperator
src/daemon/idle-eviction.ts:24:22
 
 export function startIdleTimer(opts: IdleTimerOpts): IdleTimer {
   const timeoutMs = opts.timeoutMs ?? DEFAULT_TIMEOUT_MS;
-  const intervalMs = opts.intervalMs ?? DEFAULT_INTERVAL_MS;
+  const intervalMs = opts.intervalMs && DEFAULT_INTERVAL_MS;
 
   let lastActivity = opts.now();
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BooleanLiteral
src/daemon/idle-eviction.ts:27:17
   const intervalMs = opts.intervalMs ?? DEFAULT_INTERVAL_MS;
 
   let lastActivity = opts.now();
-  let evicted = false;
+  let evicted = true;
 
   const handle = setInterval(() => {
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/daemon/idle-eviction.ts:29:36
   let lastActivity = opts.now();
   let evicted = false;
 
-  const handle = setInterval(() => {
-    if (!evicted && opts.now() - lastActivity >= timeoutMs) {
-      evicted = true;
-      opts.evict();
-    }
-  }, intervalMs);
+  const handle = setInterval(() => {}, intervalMs);
 
   // `unref` only decides whether this timer alone keeps the event loop alive, which no
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/daemon/idle-eviction.ts:30:61
   let evicted = false;
 
   const handle = setInterval(() => {
-    if (!evicted && opts.now() - lastActivity >= timeoutMs) {
-      evicted = true;
-      opts.evict();
-    }
+    if (!evicted && opts.now() - lastActivity >= timeoutMs) {}
   }, intervalMs);
 
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] LogicalOperator
src/daemon/idle-eviction.ts:30:9
   let evicted = false;
 
   const handle = setInterval(() => {
-    if (!evicted && opts.now() - lastActivity >= timeoutMs) {
+    if (!evicted || opts.now() - lastActivity >= timeoutMs) {
       evicted = true;
       opts.evict();
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
src/daemon/idle-eviction.ts:31:17
 
   const handle = setInterval(() => {
     if (!evicted && opts.now() - lastActivity >= timeoutMs) {
-      evicted = true;
+      evicted = false;
       opts.evict();
     }
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 2 times

[Killed] CallExpression
src/daemon/idle-eviction.ts:32:7
   const handle = setInterval(() => {
     if (!evicted && opts.now() - lastActivity >= timeoutMs) {
       evicted = true;
-      opts.evict();
+      ;
     }
   }, intervalMs);
killedBy: startIdleTimer calls evict after the idle timeout is reached
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Survived] CallExpression
src/daemon/idle-eviction.ts:38:3
 
   // `unref` only decides whether this timer alone keeps the event loop alive, which no
   // in-process assertion can observe — an accepted equivalent survivor.
-  handle.unref();
+  ;
 
   return {

[Killed] ObjectLiteral
src/daemon/idle-eviction.ts:40:10
   // in-process assertion can observe — an accepted equivalent survivor.
   handle.unref();
 
-  return {
-    reset: () => {
-      lastActivity = opts.now();
-      evicted = false;
-    },
-    stop: () => {
-      clearInterval(handle);
-    },
-  };
+  return {};
 }
 
killedBy: startIdleTimer resets the idle countdown when reset is called
statusReason: timer.reset is not a function

[Killed] BlockStatement
src/daemon/idle-eviction.ts:41:18
   handle.unref();
 
   return {
-    reset: () => {
-      lastActivity = opts.now();
-      evicted = false;
-    },
+    reset: () => {},
     stop: () => {
       clearInterval(handle);
killedBy: startIdleTimer resets the idle countdown when reset is called
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
src/daemon/idle-eviction.ts:43:17
   return {
     reset: () => {
       lastActivity = opts.now();
-      evicted = false;
+      evicted = true;
     },
     stop: () => {
killedBy: startIdleTimer resets the idle countdown when reset is called
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/daemon/idle-eviction.ts:45:17
       lastActivity = opts.now();
       evicted = false;
     },
-    stop: () => {
-      clearInterval(handle);
-    },
+    stop: () => {},
   };
 }
killedBy: startIdleTimer stop prevents evict from ever being called
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] CallExpression
src/daemon/idle-eviction.ts:46:7
       evicted = false;
     },
     stop: () => {
-      clearInterval(handle);
+      ;
     },
   };
killedBy: startIdleTimer stop prevents evict from ever being called
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []
