[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:12:60
 
 async function getTsMorphEngine(
   workspaceRoot: string,
-): Promise<import("../ts-engine/engine.js").TsMorphEngine> {
-  if (!tsMorphEngineSingleton) {
-    const { TsMorphEngine } = await import("../ts-engine/engine.js");
-    tsMorphEngineSingleton = new TsMorphEngine(workspaceRoot);
-  }
-  return tsMorphEngineSingleton;
-}
+): Promise<import("../ts-engine/engine.js").TsMorphEngine> {}
 
 async function getPluginEngine(plugin: LanguagePlugin, workspaceRoot: string): Promise<Engine> {
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:13:32
 async function getTsMorphEngine(
   workspaceRoot: string,
 ): Promise<import("../ts-engine/engine.js").TsMorphEngine> {
-  if (!tsMorphEngineSingleton) {
-    const { TsMorphEngine } = await import("../ts-engine/engine.js");
-    tsMorphEngineSingleton = new TsMorphEngine(workspaceRoot);
-  }
+  if (!tsMorphEngineSingleton) {}
   return tsMorphEngineSingleton;
 }
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] ConditionalExpression
src/daemon/language-plugin-registry.ts:13:7
 async function getTsMorphEngine(
   workspaceRoot: string,
 ): Promise<import("../ts-engine/engine.js").TsMorphEngine> {
-  if (!tsMorphEngineSingleton) {
+  if (false) {
     const { TsMorphEngine } = await import("../ts-engine/engine.js");
     tsMorphEngineSingleton = new TsMorphEngine(workspaceRoot);
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:20:96
   return tsMorphEngineSingleton;
 }
 
-async function getPluginEngine(plugin: LanguagePlugin, workspaceRoot: string): Promise<Engine> {
-  let engine = pluginCompilers.get(plugin.id);
-  if (!engine) {
-    const tsEngine = await getTsMorphEngine(workspaceRoot);
-    engine = await plugin.createEngine(tsEngine, workspaceRoot);
-    pluginCompilers.set(plugin.id, engine);
-  }
-  return engine;
-}
+async function getPluginEngine(plugin: LanguagePlugin, workspaceRoot: string): Promise<Engine> {}
 
 export function registerLanguagePlugin(plugin: LanguagePlugin): void {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Killed] BooleanLiteral
src/daemon/language-plugin-registry.ts:22:7
 
 async function getPluginEngine(plugin: LanguagePlugin, workspaceRoot: string): Promise<Engine> {
   let engine = pluginCompilers.get(plugin.id);
-  if (!engine) {
+  if (engine) {
     const tsEngine = await getTsMorphEngine(workspaceRoot);
     engine = await plugin.createEngine(tsEngine, workspaceRoot);
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Killed] ConditionalExpression
src/daemon/language-plugin-registry.ts:22:7
 
 async function getPluginEngine(plugin: LanguagePlugin, workspaceRoot: string): Promise<Engine> {
   let engine = pluginCompilers.get(plugin.id);
-  if (!engine) {
+  if (true) {
     const tsEngine = await getTsMorphEngine(workspaceRoot);
     engine = await plugin.createEngine(tsEngine, workspaceRoot);
killedBy: LanguagePluginRegistry plugin resolution via makeRegistry caches the engine from createEngine — does not call it twice for the same plugin
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] CallExpression
src/daemon/language-plugin-registry.ts:25:5
   if (!engine) {
     const tsEngine = await getTsMorphEngine(workspaceRoot);
     engine = await plugin.createEngine(tsEngine, workspaceRoot);
-    pluginCompilers.set(plugin.id, engine);
+    ;
   }
   return engine;
killedBy: LanguagePluginRegistry plugin resolution via makeRegistry caches the engine from createEngine — does not call it twice for the same plugin
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:30:70
   return engine;
 }
 
-export function registerLanguagePlugin(plugin: LanguagePlugin): void {
-  languagePlugins.push(plugin);
-}
+export function registerLanguagePlugin(plugin: LanguagePlugin): void {}
 
 /** Clear all registered plugins and cached compilers. Exported for testing only. */
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] CallExpression
src/daemon/language-plugin-registry.ts:31:3
 }
 
 export function registerLanguagePlugin(plugin: LanguagePlugin): void {
-  languagePlugins.push(plugin);
+  ;
 }
 
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:35:46
 }
 
 /** Clear all registered plugins and cached compilers. Exported for testing only. */
-export function clearLanguagePlugins(): void {
-  languagePlugins.length = 0;
-  pluginCompilers.clear();
-}
+export function clearLanguagePlugins(): void {}
 
 /**
killedBy: LanguagePluginRegistry plugin resolution via makeRegistry falls back to TsMorphEngine when no plugin matches the project
statusReason: expected { …(16) } to be an instance of TsMorphEngine

[Survived] CallExpression
src/daemon/language-plugin-registry.ts:37:3
 /** Clear all registered plugins and cached compilers. Exported for testing only. */
 export function clearLanguagePlugins(): void {
   languagePlugins.length = 0;
-  pluginCompilers.clear();
+  ;
 }
 

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:60:19
   filePath: string | undefined,
   workspaceRoot: string,
   explicitTsConfig?: string,
-): EngineRegistry {
-  return {
-    async projectEngine(): Promise<Engine> {
-      const tsConfigPath =
-        explicitTsConfig ??
-        (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
-      if (tsConfigPath) {
-        for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
-            return getPluginEngine(plugin, workspaceRoot);
-          }
-        }
-      }
-      return getTsMorphEngine(workspaceRoot);
-    },
-  };
-}
+): EngineRegistry {}
 
 /**
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] ObjectLiteral
src/daemon/language-plugin-registry.ts:61:10
   workspaceRoot: string,
   explicitTsConfig?: string,
 ): EngineRegistry {
-  return {
-    async projectEngine(): Promise<Engine> {
-      const tsConfigPath =
-        explicitTsConfig ??
-        (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
-      if (tsConfigPath) {
-        for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
-            return getPluginEngine(plugin, workspaceRoot);
-          }
-        }
-      }
-      return getTsMorphEngine(workspaceRoot);
-    },
-  };
+  return {};
 }
 
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:62:44
   explicitTsConfig?: string,
 ): EngineRegistry {
   return {
-    async projectEngine(): Promise<Engine> {
-      const tsConfigPath =
-        explicitTsConfig ??
-        (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
-      if (tsConfigPath) {
-        for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
-            return getPluginEngine(plugin, workspaceRoot);
-          }
-        }
-      }
-      return getTsMorphEngine(workspaceRoot);
-    },
+    async projectEngine(): Promise<Engine> {},
   };
 }
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] LogicalOperator
src/daemon/language-plugin-registry.ts:64:9
   return {
     async projectEngine(): Promise<Engine> {
       const tsConfigPath =
-        explicitTsConfig ??
-        (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
+        explicitTsConfig && (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
       if (tsConfigPath) {
         for (const plugin of languagePlugins) {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] ConditionalExpression
src/daemon/language-plugin-registry.ts:66:11
       const tsConfigPath =
         explicitTsConfig ??
         (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
-      if (tsConfigPath) {
+      if (true) {
         for (const plugin of languagePlugins) {
           if (plugin.supportsProject(tsConfigPath)) {
killedBy: dispatchRequest error responses resolves an EngineError thrown by an operation to a matching error response
statusReason: expected { status: 'error', …(3) } to deeply equal { status: 'error', …(2) }

[Killed] ConditionalExpression
src/daemon/language-plugin-registry.ts:66:11
       const tsConfigPath =
         explicitTsConfig ??
         (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
-      if (tsConfigPath) {
+      if (false) {
         for (const plugin of languagePlugins) {
           if (plugin.supportsProject(tsConfigPath)) {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:67:47
         explicitTsConfig ??
         (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
       if (tsConfigPath) {
-        for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
-            return getPluginEngine(plugin, workspaceRoot);
-          }
-        }
+        for (const plugin of languagePlugins) {}
       }
       return getTsMorphEngine(workspaceRoot);
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:68:53
         (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
       if (tsConfigPath) {
         for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
-            return getPluginEngine(plugin, workspaceRoot);
-          }
+          if (plugin.supportsProject(tsConfigPath)) {}
         }
       }
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] ConditionalExpression
src/daemon/language-plugin-registry.ts:68:15
         (filePath ? findTsConfigForFile(filePath) : findTsConfig(workspaceRoot));
       if (tsConfigPath) {
         for (const plugin of languagePlugins) {
-          if (plugin.supportsProject(tsConfigPath)) {
+          if (true) {
             return getPluginEngine(plugin, workspaceRoot);
           }
killedBy: getTypeErrors scenarios renaming an unrelated symbol still reports the extensionless import in the post-write check
statusReason: src/main.ts was listed as changed but is identical: expected 'import { value } from "./helper";\nex…' not to be 'import { value } from "./helper";\nex…' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:83:56
  * Called by the watcher on `change` events — cheaper than full rebuild.
  * Errors in individual plugins are caught so one failure doesn't block others.
  */
-export function invalidateFile(filePath: string): void {
-  tsMorphEngineSingleton?.refreshFile(filePath);
-  for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateFile?.(filePath);
-    } catch {
-      // Isolation: continue to other plugins even if one throws
-    }
-  }
-}
+export function invalidateFile(filePath: string): void {}
 
 /**
killedBy: LanguagePluginRegistry invalidation fan-out invalidateFile calls invalidateFile on all registered plugins
statusReason: expected "vi.fn()" to be called with arguments: [ '/some/file.ts' ]

Number of calls: 0

[Killed] OptionalChaining
src/daemon/language-plugin-registry.ts:84:3
  * Errors in individual plugins are caught so one failure doesn't block others.
  */
 export function invalidateFile(filePath: string): void {
-  tsMorphEngineSingleton?.refreshFile(filePath);
+  tsMorphEngineSingleton.refreshFile(filePath);
   for (const plugin of languagePlugins) {
     try {
killedBy: LanguagePluginRegistry invalidation fan-out invalidateFile calls invalidateFile on all registered plugins
statusReason: Cannot read properties of undefined (reading 'refreshFile')

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:85:41
  */
 export function invalidateFile(filePath: string): void {
   tsMorphEngineSingleton?.refreshFile(filePath);
-  for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateFile?.(filePath);
-    } catch {
-      // Isolation: continue to other plugins even if one throws
-    }
-  }
+  for (const plugin of languagePlugins) {}
 }
 
killedBy: LanguagePluginRegistry invalidation fan-out invalidateFile calls invalidateFile on all registered plugins
statusReason: expected "vi.fn()" to be called with arguments: [ '/some/file.ts' ]

Number of calls: 0

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:86:9
 export function invalidateFile(filePath: string): void {
   tsMorphEngineSingleton?.refreshFile(filePath);
   for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateFile?.(filePath);
-    } catch {
+    try {} catch {
       // Isolation: continue to other plugins even if one throws
     }
killedBy: LanguagePluginRegistry invalidation fan-out invalidateFile calls invalidateFile on all registered plugins
statusReason: expected "vi.fn()" to be called with arguments: [ '/some/file.ts' ]

Number of calls: 0

[Survived] OptionalChaining
src/daemon/language-plugin-registry.ts:87:7
   tsMorphEngineSingleton?.refreshFile(filePath);
   for (const plugin of languagePlugins) {
     try {
-      plugin.invalidateFile?.(filePath);
+      plugin.invalidateFile(filePath);
     } catch {
       // Isolation: continue to other plugins even if one throws

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:99:62
  * loaded. Called for every source file the daemon writes, so a later check
  * cannot be answered from the text that was there before the write.
  */
-export function evictDiagnosticParse(filePath: string): void {
-  tsMorphEngineSingleton?.evictDiagnosticParse(filePath);
-}
+export function evictDiagnosticParse(filePath: string): void {}
 
 /**
killedBy: a write dispatched through the daemon does not answer a later check from the text it replaced
statusReason: expected { status: 'success', …(3) } to match object { diagnostics: ArrayContaining{…} }
(3 matching properties omitted from actual)

[Killed] OptionalChaining
src/daemon/language-plugin-registry.ts:100:3
  * cannot be answered from the text that was there before the write.
  */
 export function evictDiagnosticParse(filePath: string): void {
-  tsMorphEngineSingleton?.evictDiagnosticParse(filePath);
+  tsMorphEngineSingleton.evictDiagnosticParse(filePath);
 }
 
killedBy: dispatchRequest post-write diagnostics (checkTypeErrors) returns typeErrors fields by default when files are modified
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:107:50
  * Drop every diagnostic service and parse in the ts-morph engine, if it is
  * loaded. Plugin engines are not touched — only `tsMorphEngineSingleton`.
  */
-export function evictAllDiagnosticParses(): void {
-  tsMorphEngineSingleton?.evictAllDiagnosticParses();
-}
+export function evictAllDiagnosticParses(): void {}
 
 /**
killedBy: LanguagePluginRegistry evictAllDiagnosticParses makes the loaded engine's next diagnostic check read from disk
statusReason: expected +0 to be 1 // Object.is equality

[Killed] OptionalChaining
src/daemon/language-plugin-registry.ts:108:3
  * loaded. Plugin engines are not touched — only `tsMorphEngineSingleton`.
  */
 export function evictAllDiagnosticParses(): void {
-  tsMorphEngineSingleton?.evictAllDiagnosticParses();
+  tsMorphEngineSingleton.evictAllDiagnosticParses();
 }
 
killedBy: LanguagePluginRegistry evictAllDiagnosticParses does nothing when no engine has been loaded
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:117:39
  * that require the full project graph to be refreshed.
  * Errors in individual plugins are caught so one failure doesn't block others.
  */
-export function invalidateAll(): void {
-  tsMorphEngineSingleton = undefined;
-  pluginCompilers.clear();
-  for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateAll?.();
-    } catch {
-      // Isolation: continue to other plugins even if one throws
-    }
-  }
-}
+export function invalidateAll(): void {}
 
 // Register built-in plugins
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Killed] CallExpression
src/daemon/language-plugin-registry.ts:119:3
  */
 export function invalidateAll(): void {
   tsMorphEngineSingleton = undefined;
-  pluginCompilers.clear();
+  ;
   for (const plugin of languagePlugins) {
     try {
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:120:41
 export function invalidateAll(): void {
   tsMorphEngineSingleton = undefined;
   pluginCompilers.clear();
-  for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateAll?.();
-    } catch {
-      // Isolation: continue to other plugins even if one throws
-    }
-  }
+  for (const plugin of languagePlugins) {}
 }
 
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Killed] BlockStatement
src/daemon/language-plugin-registry.ts:121:9
   tsMorphEngineSingleton = undefined;
   pluginCompilers.clear();
   for (const plugin of languagePlugins) {
-    try {
-      plugin.invalidateAll?.();
-    } catch {
+    try {} catch {
       // Isolation: continue to other plugins even if one throws
     }
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Survived] OptionalChaining
src/daemon/language-plugin-registry.ts:122:7
   pluginCompilers.clear();
   for (const plugin of languagePlugins) {
     try {
-      plugin.invalidateAll?.();
+      plugin.invalidateAll();
     } catch {
       // Isolation: continue to other plugins even if one throws

[Killed] CallExpression
src/daemon/language-plugin-registry.ts:130:1
 }
 
 // Register built-in plugins
-registerLanguagePlugin(createVueLanguagePlugin());
+;
 
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality
