[Killed] BlockStatement
src/daemon/lifecycle.ts:47:29
   let server: DaemonServer | undefined;
   let watcher: DaemonWatcher | undefined;
 
-  function shutdown(): void {
-    void watcher?.stop();
-    server?.close();
-    logger?.cleanup();
-    onShutdown?.();
-    try {
-      fs.unlink(sockPath);
-    } catch {
-      // already gone
-    }
-    try {
-      fs.unlink(pidPath);
-    } catch {
-      // already gone
-    }
-    host.exit(0);
-  }
+  function shutdown(): void {}
 
   // Handlers are installed before the daemon becomes discoverable so no signal
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
src/daemon/lifecycle.ts:48:10
   let watcher: DaemonWatcher | undefined;
 
   function shutdown(): void {
-    void watcher?.stop();
+    void watcher.stop();
     server?.close();
     logger?.cleanup();
killedBy: daemon lifecycle early-stage shutdown (signal before server and watcher are attached) removes the lockfile and exits cleanly when the signal fires before the server starts
statusReason: Cannot read properties of undefined (reading 'stop')

[Killed] OptionalChaining
src/daemon/lifecycle.ts:49:5
 
   function shutdown(): void {
     void watcher?.stop();
-    server?.close();
+    server.close();
     logger?.cleanup();
     onShutdown?.();
killedBy: daemon lifecycle early-stage shutdown (signal before server and watcher are attached) removes the lockfile and exits cleanly when the signal fires before the server starts
statusReason: Cannot read properties of undefined (reading 'close')

[Killed] OptionalChaining
src/daemon/lifecycle.ts:50:5
   function shutdown(): void {
     void watcher?.stop();
     server?.close();
-    logger?.cleanup();
+    logger.cleanup();
     onShutdown?.();
     try {
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: Cannot read properties of undefined (reading 'cleanup')

[Killed] OptionalChaining
src/daemon/lifecycle.ts:51:5
     void watcher?.stop();
     server?.close();
     logger?.cleanup();
-    onShutdown?.();
+    onShutdown();
     try {
       fs.unlink(sockPath);
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: onShutdown is not a function

[Killed] BlockStatement
src/daemon/lifecycle.ts:52:9
     server?.close();
     logger?.cleanup();
     onShutdown?.();
-    try {
-      fs.unlink(sockPath);
-    } catch {
+    try {} catch {
       // already gone
     }
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:53:7
     logger?.cleanup();
     onShutdown?.();
     try {
-      fs.unlink(sockPath);
+      ;
     } catch {
       // already gone
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/lifecycle.ts:57:9
     } catch {
       // already gone
     }
-    try {
-      fs.unlink(pidPath);
-    } catch {
+    try {} catch {
       // already gone
     }
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:58:7
       // already gone
     }
     try {
-      fs.unlink(pidPath);
+      ;
     } catch {
       // already gone
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:62:5
     } catch {
       // already gone
     }
-    host.exit(0);
+    ;
   }
 
killedBy: daemon lifecycle shutdown via SIGTERM removes the socket and lockfile and calls exit(0) after full startup
statusReason: expected null to be +0 // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:67:3
 
   // Handlers are installed before the daemon becomes discoverable so no signal
   // can arrive after the lockfile is written but before cleanup is registered.
-  host.onSignal("SIGTERM", shutdown);
+  ;
   host.onSignal("SIGINT", shutdown);
 
killedBy: daemon lifecycle startup ordering installs both signal handlers before the daemon becomes discoverable (lockfile, then server, watcher, ready)
statusReason: expected [ 'signal:SIGINT', 'lockfile', …(3) ] to deeply equal [ 'signal:SIGTERM', …(5) ]

[Killed] CallExpression
src/daemon/lifecycle.ts:68:3
   // Handlers are installed before the daemon becomes discoverable so no signal
   // can arrive after the lockfile is written but before cleanup is registered.
   host.onSignal("SIGTERM", shutdown);
-  host.onSignal("SIGINT", shutdown);
+  ;
 
   fs.writeFile(pidPath, JSON.stringify({ pid, startedAt: Date.now() }));
killedBy: daemon lifecycle startup ordering installs both signal handlers before the daemon becomes discoverable (lockfile, then server, watcher, ready)
statusReason: expected [ 'signal:SIGTERM', 'lockfile', …(3) ] to deeply equal [ 'signal:SIGTERM', …(5) ]

[Killed] ObjectLiteral
src/daemon/lifecycle.ts:70:40
   host.onSignal("SIGTERM", shutdown);
   host.onSignal("SIGINT", shutdown);
 
-  fs.writeFile(pidPath, JSON.stringify({ pid, startedAt: Date.now() }));
+  fs.writeFile(pidPath, JSON.stringify({}));
 
   server = startServer();
killedBy: daemon lifecycle startup ordering writes the lockfile with the given pid and a startedAt timestamp
statusReason: expected undefined to be 99999 // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:73:3
   fs.writeFile(pidPath, JSON.stringify({ pid, startedAt: Date.now() }));
 
   server = startServer();
-  server.listen(sockPath);
+  ;
 
   watcher = startWatcher();
killedBy: daemon lifecycle startup ordering passes the sock path to the server's listen method
statusReason: expected null to be '/workspace/.cache/daemon.sock' // Object.is equality

[Killed] CallExpression
src/daemon/lifecycle.ts:77:3
 
   watcher = startWatcher();
 
-  signalReady();
+  ;
 }
 
killedBy: daemon lifecycle startup ordering installs both signal handlers before the daemon becomes discoverable (lockfile, then server, watcher, ready)
statusReason: expected [ 'signal:SIGTERM', …(4) ] to deeply equal [ 'signal:SIGTERM', …(5) ]
