[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:233:49
   }
 
   /** Drops the cached service for `tsConfigPath` and every parse behind it. */
-  invalidate(tsConfigPath: string | null): void {
-    this.entries.delete(tsConfigCacheKey(tsConfigPath));
-  }
+  invalidate(tsConfigPath: string | null): void {}
 
   /**
killedBy: DiagnosticServiceCache rebuilds on the next get after invalidate
statusReason: expected { …(3) } not to be { …(3) } // Object.is equality

[Killed] CallExpression
src/ts-engine/diagnostic-service.ts:234:5
 
   /** Drops the cached service for `tsConfigPath` and every parse behind it. */
   invalidate(tsConfigPath: string | null): void {
-    this.entries.delete(tsConfigCacheKey(tsConfigPath));
+    ;
   }
 
killedBy: DiagnosticServiceCache rebuilds on the next get after invalidate
statusReason: expected { …(3) } not to be { …(3) } // Object.is equality

[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:243:37
    * — and evicting only the config nearest the file leaves the other answering
    * from the text that was there before the write.
    */
-  evictFile(filePath: string): void {
-    for (const entry of this.entries.values()) {
-      if (entry.parsed.delete(filePath)) entry.service = undefined;
-    }
-  }
+  evictFile(filePath: string): void {}
 
   /**
killedBy: DiagnosticServiceCache retained parse cache evicts a shared file from every tsconfig that parsed it
statusReason: expected { …(3) } not to be { …(3) } // Object.is equality

[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:244:48
    * from the text that was there before the write.
    */
   evictFile(filePath: string): void {
-    for (const entry of this.entries.values()) {
-      if (entry.parsed.delete(filePath)) entry.service = undefined;
-    }
+    for (const entry of this.entries.values()) {}
   }
 
killedBy: DiagnosticServiceCache retained parse cache evicts a shared file from every tsconfig that parsed it
statusReason: expected { …(3) } not to be { …(3) } // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/diagnostic-service.ts:245:11
    */
   evictFile(filePath: string): void {
     for (const entry of this.entries.values()) {
-      if (entry.parsed.delete(filePath)) entry.service = undefined;
+      if (true) entry.service = undefined;
     }
   }
killedBy: a write dispatched through the daemon does not answer a later check from the text it replaced
statusReason: expected { status: 'success', …(3) } to match object { diagnostics: ArrayContaining{…} }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/ts-engine/diagnostic-service.ts:245:11
    */
   evictFile(filePath: string): void {
     for (const entry of this.entries.values()) {
-      if (entry.parsed.delete(filePath)) entry.service = undefined;
+      if (false) entry.service = undefined;
     }
   }
killedBy: a write dispatched through the daemon does not answer a later check from the text it replaced
statusReason: expected { status: 'success', …(3) } to match object { diagnostics: ArrayContaining{…} }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:254:68
    * rebuilds the program while every other file's parse survives. A path the
    * program never parsed is a no-op.
    */
-  refreshFile(tsConfigPath: string | null, filePath: string): void {
-    const entry = this.entries.get(tsConfigCacheKey(tsConfigPath));
-    // Only a file the program actually parsed can go stale, and rebuilding for
-    // one it never held would discard a whole program for nothing. This is what
-    // lets a caller evict on every write without knowing which paths carry a
-    // parse — a `.md` write costs a lookup, a `.mts` write is not missed.
-    if (entry?.parsed.delete(filePath)) entry.service = undefined;
-  }
+  refreshFile(tsConfigPath: string | null, filePath: string): void {}
 
   /**
killedBy: DiagnosticServiceCache retained parse cache reports a newly introduced type error after refreshFile evicts the changed file
statusReason: expected [] to include 2322

[Killed] ConditionalExpression
src/ts-engine/diagnostic-service.ts:260:9
     // one it never held would discard a whole program for nothing. This is what
     // lets a caller evict on every write without knowing which paths carry a
     // parse — a `.md` write costs a lookup, a `.mts` write is not missed.
-    if (entry?.parsed.delete(filePath)) entry.service = undefined;
+    if (false) entry.service = undefined;
   }
 
killedBy: DiagnosticServiceCache retained parse cache reports a newly introduced type error after refreshFile evicts the changed file
statusReason: expected [] to include 2322

[Killed] ConditionalExpression
src/ts-engine/diagnostic-service.ts:260:9
     // one it never held would discard a whole program for nothing. This is what
     // lets a caller evict on every write without knowing which paths carry a
     // parse — a `.md` write costs a lookup, a `.mts` write is not missed.
-    if (entry?.parsed.delete(filePath)) entry.service = undefined;
+    if (true) entry.service = undefined;
   }
 
killedBy: DiagnosticServiceCache refreshing an unbuilt tsconfig path is a no-op
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of u…' was thrown

[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:269:20
    * daemon has seen is not lost; only the retained program and its source files
    * are dropped.
    */
-  evictAll(): void {
-    for (const entry of this.entries.values()) {
-      entry.service = undefined;
-      entry.parsed.clear();
-    }
-  }
+  evictAll(): void {}
 }
 
killedBy: DiagnosticServiceCache evictAll causes the next get to rebuild from disk
statusReason: expected "readFile" to be called at least once

[Killed] BlockStatement
src/ts-engine/diagnostic-service.ts:270:48
    * are dropped.
    */
   evictAll(): void {
-    for (const entry of this.entries.values()) {
-      entry.service = undefined;
-      entry.parsed.clear();
-    }
+    for (const entry of this.entries.values()) {}
   }
 }
killedBy: DiagnosticServiceCache evictAll causes the next get to rebuild from disk
statusReason: expected "readFile" to be called at least once

[Killed] CallExpression
src/ts-engine/diagnostic-service.ts:272:7
   evictAll(): void {
     for (const entry of this.entries.values()) {
       entry.service = undefined;
-      entry.parsed.clear();
+      ;
     }
   }
killedBy: DiagnosticServiceCache evictAll causes the next get to rebuild from disk
statusReason: expected "readFile" to be called at least once
