[Killed] BlockStatement
src/ts-engine/engine.ts:42:35
   private diagnosticServices = new DiagnosticServiceCache();
   private workspaceRoot: string;
 
-  constructor(workspaceRoot = "") {
-    this.workspaceRoot = workspaceRoot;
-  }
+  constructor(workspaceRoot = "") {}
 
   /**
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:52:60
    * `project`'s file set from *before* this addition — the seed
    * `typeCheckedFiles` closes over module resolution.
    */
-  private addWorkspaceFiles(project: Project): Set<string> {
-    const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
-    if (!this.workspaceRoot) return seed;
-    for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!seed.has(file)) {
-        project.addSourceFileAtPath(file);
-      }
-    }
-    return seed;
-  }
+  private addWorkspaceFiles(project: Project): Set<string> {}
 
   private ensureProject(filePath: string): {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] ArrowFunction
src/ts-engine/engine.ts:53:55
    * `typeCheckedFiles` closes over module resolution.
    */
   private addWorkspaceFiles(project: Project): Set<string> {
-    const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
+    const seed = new Set(project.getSourceFiles().map(() => undefined));
     if (!this.workspaceRoot) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] BooleanLiteral
src/ts-engine/engine.ts:54:9
    */
   private addWorkspaceFiles(project: Project): Set<string> {
     const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
-    if (!this.workspaceRoot) return seed;
+    if (this.workspaceRoot) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
       if (!seed.has(file)) {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/engine.ts:54:9
    */
   private addWorkspaceFiles(project: Project): Set<string> {
     const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
-    if (!this.workspaceRoot) return seed;
+    if (true) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
       if (!seed.has(file)) {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:55:75
   private addWorkspaceFiles(project: Project): Set<string> {
     const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
     if (!this.workspaceRoot) return seed;
-    for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!seed.has(file)) {
-        project.addSourceFileAtPath(file);
-      }
-    }
+    for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {}
     return seed;
   }
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:56:28
     const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
     if (!this.workspaceRoot) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!seed.has(file)) {
-        project.addSourceFileAtPath(file);
-      }
+      if (!seed.has(file)) {}
     }
     return seed;
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Killed] BooleanLiteral
src/ts-engine/engine.ts:56:11
     const seed = new Set(project.getSourceFiles().map((sf) => sf.getFilePath() as string));
     if (!this.workspaceRoot) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!seed.has(file)) {
+      if (seed.has(file)) {
         project.addSourceFileAtPath(file);
       }
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] CallExpression
src/ts-engine/engine.ts:57:9
     if (!this.workspaceRoot) return seed;
     for (const file of walkFiles(this.workspaceRoot, [...TS_EXTENSIONS])) {
       if (!seed.has(file)) {
-        project.addSourceFileAtPath(file);
+        ;
       }
     }
killedBy: setExport scenarios refuses to un-export a symbol used by a TS file outside the tsconfig include set
statusReason: Every workspace TS file is added to the project graph regardless of the tsconfig include set, so the language-service reference check already sees this importer — no separate scan covers it. The Vue SFC in the project has no bearing on the call and must stay untouched.


src/utils.ts should have been left alone: expected 'function foo() { return 1; }\n' to be 'export function foo() { return 1; }\n

[Killed] BlockStatement
src/ts-engine/engine.ts:67:5
     project: Project;
     languageService: ts.LanguageService;
     sourceFile: import("ts-morph").SourceFile;
-  } {
-    const project = this.getProject(filePath);
-    const sourceFile = project.getSourceFile(filePath) ?? project.addSourceFileAtPath(filePath);
-    return { project, languageService: project.getLanguageService().compilerObject, sourceFile };
-  }
+  } {}
 
   /** Loads (or returns the cached) project entry for `tsConfigPath`, creating one if needed. */
killedBy: tsExtractFunction creates a new function and replaces the selection with a call
statusReason: Cannot read properties of undefined (reading 'languageService')

[Killed] LogicalOperator
src/ts-engine/engine.ts:69:24
     sourceFile: import("ts-morph").SourceFile;
   } {
     const project = this.getProject(filePath);
-    const sourceFile = project.getSourceFile(filePath) ?? project.addSourceFileAtPath(filePath);
+    const sourceFile = project.getSourceFile(filePath) && project.addSourceFileAtPath(filePath);
     return { project, languageService: project.getLanguageService().compilerObject, sourceFile };
   }
killedBy: TsMorphEngine resolveOffset works for a file with no parent tsconfig (no-tsconfig project path)
statusReason: No symbol at line 1, col 14 in /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ts-notconfig-Z02DLe/standalone.ts

[Killed] ObjectLiteral
src/ts-engine/engine.ts:70:12
   } {
     const project = this.getProject(filePath);
     const sourceFile = project.getSourceFile(filePath) ?? project.addSourceFileAtPath(filePath);
-    return { project, languageService: project.getLanguageService().compilerObject, sourceFile };
+    return {};
   }
 
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: src/main.ts was listed as changed but is identical: expected 'export const metaValue = import.meta;…' not to be 'export const metaValue = import.meta;…' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:74:71
   }
 
   /** Loads (or returns the cached) project entry for `tsConfigPath`, creating one if needed. */
-  private loadProjectEntry(tsConfigPath: string | null): ProjectEntry {
-    const cacheKey = tsConfigCacheKey(tsConfigPath);
-    let entry = this.projectEntries.get(cacheKey);
-    if (!entry) {
-      const project = tsConfigPath
-        ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
-        : new Project({ useInMemoryFileSystem: false });
-      const seed = this.addWorkspaceFiles(project);
-      entry = { project, seed };
-      this.projectEntries.set(cacheKey, entry);
-    }
-    return entry;
-  }
+  private loadProjectEntry(tsConfigPath: string | null): ProjectEntry {}
 
   private getProject(filePath: string): Project {
killedBy: TsMorphEngine resolveOffset converts 1-based line/col to 0-based offset
statusReason: Cannot read properties of undefined (reading 'project')

[Killed] ConditionalExpression
src/ts-engine/engine.ts:77:9
   private loadProjectEntry(tsConfigPath: string | null): ProjectEntry {
     const cacheKey = tsConfigCacheKey(tsConfigPath);
     let entry = this.projectEntries.get(cacheKey);
-    if (!entry) {
+    if (true) {
       const project = tsConfigPath
         ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
killedBy: getTypeErrors scenarios renaming an unrelated symbol still reports the extensionless import in the post-write check
statusReason: response: expected { status: 'warn', …(9) } to deeply equal { status: 'warn', …(9) }

[Killed] BlockStatement
src/ts-engine/engine.ts:77:17
   private loadProjectEntry(tsConfigPath: string | null): ProjectEntry {
     const cacheKey = tsConfigCacheKey(tsConfigPath);
     let entry = this.projectEntries.get(cacheKey);
-    if (!entry) {
-      const project = tsConfigPath
-        ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
-        : new Project({ useInMemoryFileSystem: false });
-      const seed = this.addWorkspaceFiles(project);
-      entry = { project, seed };
-      this.projectEntries.set(cacheKey, entry);
-    }
+    if (!entry) {}
     return entry;
   }
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/engine.ts:79:86
     let entry = this.projectEntries.get(cacheKey);
     if (!entry) {
       const project = tsConfigPath
-        ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
+        ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: true })
         : new Project({ useInMemoryFileSystem: false });
       const seed = this.addWorkspaceFiles(project);
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BooleanLiteral
src/ts-engine/engine.ts:80:48
     if (!entry) {
       const project = tsConfigPath
         ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
-        : new Project({ useInMemoryFileSystem: false });
+        : new Project({ useInMemoryFileSystem: true });
       const seed = this.addWorkspaceFiles(project);
       entry = { project, seed };
killedBy: getTypeErrors scenarios a project-wide check on a workspace with no tsconfig still reports a walked file's error
statusReason: With no tsconfig there is no program to defer to, so the workspace walk is the only file set — narrowing to a nonexistent tsconfig scope would silently report a clean bill of health instead.


response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Survived] ObjectLiteral
src/ts-engine/engine.ts:80:23
     if (!entry) {
       const project = tsConfigPath
         ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
-        : new Project({ useInMemoryFileSystem: false });
+        : new Project({});
       const seed = this.addWorkspaceFiles(project);
       entry = { project, seed };

[Killed] ObjectLiteral
src/ts-engine/engine.ts:82:15
         ? new Project({ tsConfigFilePath: tsConfigPath, skipAddingFilesFromTsConfig: false })
         : new Project({ useInMemoryFileSystem: false });
       const seed = this.addWorkspaceFiles(project);
-      entry = { project, seed };
+      entry = {};
       this.projectEntries.set(cacheKey, entry);
     }
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] CallExpression
src/ts-engine/engine.ts:83:7
         : new Project({ useInMemoryFileSystem: false });
       const seed = this.addWorkspaceFiles(project);
       entry = { project, seed };
-      this.projectEntries.set(cacheKey, entry);
+      ;
     }
     return entry;
killedBy: getTypeErrors scenarios renaming an unrelated symbol still reports the extensionless import in the post-write check
statusReason: response: expected { status: 'warn', …(9) } to deeply equal { status: 'warn', …(9) }

[Killed] BlockStatement
src/ts-engine/engine.ts:88:49
     return entry;
   }
 
-  private getProject(filePath: string): Project {
-    return this.loadProjectEntry(findTsConfigForFile(filePath)).project;
-  }
+  private getProject(filePath: string): Project {}
 
   /** For operations that need direct AST access (e.g. moveSymbol). */
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: src/main.ts was listed as changed but is identical: expected 'export const metaValue = import.meta;…' not to be 'export const metaValue = import.meta;…' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:93:48
   }
 
   /** For operations that need direct AST access (e.g. moveSymbol). */
-  getProjectForFile(filePath: string): Project {
-    return this.getProject(filePath);
-  }
+  getProjectForFile(filePath: string): Project {}
 
   /**
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(9) }

[Killed] BlockStatement
src/ts-engine/engine.ts:102:52
    * Unlike `getProjectForFile`, starts the tsconfig search from `dirPath` itself
    * rather than from its parent — correct when the caller has a directory, not a file.
    */
-  getProjectForDirectory(dirPath: string): Project {
-    return this.loadProjectEntry(findTsConfig(dirPath)).project;
-  }
+  getProjectForDirectory(dirPath: string): Project {}
 
   invalidateProject(filePath: string): void {
killedBy: moveDirectory action - VolarEngine integration external .vue files importing from moved directory updates import specifier in external .vue file after moving a composables directory
statusReason: Cannot read properties of undefined (reading 'getSourceFile')

[Killed] BlockStatement
src/ts-engine/engine.ts:106:45
     return this.loadProjectEntry(findTsConfig(dirPath)).project;
   }
 
-  invalidateProject(filePath: string): void {
-    const tsConfigPath = findTsConfigForFile(filePath);
-    this.projectEntries.delete(tsConfigCacheKey(tsConfigPath));
-    this.diagnosticServices.invalidate(tsConfigPath);
-  }
+  invalidateProject(filePath: string): void {}
 
   /**
killedBy: dispatchRequest per-operation dispatch dispatches extractFunction and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] CallExpression
src/ts-engine/engine.ts:108:5
 
   invalidateProject(filePath: string): void {
     const tsConfigPath = findTsConfigForFile(filePath);
-    this.projectEntries.delete(tsConfigCacheKey(tsConfigPath));
+    ;
     this.diagnosticServices.invalidate(tsConfigPath);
   }
killedBy: dispatchRequest per-operation dispatch dispatches extractFunction and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality

[Survived] CallExpression
src/ts-engine/engine.ts:109:5
   invalidateProject(filePath: string): void {
     const tsConfigPath = findTsConfigForFile(filePath);
     this.projectEntries.delete(tsConfigCacheKey(tsConfigPath));
-    this.diagnosticServices.invalidate(tsConfigPath);
+    ;
   }
 

[Killed] BlockStatement
src/ts-engine/engine.ts:117:85
    * `undefined` if the project has not been loaded yet. Does not create a
    * new project — use `getProject` for that.
    */
-  getCachedProjectForFile(filePath: string): import("ts-morph").Project | undefined {
-    return this.projectEntries.get(tsConfigCacheKey(findTsConfigForFile(filePath)))?.project;
-  }
+  getCachedProjectForFile(filePath: string): import("ts-morph").Project | undefined {}
 
   /**
killedBy: moveFile scenarios a later move uses project state the earlier move updated
statusReason: The daemon keeps one compiler across calls, so the second move must see that the first one relocated its dependency. A project still holding the old src/utils.ts computes edit offsets against text that no longer matches disk, splicing the import into nonsense like ../src/utilsutils.
checkTypeErrors is off deliberately. Collecting diagnostics reloads every modified file, which repairs an incoherent

[Killed] OptionalChaining
src/ts-engine/engine.ts:118:12
    * new project — use `getProject` for that.
    */
   getCachedProjectForFile(filePath: string): import("ts-morph").Project | undefined {
-    return this.projectEntries.get(tsConfigCacheKey(findTsConfigForFile(filePath)))?.project;
+    return this.projectEntries.get(tsConfigCacheKey(findTsConfigForFile(filePath))).project;
   }
 
killedBy: tsAfterFileRename does not touch files outside the workspace boundary
statusReason: Cannot read properties of undefined (reading 'project')

[Killed] BlockStatement
src/ts-engine/engine.ts:125:87
    * Removes all import and export declarations that reference `targetFile` from
    * every in-scope TS/JS file. Delegates to `tsRemoveImportersOf`.
    */
-  async removeImportersOf(targetFile: string, scope: WorkspaceScope): Promise<number> {
-    return tsRemoveImportersOf(this, targetFile, scope);
-  }
+  async removeImportersOf(targetFile: string, scope: WorkspaceScope): Promise<number> {}
 
   /**
killedBy: TsMorphEngine removeImportersOf delegates to tsRemoveImportersOf with workspace-expanded project graph
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:133:96
    * Full delete workflow: delegates to `tsDeleteFile` which handles importer
    * removal, Vue SFC cleanup, physical deletion, and project cache invalidation.
    */
-  async deleteFile(targetFile: string, scope: WorkspaceScope): Promise<DeleteFileActionResult> {
-    return tsDeleteFile(this, targetFile, scope);
-  }
+  async deleteFile(targetFile: string, scope: WorkspaceScope): Promise<DeleteFileActionResult> {}
 
   /**
killedBy: dispatchRequest per-operation dispatch dispatches deleteFile and returns result shape
statusReason: expected 'error' to be 'warn' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:145:36
     oldPath: string,
     newPath: string,
     scope: WorkspaceScope,
-  ): Promise<MoveFileActionResult> {
-    return tsMoveFile(this, oldPath, newPath, scope);
-  }
+  ): Promise<MoveFileActionResult> {}
 
   /**
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] BlockStatement
src/ts-engine/engine.ts:154:67
    * language service. Callers get compiler access without holding a `Project`
    * reference — no ts-morph coupling at the call site.
    */
-  getLanguageServiceForFile(filePath: string): ts.LanguageService {
-    return this.ensureProject(filePath).languageService;
-  }
+  getLanguageServiceForFile(filePath: string): ts.LanguageService {}
 
   /**
killedBy: tsExtractFunction creates a new function and replaces the selection with a call
statusReason: Cannot read properties of undefined (reading 'getApplicableRefactors')

[Killed] BlockStatement
src/ts-engine/engine.ts:165:86
    * entry: tsconfig resolution is not what ts-morph gets wrong, so there is
    * no need to parse it a second time.
    */
-  private loadDiagnosticServiceEntry(tsConfigPath: string | null): DiagnosticService {
-    return this.diagnosticServices.get(tsConfigPath, () => {
-      const projectEntry = this.loadProjectEntry(tsConfigPath);
-      return {
-        compilerOptions: projectEntry.project.getCompilerOptions(),
-        rootNames: projectEntry.project.getSourceFiles().map((sf) => sf.getFilePath() as string),
-      };
-    });
-  }
+  private loadDiagnosticServiceEntry(tsConfigPath: string | null): DiagnosticService {}
 
   /**
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:166:60
    * no need to parse it a second time.
    */
   private loadDiagnosticServiceEntry(tsConfigPath: string | null): DiagnosticService {
-    return this.diagnosticServices.get(tsConfigPath, () => {
-      const projectEntry = this.loadProjectEntry(tsConfigPath);
-      return {
-        compilerOptions: projectEntry.project.getCompilerOptions(),
-        rootNames: projectEntry.project.getSourceFiles().map((sf) => sf.getFilePath() as string),
-      };
-    });
+    return this.diagnosticServices.get(tsConfigPath, () => {});
   }
 
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] ObjectLiteral
src/ts-engine/engine.ts:168:14
   private loadDiagnosticServiceEntry(tsConfigPath: string | null): DiagnosticService {
     return this.diagnosticServices.get(tsConfigPath, () => {
       const projectEntry = this.loadProjectEntry(tsConfigPath);
-      return {
-        compilerOptions: projectEntry.project.getCompilerOptions(),
-        rootNames: projectEntry.project.getSourceFiles().map((sf) => sf.getFilePath() as string),
-      };
+      return {};
     });
   }
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] ArrowFunction
src/ts-engine/engine.ts:170:62
       const projectEntry = this.loadProjectEntry(tsConfigPath);
       return {
         compilerOptions: projectEntry.project.getCompilerOptions(),
-        rootNames: projectEntry.project.getSourceFiles().map((sf) => sf.getFilePath() as string),
+        rootNames: projectEntry.project.getSourceFiles().map(() => undefined),
       };
     });
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:181:81
    * ts-morph's; see `diagnostic-service.ts` for why ts-morph's own diagnostics
    * are unreliable under `module: NodeNext`.
    */
-  getDiagnosticServiceForConfig(tsConfigPath: string | null): DiagnosticService {
-    return this.loadDiagnosticServiceEntry(tsConfigPath);
-  }
+  getDiagnosticServiceForConfig(tsConfigPath: string | null): DiagnosticService {}
 
   /**
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:193:68
    * a file the tsconfig excludes would silently see zero script files and
    * report a clean result no matter what the file contains.
    */
-  getDiagnosticServiceForFile(filePath: string): DiagnosticService {
-    const service = this.loadDiagnosticServiceEntry(findTsConfigForFile(filePath));
-    service.addScriptFile(filePath);
-    return service;
-  }
+  getDiagnosticServiceForFile(filePath: string): DiagnosticService {}
 
   /**
killedBy: getTypeErrors scenarios get-type-errors resolves a relative file argument against the workspace root
statusReason: file, like tsconfig, must join against the workspace root rather than being read as-is — an unresolved relative path here previously reported FILE_NOT_FOUND for a file that does exist, once the caller's own working directory wasn't the workspace.


response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(3) }

[Killed] CallExpression
src/ts-engine/engine.ts:195:5
    */
   getDiagnosticServiceForFile(filePath: string): DiagnosticService {
     const service = this.loadDiagnosticServiceEntry(findTsConfigForFile(filePath));
-    service.addScriptFile(filePath);
+    ;
     return service;
   }
killedBy: setExport on a file outside the project graph loads a target the workspace walk excludes
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:208:35
     file: string | undefined,
     scope: WorkspaceScope,
     tsConfigPath?: string,
-  ): Promise<GetTypeErrorsResult> {
-    return tsGetTypeErrors(this, file, scope, tsConfigPath ?? null);
-  }
+  ): Promise<GetTypeErrorsResult> {}
 
   handlesFileExtension(ext: string): boolean {
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] LogicalOperator
src/ts-engine/engine.ts:209:47
     scope: WorkspaceScope,
     tsConfigPath?: string,
   ): Promise<GetTypeErrorsResult> {
-    return tsGetTypeErrors(this, file, scope, tsConfigPath ?? null);
+    return tsGetTypeErrors(this, file, scope, tsConfigPath && null);
   }
 
killedBy: getTypeErrors scenarios a project-wide check answers for a named tsconfig instead of the discovered one
statusReason: tsconfig.json (the discovered default) excludes tests/, but naming tsconfig.test.json directly answers for that config's own program instead — the excluded file's error surfaces, and checked.tsconfig names the config that actually answered.


response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/engine.ts:212:46
     return tsGetTypeErrors(this, file, scope, tsConfigPath ?? null);
   }
 
-  handlesFileExtension(ext: string): boolean {
-    return ext === ".ts" || ext === ".tsx";
-  }
+  handlesFileExtension(ext: string): boolean {}
 
   /** Public accessor for the seed `addWorkspaceFiles` computed — `null` when there's no tsconfig. */
killedBy: moveFile scenarios leaves a bare module specifier alone while rewriting the relative one beside it
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'warn', …(7) }

[Killed] EqualityOperator
src/ts-engine/engine.ts:213:29
   }
 
   handlesFileExtension(ext: string): boolean {
-    return ext === ".ts" || ext === ".tsx";
+    return ext === ".ts" || ext !== ".tsx";
   }
 
killedBy: getTypeErrorsForFiles returns empty for a .vue file when the engine does not handle .vue, without throwing
statusReason: Could not find source file: '/var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-nLr3th/src/NotInProgram.vue'.

[Killed] LogicalOperator
src/ts-engine/engine.ts:213:12
   }
 
   handlesFileExtension(ext: string): boolean {
-    return ext === ".ts" || ext === ".tsx";
+    return ext === ".ts" && ext === ".tsx";
   }
 
killedBy: getTypeErrors scenarios renaming a symbol in a CommonJS NodeNext file still reports import.meta in the post-write check
statusReason: response: expected { status: 'success', …(9) } to deeply equal { status: 'warn', …(9) }

[Killed] BlockStatement
src/ts-engine/engine.ts:217:56
   }
 
   /** Public accessor for the seed `addWorkspaceFiles` computed — `null` when there's no tsconfig. */
-  getSeedFilePaths(workspace: string): string[] | null {
-    return this.getSeedFilePathsForConfig(findTsConfig(workspace));
-  }
+  getSeedFilePaths(workspace: string): string[] | null {}
 
   /** Same as `getSeedFilePaths`, but for an explicit tsconfig path rather than a directory to discover one from. */
killedBy: TsMorphEngine getSeedFilePaths returns the tsconfig program's own files, excluding walk-only files
statusReason: expected undefined to be true // Object.is equality
