[Killed] ConditionalExpression
src/ts-engine/engine.ts:380:9
    */
   async getEditsForFileRename(oldPath: string, newPath: string): Promise<FileTextEdit[]> {
     const project = this.getProject(oldPath);
-    if (!project.getSourceFile(oldPath)) {
+    if (false) {
       project.addSourceFileAtPath(oldPath);
     }
killedBy: tsMoveFile - TsMorphEngine integration sequential moves in git-tracked directories does not throw ENOENT when git ls-files returns a file deleted by a prior move
statusReason: expected 'import { makeMock } from "../src/help…' to contain './helpers/mock'

[Killed] CallExpression
src/ts-engine/engine.ts:381:7
   async getEditsForFileRename(oldPath: string, newPath: string): Promise<FileTextEdit[]> {
     const project = this.getProject(oldPath);
     if (!project.getSourceFile(oldPath)) {
-      project.addSourceFileAtPath(oldPath);
+      ;
     }
 
killedBy: tsMoveFile - TsMorphEngine integration sequential moves in git-tracked directories does not throw ENOENT when git ls-files returns a file deleted by a prior move
statusReason: expected 'import { makeMock } from "../src/help…' to contain './helpers/mock'

[Killed] MethodExpression
src/ts-engine/engine.ts:387:12
     const ls = project.getLanguageService().compilerObject;
     const edits = ls.getEditsForFileRename(oldPath, newPath, {}, {});
 
-    return edits
-      .filter((e) => e.textChanges.length > 0)
-      .map((e) => ({
-        fileName: e.fileName,
-        textChanges: e.textChanges
-          .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
-          .map((c) => ({
-            span: { start: c.span.start, length: c.span.length },
-            newText: c.newText,
-          })),
-      }))
-      .filter((e) => e.textChanges.length > 0);
+    return edits.filter(e => e.textChanges.length > 0).map(e => ({
+  fileName: e.fileName,
+  textChanges: e.textChanges.filter(c => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length)).map(c => ({
+    span: {
+      start: c.span.start,
+      length: c.span.length
+    },
+    newText: c.newText
+  }))
+}));
   }
 
killedBy: moveFile scenarios leaves a .js specifier alone when a real .js file sits beside the moved one
statusReason: response: expected { status: 'warn', …(7) } to deeply equal { status: 'success', …(7) }

[Survived] MethodExpression
src/ts-engine/engine.ts:387:12
     const ls = project.getLanguageService().compilerObject;
     const edits = ls.getEditsForFileRename(oldPath, newPath, {}, {});
 
-    return edits
-      .filter((e) => e.textChanges.length > 0)
+    return edits
       .map((e) => ({
         fileName: e.fileName,

[Killed] ArrowFunction
src/ts-engine/engine.ts:388:15
     const edits = ls.getEditsForFileRename(oldPath, newPath, {}, {});
 
     return edits
-      .filter((e) => e.textChanges.length > 0)
+      .filter(() => undefined)
       .map((e) => ({
         fileName: e.fileName,
killedBy: moveFile scenarios follows the moved file through an @ path alias
statusReason: src/main.ts was listed as changed but is identical: expected 'import { greetUser } from "@/utils";\…' not to be 'import { greetUser } from "@/utils";\…' // Object.is equality

[Killed] EqualityOperator
src/ts-engine/engine.ts:388:22
     const edits = ls.getEditsForFileRename(oldPath, newPath, {}, {});
 
     return edits
-      .filter((e) => e.textChanges.length > 0)
+      .filter((e) => e.textChanges.length <= 0)
       .map((e) => ({
         fileName: e.fileName,
killedBy: moveFile scenarios follows the moved file through an @ path alias
statusReason: src/main.ts was listed as changed but is identical: expected 'import { greetUser } from "@/utils";\…' not to be 'import { greetUser } from "@/utils";\…' // Object.is equality

[Killed] ArrowFunction
src/ts-engine/engine.ts:389:12
 
     return edits
       .filter((e) => e.textChanges.length > 0)
-      .map((e) => ({
-        fileName: e.fileName,
-        textChanges: e.textChanges
-          .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
-          .map((c) => ({
-            span: { start: c.span.start, length: c.span.length },
-            newText: c.newText,
-          })),
-      }))
+      .map(() => undefined)
       .filter((e) => e.textChanges.length > 0);
   }
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] MethodExpression
src/ts-engine/engine.ts:391:22
       .filter((e) => e.textChanges.length > 0)
       .map((e) => ({
         fileName: e.fileName,
-        textChanges: e.textChanges
-          .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
+        textChanges: e.textChanges
           .map((c) => ({
             span: { start: c.span.start, length: c.span.length },
killedBy: moveFile scenarios leaves a .js specifier alone when a real .js file sits beside the moved one
statusReason: src/jsConsumer.ts should have been left alone: expected 'import { greetUser } from "../lib/uti…' to be 'import { greetUser } from "./utils.js…' // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/engine.ts:392:26
       .map((e) => ({
         fileName: e.fileName,
         textChanges: e.textChanges
-          .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
+          .filter((c) => isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
           .map((c) => ({
             span: { start: c.span.start, length: c.span.length },
killedBy: moveFile scenarios leaves a .js specifier alone when a real .js file sits beside the moved one
statusReason: src/jsConsumer.ts should have been left alone: expected 'import { greetUser } from "../lib/uti…' to be 'import { greetUser } from "./utils.js…' // Object.is equality

[Killed] ArrowFunction
src/ts-engine/engine.ts:392:19
       .map((e) => ({
         fileName: e.fileName,
         textChanges: e.textChanges
-          .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
+          .filter(() => undefined)
           .map((c) => ({
             span: { start: c.span.start, length: c.span.length },
killedBy: moveFile scenarios follows the moved file through an @ path alias
statusReason: src/main.ts was listed as changed but is identical: expected 'import { greetUser } from "@/utils";\…' not to be 'import { greetUser } from "@/utils";\…' // Object.is equality

[Killed] ArrowFunction
src/ts-engine/engine.ts:393:16
         fileName: e.fileName,
         textChanges: e.textChanges
           .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
-          .map((c) => ({
-            span: { start: c.span.start, length: c.span.length },
-            newText: c.newText,
-          })),
+          .map(() => undefined),
       }))
       .filter((e) => e.textChanges.length > 0);
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] ObjectLiteral
src/ts-engine/engine.ts:393:24
         fileName: e.fileName,
         textChanges: e.textChanges
           .filter((c) => !isCoexistingJsFileEdit(e.fileName, c.span.start, c.span.length))
-          .map((c) => ({
-            span: { start: c.span.start, length: c.span.length },
-            newText: c.newText,
-          })),
+          .map((c) => ({})),
       }))
       .filter((e) => e.textChanges.length > 0);
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] EqualityOperator
src/ts-engine/engine.ts:398:22
             newText: c.newText,
           })),
       }))
-      .filter((e) => e.textChanges.length > 0);
+      .filter((e) => e.textChanges.length >= 0);
   }
 
killedBy: moveFile scenarios leaves a .js specifier alone when a real .js file sits beside the moved one
statusReason: response: expected { status: 'warn', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] EqualityOperator
src/ts-engine/engine.ts:398:22
             newText: c.newText,
           })),
       }))
-      .filter((e) => e.textChanges.length > 0);
+      .filter((e) => e.textChanges.length <= 0);
   }
 
killedBy: moveFile scenarios leaves a .js specifier alone when a real .js file sits beside the moved one
statusReason: response: expected { status: 'warn', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/ts-engine/engine.ts:401:38
       .filter((e) => e.textChanges.length > 0);
   }
 
-  readFile(filePath: string): string {
-    return fs.readFileSync(filePath, "utf8");
-  }
+  readFile(filePath: string): string {}
 
   notifyFileWritten(_path: string, _content: string): void {
killedBy: moveFile scenarios moves a file and repoints every importer
statusReason: src/utils.ts should have moved away: expected 'export function greetUser(name: strin…' to be undefined

[Killed] BlockStatement
src/ts-engine/engine.ts:418:40
     oldPath: string,
     newPath: string,
     scope: WorkspaceScope,
-  ): Promise<{ filesMoved: string[] }> {
-    return tsMoveDirectory(this, oldPath, newPath, scope);
-  }
+  ): Promise<{ filesMoved: string[] }> {}
 
   /**
killedBy: TsMorphEngine.moveDirectory scope records modified files records moved and externally-modified files in scope
statusReason: expected [] to include '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…'

[Killed] BlockStatement
src/ts-engine/engine.ts:433:28
     col: number,
     newName: string,
     scope: WorkspaceScope,
-  ): Promise<RenameResult> {
-    return tsRename(this, file, line, col, newName, scope);
-  }
+  ): Promise<RenameResult> {}
 
   /**
killedBy: getTypeErrors scenarios renaming a symbol in an ESM NodeNext file leaves the post-write check clean of import.meta errors
statusReason: src/main.ts was listed as changed but is identical: expected 'export const metaValue = import.meta;…' not to be 'export const metaValue = import.meta;…' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:447:31
     symbolName: string,
     exported: boolean,
     scope: WorkspaceScope,
-  ): Promise<SetExportResult> {
-    return tsSetExport(this, file, symbolName, exported, scope);
-  }
+  ): Promise<SetExportResult> {}
 
   /**
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: src/a.ts was listed as changed but is identical: expected 'function foo() { return 1; }\n' not to be 'function foo() { return 1; }\n' // Object.is equality

[Killed] BlockStatement
src/ts-engine/engine.ts:464:37
     endCol: number,
     functionName: string,
     scope: WorkspaceScope,
-  ): Promise<ExtractFunctionResult> {
-    return tsExtractFunction(this, file, startLine, startCol, endLine, endCol, functionName, scope);
-  }
+  ): Promise<ExtractFunctionResult> {}
 }
 
killedBy: dispatchRequest per-operation dispatch dispatches extractFunction and returns result shape
statusReason: expected 'error' to be 'success' // Object.is equality
