[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:34:10
   const resolvingProgram = program as ProgramWithResolvedModule;
   const closed = new Set<string>();
   const pending = [...roots];
-  while (pending.length > 0) {
+  while (false) {
     // biome-ignore lint/style/noNonNullAssertion: guarded by the length check above
     const filePath = pending.pop()!;
statusReason: expected { diagnostics: [], …(4) } to deeply equal { diagnostics: [], …(4) }

[Killed] EqualityOperator
src/ts-engine/type-check-scope.ts:34:10
   const resolvingProgram = program as ProgramWithResolvedModule;
   const closed = new Set<string>();
   const pending = [...roots];
-  while (pending.length > 0) {
+  while (pending.length <= 0) {
     // biome-ignore lint/style/noNonNullAssertion: guarded by the length check above
     const filePath = pending.pop()!;
statusReason: expected { diagnostics: [], …(4) } to deeply equal { diagnostics: [], …(4) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:41:13
     // before either copy is popped. The push below independently refuses anything already
     // closed, so dropping this changes no output — which is why no black-box test can
     // pin it, and why it is not the thing keeping a cycle from looping forever.
-    if (closed.has(filePath)) continue;
+    if (clostrue) continue;
     closed.add(filePath);
     const sourceFile = program.getSourceFile(filePath) as SourceFileWithImports | undefined;
statusReason: expected { diagnostics: [], …(4) } to deeply equal { diagnostics: [], …(4) }

[Survived] ConditionalExpression
src/ts-engine/type-check-scope.ts:41:13
     // before either copy is popped. The push below independently refuses anything already
     // closed, so dropping this changes no output — which is why no black-box test can
     // pin it, and why it is not the thing keeping a cycle from looping forever.
-    if (closed.has(filePath)) continue;
+    if (closfalse) continue;
     closed.add(filePath);
     const sourceFile = program.getSourceFile(filePath) as SourceFileWithImports | undefined;

[Killed] CallExpression
src/ts-engine/type-check-scope.ts:42:5
     // closed, so dropping this changes no output — which is why no black-box test can
     // pin it, and why it is not the thing keeping a cycle from looping forever.
     if (closed.has(filePath)) continue;
-    closed.add(filePath);
+    ;
     const sourceFile = program.getSourceFile(filePath) as SourceFileWithImports | undefined;
     if (!sourceFile) continue;
statusReason: expected { diagnostics: [], …(4) } to deeply equal { diagnostics: [], …(4) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:44:9
     if (closed.has(filePath)) continue;
     closed.add(filePath);
     const sourceFile = program.getSourceFile(filePath) as SourceFileWithImports | undefined;
-    if (!sourceFile) continue;
+    if (false) continue;
     for (const specifier of sourceFile.imports) {
       const mode = program.getModeForUsageLocation(sourceFile, specifier);
killedBy: typeCheckedFiles closing over imports skips resolving a seed path the program does not contain, without throwing
statusReason: Cannot read properties of undefined (reading 'imports')

[Killed] BooleanLiteral
src/ts-engine/type-check-scope.ts:44:9
     if (closed.has(filePath)) continue;
     closed.add(filePath);
     const sourceFile = program.getSourceFile(filePath) as SourceFileWithImports | undefined;
-    if (!sourceFile) continue;
+    if (sourceFile) continue;
     for (const specifier of sourceFile.imports) {
       const mode = program.getModeForUsageLocation(sourceFile, specifier);
killedBy: getTypeErrors scenarios a Vue project-wide check still reports an error in a file outside include that an included file imports
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] OptionalChaining
src/ts-engine/type-check-scope.ts:50:32
       // The first `?.` is belt-and-braces: for a specifier taken from this file's own
       // `imports`, the call always returns an object, carrying `resolvedModule: undefined`
       // when resolution failed. The second is the one that does the work.
-      const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)
-        ?.resolvedModule?.resolvedFileName;
+      const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)?.resolvedModule.resolvedFileName;
       if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {
         pending.push(resolvedFileName);
killedBy: getTypeErrors scenarios a Vue project-wide check still reports an error in a file outside include that an included file imports
statusReason: 

response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Survived] OptionalChaining
src/ts-engine/type-check-scope.ts:50:32
       // The first `?.` is belt-and-braces: for a specifier taken from this file's own
       // `imports`, the call always returns an object, carrying `resolvedModule: undefined`
       // when resolution failed. The second is the one that does the work.
-      const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)
-        ?.resolvedModule?.resolvedFileName;
+      const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode).resolvedModule?.resolvedFileName;
       if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {
         pending.push(resolvedFileName);

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:52:76
       // when resolution failed. The second is the one that does the work.
       const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)
         ?.resolvedModule?.resolvedFileName;
-      if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {
-        pending.push(resolvedFileName);
-      }
+      if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {}
     }
   }
killedBy: getTypeErrors scenarios a Vue project-wide check still reports an error in a file outside include that an included file imports
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:52:11
       // when resolution failed. The second is the one that does the work.
       const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)
         ?.resolvedModule?.resolvedFileName;
-      if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {
+      if (false) {
         pending.push(resolvedFileName);
       }
killedBy: getTypeErrors scenarios a Vue project-wide check still reports an error in a file outside include that an included file imports
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] CallExpression
src/ts-engine/type-check-scope.ts:53:9
       const resolvedFileName = resolvingProgram.getResolvedModule(sourceFile, specifier.text, mode)
         ?.resolvedModule?.resolvedFileName;
       if (resolvedFileName !== undefined && !closed.has(resolvedFileName)) {
-        pending.push(resolvedFileName);
+        ;
       }
     }
killedBy: getTypeErrors scenarios a Vue project-wide check still reports an error in a file outside include that an included file imports
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:78:16
   seedFiles: Iterable<string> | null,
   walkedFiles: Iterable<string>,
   program: ts.Program,
-): Set<string> {
-  return seedFiles === null ? new Set(walkedFiles) : closeOverImports(seedFiles, program);
-}
+): Set<string> {}
 
 const MAX_OTHER_CONFIGS = 10;
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:79:10
   walkedFiles: Iterable<string>,
   program: ts.Program,
 ): Set<string> {
-  return seedFiles === null ? new Set(walkedFiles) : closeOverImports(seedFiles, program);
+  return true ? new Set(walkedFiles) : closeOverImports(seedFiles, program);
 }
 
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] EqualityOperator
src/ts-engine/type-check-scope.ts:79:10
   walkedFiles: Iterable<string>,
   program: ts.Program,
 ): Set<string> {
-  return seedFiles === null ? new Set(walkedFiles) : closeOverImports(seedFiles, program);
+  return seedFiles !== null ? new Set(walkedFiles) : closeOverImports(seedFiles, program);
 }
 
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:98:79
  * from inside some `node_modules` directory, so this one check excludes both — but a caller
  * asking "how much of my code did you look at" isn't asking about either.
  */
-function isOwnWorkspaceFile(filePath: string, workspaceRoot: string): boolean {
-  const relative = path.relative(path.resolve(workspaceRoot), path.resolve(filePath));
-  // `path.relative` only returns an absolute path when the two inputs share no common
-  // base (e.g. different drive letters on Windows) — unreachable on POSIX, where both
-  // sides are always resolved under `/`.
-  const underRoot = relative !== "" && !relative.startsWith("..") && !path.isAbsolute(relative);
-  return underRoot && !filePath.includes("/node_modules/");
-}
+function isOwnWorkspaceFile(filePath: string, workspaceRoot: string): boolean {}
 
 /** Other `tsconfig*.json` files at `workspaceRoot` itself, excluding `usedConfigPath`. Non-recursive. */
killedBy: describeCheckedScope workspace-file classification excludes the workspace root path itself from the checked count
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/type-check-scope.ts:103:70
   // `path.relative` only returns an absolute path when the two inputs share no common
   // base (e.g. different drive letters on Windows) — unreachable on POSIX, where both
   // sides are always resolved under `/`.
-  const underRoot = relative !== "" && !relative.startsWith("..") && !path.isAbsolute(relative);
+  const underRoot = relative !== "" && !relative.startsWith("..") && path.isAbsolute(relative);
   return underRoot && !filePath.includes("/node_modules/");
 }
killedBy: describeCheckedScope workspace-file classification excludes the workspace root path itself from the checked count
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:103:21
   // `path.relative` only returns an absolute path when the two inputs share no common
   // base (e.g. different drive letters on Windows) — unreachable on POSIX, where both
   // sides are always resolved under `/`.
-  const underRoot = relative !== "" && !relative.startsWith("..") && !path.isAbsolute(relative);
+  const underRoot = true;
   return underRoot && !filePath.includes("/node_modules/");
 }
killedBy: describeCheckedScope workspace-file classification excludes the workspace root path itself from the checked count
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:104:10
   // base (e.g. different drive letters on Windows) — unreachable on POSIX, where both
   // sides are always resolved under `/`.
   const underRoot = relative !== "" && !relative.startsWith("..") && !path.isAbsolute(relative);
-  return underRoot && !filePath.includes("/node_modules/");
+  return false;
 }
 
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:104:10
   // base (e.g. different drive letters on Windows) — unreachable on POSIX, where both
   // sides are always resolved under `/`.
   const underRoot = relative !== "" && !relative.startsWith("..") && !path.isAbsolute(relative);
-  return underRoot && !filePath.includes("/node_modules/");
+  return true;
 }
 
killedBy: getTypeErrors scenarios a project-wide check reports an error in a dependency's own type declarations when skipLibCheck is off
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:112:13
   workspaceRoot: string,
   usedConfigPath: string | null,
   fs: FileSystem,
-): string[] {
-  const usedResolved = usedConfigPath ? path.resolve(usedConfigPath) : null;
-  let entries: ReturnType<FileSystem["readdir"]>;
-  try {
-    entries = fs.readdir(workspaceRoot);
-  } catch {
-    return [];
-  }
-  return entries
-    .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
-    .map((entry) => path.resolve(workspaceRoot, entry.name))
-    .filter((abs) => abs !== usedResolved)
-    .sort()
-    .slice(0, MAX_OTHER_CONFIGS);
-}
+): string[] {}
 
 /**
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:115:7
 ): string[] {
   const usedResolved = usedConfigPath ? path.resolve(usedConfigPath) : null;
   let entries: ReturnType<FileSystem["readdir"]>;
-  try {
-    entries = fs.readdir(workspaceRoot);
-  } catch {
+  try {} catch {
     return [];
   }
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:117:11
   let entries: ReturnType<FileSystem["readdir"]>;
   try {
     entries = fs.readdir(workspaceRoot);
-  } catch {
-    return [];
-  }
+  } catch {}
   return entries
     .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
src/ts-engine/type-check-scope.ts:120:10
   } catch {
     return [];
   }
-  return entries
-    .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
-    .map((entry) => path.resolve(workspaceRoot, entry.name))
-    .filter((abs) => abs !== usedResolved)
-    .sort()
+  return entries.filter(entry => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name)).map(entry => path.resolve(workspaceRoot, entry.name)).filter(abs => abs !== usedResolved)
     .slice(0, MAX_OTHER_CONFIGS);
 }
killedBy: describeCheckedScope other configs at the workspace root returns at most the configured cap, sorted from all sibling configs
statusReason: expected [ '/workspace/tsconfig.l.json', …(9) ] to deeply equal [ '/workspace/tsconfig.a.json', …(9) ]

[Killed] MethodExpression
src/ts-engine/type-check-scope.ts:120:10
   } catch {
     return [];
   }
-  return entries
-    .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
-    .map((entry) => path.resolve(workspaceRoot, entry.name))
-    .filter((abs) => abs !== usedResolved)
-    .sort()
-    .slice(0, MAX_OTHER_CONFIGS);
+  return entries.filter(entry => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name)).map(entry => path.resolve(workspaceRoot, entry.name)).filter(abs => abs !== usedResolved).sort();
 }
 
killedBy: describeCheckedScope other configs at the workspace root returns at most the configured cap, sorted from all sibling configs
statusReason: expected [ '/workspace/tsconfig.a.json', …(11) ] to deeply equal [ '/workspace/tsconfig.a.json', …(9) ]

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:121:24
     return [];
   }
   return entries
-    .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
+    .filter((entry) => false)
     .map((entry) => path.resolve(workspaceRoot, entry.name))
     .filter((abs) => abs !== usedResolved)
killedBy: getTypeErrors scenarios a project-wide check names the sibling tsconfig covering an excluded file
statusReason: tsconfig.test.json covers tests/, but get-type-errors with no tsconfig argument answers for tsconfig.json alone — the excluded file's own config is named in otherConfigs rather than silently checked too.


response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:121:24
     return [];
   }
   return entries
-    .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
+    .filter((entry) => true)
     .map((entry) => path.resolve(workspaceRoot, entry.name))
     .filter((abs) => abs !== usedResolved)
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ArrowFunction
src/ts-engine/type-check-scope.ts:122:10
   }
   return entries
     .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
-    .map((entry) => path.resolve(workspaceRoot, entry.name))
+    .map(() => undefined)
     .filter((abs) => abs !== usedResolved)
     .sort()
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] EqualityOperator
src/ts-engine/type-check-scope.ts:123:22
   return entries
     .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
     .map((entry) => path.resolve(workspaceRoot, entry.name))
-    .filter((abs) => abs !== usedResolved)
+    .filter((abs) => abs === usedResolved)
     .sort()
     .slice(0, MAX_OTHER_CONFIGS);
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:123:22
   return entries
     .filter((entry) => entry.isFile() && /^tsconfig.*\.json$/.test(entry.name))
     .map((entry) => path.resolve(workspaceRoot, entry.name))
-    .filter((abs) => abs !== usedResolved)
+    .filter((abs) => true)
     .sort()
     .slice(0, MAX_OTHER_CONFIGS);
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] BlockStatement
src/ts-engine/type-check-scope.ts:142:17
   tsConfigPath: string | null,
   workspaceRoot: string,
   fs: FileSystem = defaultFs,
-): CheckedScope {
-  const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
-  const uncheckedCount = [...walkedFiles].filter(
-    (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
-  ).length;
-  return {
-    checked: { files: checkedCount, tsconfig: tsConfigPath },
-    unchecked: {
-      files: uncheckedCount,
-      reason: tsConfigPath ? `outside ${tsConfigPath}` : "no tsconfig",
-      otherConfigs: findOtherConfigs(workspaceRoot, tsConfigPath, fs),
-    },
-  };
-}
+): CheckedScope {}
 
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(3) } to deeply equal { status: 'success', …(5) }

[Killed] MethodExpression
src/ts-engine/type-check-scope.ts:143:24
   workspaceRoot: string,
   fs: FileSystem = defaultFs,
 ): CheckedScope {
-  const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
+  const checkedCount = [...checkedFiles].length;
   const uncheckedCount = [...walkedFiles].filter(
     (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
killedBy: getTypeErrors scenarios a project-wide check reports an error in a dependency's own type declarations when skipLibCheck is off
statusReason: 

response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ArrowFunction
src/ts-engine/type-check-scope.ts:143:49
   workspaceRoot: string,
   fs: FileSystem = defaultFs,
 ): CheckedScope {
-  const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
+  const checkedCount = [...checkedFiles].filter(() => undefined).length;
   const uncheckedCount = [...walkedFiles].filter(
     (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] MethodExpression
src/ts-engine/type-check-scope.ts:144:26
   fs: FileSystem = defaultFs,
 ): CheckedScope {
   const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
-  const uncheckedCount = [...walkedFiles].filter(
-    (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
-  ).length;
+  const uncheckedCount = [...walkedFiles].length;
   return {
     checked: { files: checkedCount, tsconfig: tsConfigPath },
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] LogicalOperator
src/ts-engine/type-check-scope.ts:145:12
 ): CheckedScope {
   const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
   const uncheckedCount = [...walkedFiles].filter(
-    (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
+    (f) => isOwnWorkspaceFile(f, workspaceRoot) || !checkedFiles.has(f),
   ).length;
   return {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ConditionalExpression
src/ts-engine/type-check-scope.ts:145:12
 ): CheckedScope {
   const checkedCount = [...checkedFiles].filter((f) => isOwnWorkspaceFile(f, workspaceRoot)).length;
   const uncheckedCount = [...walkedFiles].filter(
-    (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
+    (f) => true,
   ).length;
   return {
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }

[Killed] ObjectLiteral
src/ts-engine/type-check-scope.ts:148:14
     (f) => isOwnWorkspaceFile(f, workspaceRoot) && !checkedFiles.has(f),
   ).length;
   return {
-    checked: { files: checkedCount, tsconfig: tsConfigPath },
+    checked: {},
     unchecked: {
       files: uncheckedCount,
killedBy: getTypeErrors scenarios a project-wide check reports nothing for an error outside the tsconfig's include
statusReason: response: expected { status: 'success', …(5) } to deeply equal { status: 'success', …(5) }
