[Killed] BlockStatement
src/daemon/self-write-ledger.ts:28:59
 export function createSelfWriteLedger(fs: FileSystem): SelfWriteLedger {
   const entries = new Map<string, LedgerEntry>();
 
-  function record(path: string, entry: LedgerEntry): void {
-    entries.delete(path); // re-insert at the end so eviction order tracks recency
-    entries.set(path, entry);
-    if (entries.size > MAX_ENTRIES) {
-      const oldest = entries.keys().next().value;
-      if (oldest !== undefined) entries.delete(oldest);
-    }
-  }
+  function record(path: string, entry: LedgerEntry): void {}
 
   return {
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/daemon/self-write-ledger.ts:29:5
   const entries = new Map<string, LedgerEntry>();
 
   function record(path: string, entry: LedgerEntry): void {
-    entries.delete(path); // re-insert at the end so eviction order tracks recency
+    ; // re-insert at the end so eviction order tracks recency
     entries.set(path, entry);
     if (entries.size > MAX_ENTRIES) {
killedBy: self-write ledger bounded size treats a re-recorded path as the newest, so eviction does not reclaim it
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/self-write-ledger.ts:30:5
 
   function record(path: string, entry: LedgerEntry): void {
     entries.delete(path); // re-insert at the end so eviction order tracks recency
-    entries.set(path, entry);
+    ;
     if (entries.size > MAX_ENTRIES) {
       const oldest = entries.keys().next().value;
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:31:9
   function record(path: string, entry: LedgerEntry): void {
     entries.delete(path); // re-insert at the end so eviction order tracks recency
     entries.set(path, entry);
-    if (entries.size > MAX_ENTRIES) {
+    if (true) {
       const oldest = entries.keys().next().value;
       if (oldest !== undefined) entries.delete(oldest);
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:31:37
   function record(path: string, entry: LedgerEntry): void {
     entries.delete(path); // re-insert at the end so eviction order tracks recency
     entries.set(path, entry);
-    if (entries.size > MAX_ENTRIES) {
-      const oldest = entries.keys().next().value;
-      if (oldest !== undefined) entries.delete(oldest);
-    }
+    if (entries.size > MAX_ENTRIES) {}
   }
 
killedBy: self-write ledger bounded size evicts the oldest entry once the cap is exceeded, keeping the newest
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/self-write-ledger.ts:33:33
     entries.set(path, entry);
     if (entries.size > MAX_ENTRIES) {
       const oldest = entries.keys().next().value;
-      if (oldest !== undefined) entries.delete(oldest);
+      if (oldest !== undefined) ;
     }
   }
killedBy: self-write ledger bounded size evicts the oldest entry once the cap is exceeded, keeping the newest
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:33:11
     entries.set(path, entry);
     if (entries.size > MAX_ENTRIES) {
       const oldest = entries.keys().next().value;
-      if (oldest !== undefined) entries.delete(oldest);
+      if (false) entries.delete(oldest);
     }
   }
killedBy: self-write ledger bounded size evicts the oldest entry once the cap is exceeded, keeping the newest
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:38:37
   }
 
   return {
-    recordWrite(path: string): void {
-      let mtimeMs: number;
-      try {
-        ({ mtimeMs } = fs.stat(path));
-      } catch {
-        // The path is already gone by the time we could stamp it. Leaving it
-        // unrecorded means the next event for it invalidates rather than
-        // being suppressed on the strength of a stamp that was never taken.
-        return;
-      }
-      record(path, { kind: "write", mtimeMs });
-    },
+    recordWrite(path: string): void {},
 
     recordRemoval(path: string): void {
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:40:11
   return {
     recordWrite(path: string): void {
       let mtimeMs: number;
-      try {
-        ({ mtimeMs } = fs.stat(path));
-      } catch {
+      try {} catch {
         // The path is already gone by the time we could stamp it. Leaving it
         // unrecorded means the next event for it invalidates rather than
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/daemon/self-write-ledger.ts:42:15
       let mtimeMs: number;
       try {
         ({ mtimeMs } = fs.stat(path));
-      } catch {
-        // The path is already gone by the time we could stamp it. Leaving it
-        // unrecorded means the next event for it invalidates rather than
-        // being suppressed on the strength of a stamp that was never taken.
-        return;
-      }
+      } catch {}
       record(path, { kind: "write", mtimeMs });
     },

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:51:39
       record(path, { kind: "write", mtimeMs });
     },
 
-    recordRemoval(path: string): void {
-      record(path, { kind: "removal" });
-    },
+    recordRemoval(path: string): void {},
 
     shouldSuppress(path: string): boolean {
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/daemon/self-write-ledger.ts:52:20
     },
 
     recordRemoval(path: string): void {
-      record(path, { kind: "removal" });
+      record(path, {});
     },
 
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:55:43
       record(path, { kind: "removal" });
     },
 
-    shouldSuppress(path: string): boolean {
-      const entry = entries.get(path);
-      if (!entry) return false;
-
-      if (entry.kind === "removal") {
-        if (fs.exists(path)) return false;
-        entries.delete(path);
-        return true;
-      }
-
-      let currentMtimeMs: number;
-      try {
-        ({ mtimeMs: currentMtimeMs } = fs.stat(path));
-      } catch {
-        // Recorded as written but now unreadable — something else removed
-        // it, so this event is not the daemon's own write.
-        return false;
-      }
-      if (currentMtimeMs !== entry.mtimeMs) return false;
-      entries.delete(path);
-      return true;
-    },
+    shouldSuppress(path: string): boolean {},
   };
 }
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:57:11
 
     shouldSuppress(path: string): boolean {
       const entry = entries.get(path);
-      if (!entry) return false;
+      if (true) return false;
 
       if (entry.kind === "removal") {
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/daemon/self-write-ledger.ts:57:11
 
     shouldSuppress(path: string): boolean {
       const entry = entries.get(path);
-      if (!entry) return false;
+      if (entry) return false;
 
       if (entry.kind === "removal") {
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:59:11
       const entry = entries.get(path);
       if (!entry) return false;
 
-      if (entry.kind === "removal") {
+      if (false) {
         if (fs.exists(path)) return false;
         entries.delete(path);
killedBy: self-write ledger recording a removal suppresses an event for a path that is still absent
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:59:11
       const entry = entries.get(path);
       if (!entry) return false;
 
-      if (entry.kind === "removal") {
+      if (true) {
         if (fs.exists(path)) return false;
         entries.delete(path);
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/daemon/self-write-ledger.ts:60:37
       if (!entry) return false;
 
       if (entry.kind === "removal") {
-        if (fs.exists(path)) return false;
+        if (fs.exists(path)) return true;
         entries.delete(path);
         return true;
killedBy: self-write ledger recording a removal does not suppress when the path exists again by the time the event arrives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/daemon/self-write-ledger.ts:60:13
       if (!entry) return false;
 
       if (entry.kind === "removal") {
-        if (fs.exists(path)) return false;
+        if (false) return false;
         entries.delete(path);
         return true;
killedBy: self-write ledger recording a removal does not suppress when the path exists again by the time the event arrives
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/daemon/self-write-ledger.ts:61:9
 
       if (entry.kind === "removal") {
         if (fs.exists(path)) return false;
-        entries.delete(path);
+        ;
         return true;
       }
killedBy: self-write ledger recording a removal consumes the entry once matched, so a second removal check no longer suppresses
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/daemon/self-write-ledger.ts:62:16
       if (entry.kind === "removal") {
         if (fs.exists(path)) return false;
         entries.delete(path);
-        return true;
+        return false;
       }
 
killedBy: self-write ledger recording a removal suppresses an event for a path that is still absent
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/daemon/self-write-ledger.ts:66:11
       }
 
       let currentMtimeMs: number;
-      try {
-        ({ mtimeMs: currentMtimeMs } = fs.stat(path));
-      } catch {
+      try {} catch {
         // Recorded as written but now unreadable — something else removed
         // it, so this event is not the daemon's own write.
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/daemon/self-write-ledger.ts:68:15
       let currentMtimeMs: number;
       try {
         ({ mtimeMs: currentMtimeMs } = fs.stat(path));
-      } catch {
-        // Recorded as written but now unreadable — something else removed
-        // it, so this event is not the daemon's own write.
-        return false;
-      }
+      } catch {}
       if (currentMtimeMs !== entry.mtimeMs) return false;
       entries.delete(path);

[Killed] BooleanLiteral
src/daemon/self-write-ledger.ts:71:16
       } catch {
         // Recorded as written but now unreadable — something else removed
         // it, so this event is not the daemon's own write.
-        return false;
+        return true;
       }
       if (currentMtimeMs !== entry.mtimeMs) return false;
killedBy: self-write ledger recording a write does not suppress when the recorded path is later removed rather than rewritten
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/daemon/self-write-ledger.ts:73:52
         // it, so this event is not the daemon's own write.
         return false;
       }
-      if (currentMtimeMs !== entry.mtimeMs) return false;
+      if (currentMtimeMs !== entry.mtimeMs) return true;
       entries.delete(path);
       return true;
killedBy: self-write ledger recording a write does not suppress once the file has been written again after the recorded stamp
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/daemon/self-write-ledger.ts:73:11
         // it, so this event is not the daemon's own write.
         return false;
       }
-      if (currentMtimeMs !== entry.mtimeMs) return false;
+      if (currentMtimeMs === entry.mtimeMs) return false;
       entries.delete(path);
       return true;
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/daemon/self-write-ledger.ts:74:7
         return false;
       }
       if (currentMtimeMs !== entry.mtimeMs) return false;
-      entries.delete(path);
+      ;
       return true;
     },
killedBy: self-write ledger recording a write consumes the entry once matched, so a second check on the same untouched file no longer suppresses
statusReason: expected true to be false // Object.is equality
