[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:18:34
   private readonly mtimes = new Map<string, number>();
   private mtimeCounter = 0;
 
-  readFile(path: string): string {
-    if (!this.store.has(path)) {
-      throw new Error(`ENOENT: no such file or directory: '${path}'`);
-    }
-    return this.store.get(path) as string;
-  }
+  readFile(path: string): string {}
 
   writeFile(path: string, content: string): void {
killedBy: ImportRewriter full-move: all named imports match repoints the module specifier to the new destination
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:19:9
   private mtimeCounter = 0;
 
   readFile(path: string): string {
-    if (!this.store.has(path)) {
+    if (true) {
       throw new Error(`ENOENT: no such file or directory: '${path}'`);
     }
killedBy: ImportRewriter full-move: all named imports match repoints the module specifier to the new destination
statusReason: ENOENT: no such file or directory: '/project/src/consumer.ts'

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:19:32
   private mtimeCounter = 0;
 
   readFile(path: string): string {
-    if (!this.store.has(path)) {
-      throw new Error(`ENOENT: no such file or directory: '${path}'`);
-    }
+    if (!this.store.has(path)) {}
     return this.store.get(path) as string;
   }
killedBy: InMemoryFileSystem writeFile and readFile throws when reading a non-existent file
statusReason: expected [Function] to throw an error

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:20:7
 
   readFile(path: string): string {
     if (!this.store.has(path)) {
-      throw new Error(`ENOENT: no such file or directory: '${path}'`);
+      ;
     }
     return this.store.get(path) as string;
killedBy: InMemoryFileSystem writeFile and readFile throws when reading a non-existent file
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:25:50
     return this.store.get(path) as string;
   }
 
-  writeFile(path: string, content: string): void {
-    this.store.set(path, content);
-    this.touch(path);
-  }
+  writeFile(path: string, content: string): void {}
 
   exists(path: string): boolean {
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:26:5
   }
 
   writeFile(path: string, content: string): void {
-    this.store.set(path, content);
+    ;
     this.touch(path);
   }
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:27:5
 
   writeFile(path: string, content: string): void {
     this.store.set(path, content);
-    this.touch(path);
+    ;
   }
 
killedBy: self-write ledger recording a write does not suppress once the file has been written again after the recorded stamp
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:30:33
     this.touch(path);
   }
 
-  exists(path: string): boolean {
-    if (this.store.has(path)) return true;
-    const prefix = path.endsWith("/") ? path : `${path}/`;
-    for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
-    }
-    return false;
-  }
+  exists(path: string): boolean {}
 
   mkdir(path: string, _options?: { recursive?: boolean }): void {
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:31:9
   }
 
   exists(path: string): boolean {
-    if (this.store.has(path)) return true;
+    if (true) return true;
     const prefix = path.endsWith("/") ? path : `${path}/`;
     for (const key of this.store.keys()) {
killedBy: self-write ledger recording a write records nothing when the path has already vanished by the time it is stamped
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:31:9
   }
 
   exists(path: string): boolean {
-    if (this.store.has(path)) return true;
+    if (false) return true;
     const prefix = path.endsWith("/") ? path : `${path}/`;
     for (const key of this.store.keys()) {
killedBy: self-write ledger recording a write suppresses an event for a path whose mtime still matches the recorded stamp
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:32:20
 
   exists(path: string): boolean {
     if (this.store.has(path)) return true;
-    const prefix = path.endsWith("/") ? path : `${path}/`;
+    const prefix = path.startsWith("/") ? path : `${path}/`;
     for (const key of this.store.keys()) {
       if (key.startsWith(prefix)) return true;
killedBy: InMemoryFileSystem exists returns false for a directory-like path when no child keys share that prefix
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:33:42
   exists(path: string): boolean {
     if (this.store.has(path)) return true;
     const prefix = path.endsWith("/") ? path : `${path}/`;
-    for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
-    }
+    for (const key of this.store.keys()) {}
     return false;
   }
killedBy: InMemoryFileSystem mkdir creates a directory that exists can confirm
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:34:11
     if (this.store.has(path)) return true;
     const prefix = path.endsWith("/") ? path : `${path}/`;
     for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
+      if (true) return true;
     }
     return false;
killedBy: InMemoryFileSystem rename moves the file to the new path and removes the source
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:34:11
     if (this.store.has(path)) return true;
     const prefix = path.endsWith("/") ? path : `${path}/`;
     for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
+      if (key.endsWith(prefix)) return true;
     }
     return false;
killedBy: InMemoryFileSystem stat treats a path as a directory when a child key exists under it
statusReason: ENOENT: no such file or directory, stat '/project/src'

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:39:65
     return false;
   }
 
-  mkdir(path: string, _options?: { recursive?: boolean }): void {
-    const marker = path.endsWith("/") ? path : `${path}/`;
-    this.store.set(marker, "");
-    this.touch(marker);
-  }
+  mkdir(path: string, _options?: { recursive?: boolean }): void {}
 
   rename(oldPath: string, newPath: string): void {
killedBy: InMemoryFileSystem mkdir creates a directory that exists can confirm
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:40:20
   }
 
   mkdir(path: string, _options?: { recursive?: boolean }): void {
-    const marker = path.endsWith("/") ? path : `${path}/`;
+    const marker = path.startsWith("/") ? path : `${path}/`;
     this.store.set(marker, "");
     this.touch(marker);
killedBy: InMemoryFileSystem stat reports a created directory as a directory
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:41:5
 
   mkdir(path: string, _options?: { recursive?: boolean }): void {
     const marker = path.endsWith("/") ? path : `${path}/`;
-    this.store.set(marker, "");
+    ;
     this.touch(marker);
   }
killedBy: InMemoryFileSystem mkdir creates a directory that exists can confirm
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:42:5
   mkdir(path: string, _options?: { recursive?: boolean }): void {
     const marker = path.endsWith("/") ? path : `${path}/`;
     this.store.set(marker, "");
-    this.touch(marker);
+    ;
   }
 
killedBy: InMemoryFileSystem mkdir stamps the created directory with a positive mtimeMs, queryable without a trailing slash
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:45:50
     this.touch(marker);
   }
 
-  rename(oldPath: string, newPath: string): void {
-    if (this.store.has(oldPath)) {
-      const content = this.store.get(oldPath) as string;
-      this.store.delete(oldPath);
-      this.mtimes.delete(oldPath);
-      this.store.set(newPath, content);
-      this.touch(newPath);
-      return;
-    }
-    if (this.isDirectory(oldPath)) {
-      this.renameDirectory(oldPath, newPath);
-      return;
-    }
-    throw new Error(`ENOENT: no such file or directory: '${oldPath}'`);
-  }
+  rename(oldPath: string, newPath: string): void {}
 
   /**
killedBy: InMemoryFileSystem rename moves the file to the new path and removes the source
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:46:34
   }
 
   rename(oldPath: string, newPath: string): void {
-    if (this.store.has(oldPath)) {
-      const content = this.store.get(oldPath) as string;
-      this.store.delete(oldPath);
-      this.mtimes.delete(oldPath);
-      this.store.set(newPath, content);
-      this.touch(newPath);
-      return;
-    }
+    if (this.store.has(oldPath)) {}
     if (this.isDirectory(oldPath)) {
       this.renameDirectory(oldPath, newPath);
killedBy: InMemoryFileSystem rename moves the file to the new path and removes the source
statusReason: ENOENT: no such file or directory: '/workspace/src.txt'

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:46:9
   }
 
   rename(oldPath: string, newPath: string): void {
-    if (this.store.has(oldPath)) {
+    if (true) {
       const content = this.store.get(oldPath) as string;
       this.store.delete(oldPath);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:48:7
   rename(oldPath: string, newPath: string): void {
     if (this.store.has(oldPath)) {
       const content = this.store.get(oldPath) as string;
-      this.store.delete(oldPath);
+      ;
       this.mtimes.delete(oldPath);
       this.store.set(newPath, content);
killedBy: InMemoryFileSystem rename moves the file to the new path and removes the source
statusReason: expected true to be false // Object.is equality

[Survived] CallExpression
src/ports/in-memory-filesystem.ts:49:7
     if (this.store.has(oldPath)) {
       const content = this.store.get(oldPath) as string;
       this.store.delete(oldPath);
-      this.mtimes.delete(oldPath);
+      ;
       this.store.set(newPath, content);
       this.touch(newPath);

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:50:7
       const content = this.store.get(oldPath) as string;
       this.store.delete(oldPath);
       this.mtimes.delete(oldPath);
-      this.store.set(newPath, content);
+      ;
       this.touch(newPath);
       return;
killedBy: InMemoryFileSystem rename moves the file to the new path and removes the source
statusReason: ENOENT: no such file or directory: '/workspace/dst.txt'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:51:7
       this.store.delete(oldPath);
       this.mtimes.delete(oldPath);
       this.store.set(newPath, content);
-      this.touch(newPath);
+      ;
       return;
     }
killedBy: InMemoryFileSystem rename stamps the destination with a fresh mtimeMs greater than the source's original stamp
statusReason: expected 0 to be greater than 1

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:54:9
       this.touch(newPath);
       return;
     }
-    if (this.isDirectory(oldPath)) {
+    if (false) {
       this.renameDirectory(oldPath, newPath);
       return;
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/movedir'

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:54:36
       this.touch(newPath);
       return;
     }
-    if (this.isDirectory(oldPath)) {
-      this.renameDirectory(oldPath, newPath);
-      return;
-    }
+    if (this.isDirectory(oldPath)) {}
     throw new Error(`ENOENT: no such file or directory: '${oldPath}'`);
   }
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/movedir'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:55:7
       return;
     }
     if (this.isDirectory(oldPath)) {
-      this.renameDirectory(oldPath, newPath);
+      ;
       return;
     }
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:58:5
       this.renameDirectory(oldPath, newPath);
       return;
     }
-    throw new Error(`ENOENT: no such file or directory: '${oldPath}'`);
+    ;
   }
 
killedBy: InMemoryFileSystem rename throws when the source path does not exist
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:68:67
    * so it moves with everything else; a directory inferred from its children
    * has no marker and needs none, because the moved children still imply it.
    */
-  private renameDirectory(oldPath: string, newPath: string): void {
-    const oldPrefix = oldPath.endsWith("/") ? oldPath : `${oldPath}/`;
-    const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
-
-    for (const key of [...this.store.keys()]) {
-      if (!key.startsWith(oldPrefix)) continue;
-      const moved = newPrefix + key.slice(oldPrefix.length);
-      this.store.set(moved, this.store.get(key) as string);
-      this.store.delete(key);
-      this.mtimes.delete(key);
-      this.touch(moved);
-    }
-  }
+  private renameDirectory(oldPath: string, newPath: string): void {}
 
   unlink(path: string): void {
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:69:23
    * has no marker and needs none, because the moved children still imply it.
    */
   private renameDirectory(oldPath: string, newPath: string): void {
-    const oldPrefix = oldPath.endsWith("/") ? oldPath : `${oldPath}/`;
+    const oldPrefix = oldPath.startsWith("/") ? oldPath : `${oldPath}/`;
     const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
 
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:70:23
    */
   private renameDirectory(oldPath: string, newPath: string): void {
     const oldPrefix = oldPath.endsWith("/") ? oldPath : `${oldPath}/`;
-    const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
+    const newPrefix = newPath.startsWith("/") ? newPath : `${newPath}/`;
 
     for (const key of [...this.store.keys()]) {
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:72:47
     const oldPrefix = oldPath.endsWith("/") ? oldPath : `${oldPath}/`;
     const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
 
-    for (const key of [...this.store.keys()]) {
-      if (!key.startsWith(oldPrefix)) continue;
-      const moved = newPrefix + key.slice(oldPrefix.length);
-      this.store.set(moved, this.store.get(key) as string);
-      this.store.delete(key);
-      this.mtimes.delete(key);
-      this.touch(moved);
-    }
+    for (const key of [...this.store.keys()]) {}
   }
 
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:73:12
     const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
 
     for (const key of [...this.store.keys()]) {
-      if (!key.startsWith(oldPrefix)) continue;
+      if (!key.endsWith(oldPrefix)) continue;
       const moved = newPrefix + key.slice(oldPrefix.length);
       this.store.set(moved, this.store.get(key) as string);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] BooleanLiteral
src/ports/in-memory-filesystem.ts:73:11
     const newPrefix = newPath.endsWith("/") ? newPath : `${newPath}/`;
 
     for (const key of [...this.store.keys()]) {
-      if (!key.startsWith(oldPrefix)) continue;
+      if (key.startsWith(oldPrefix)) continue;
       const moved = newPrefix + key.slice(oldPrefix.length);
       this.store.set(moved, this.store.get(key) as string);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:74:33
 
     for (const key of [...this.store.keys()]) {
       if (!key.startsWith(oldPrefix)) continue;
-      const moved = newPrefix + key.slice(oldPrefix.length);
+      const moved = newPrefix + key;
       this.store.set(moved, this.store.get(key) as string);
       this.store.delete(key);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] ArithmeticOperator
src/ports/in-memory-filesystem.ts:74:21
 
     for (const key of [...this.store.keys()]) {
       if (!key.startsWith(oldPrefix)) continue;
-      const moved = newPrefix + key.slice(oldPrefix.length);
+      const moved = newPrefix - key.slice(oldPrefix.length);
       this.store.set(moved, this.store.get(key) as string);
       this.store.delete(key);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:75:7
     for (const key of [...this.store.keys()]) {
       if (!key.startsWith(oldPrefix)) continue;
       const moved = newPrefix + key.slice(oldPrefix.length);
-      this.store.set(moved, this.store.get(key) as string);
+      ;
       this.store.delete(key);
       this.mtimes.delete(key);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: ENOENT: no such file or directory: '/workspace/moved-elsewhere/top.txt'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:76:7
       if (!key.startsWith(oldPrefix)) continue;
       const moved = newPrefix + key.slice(oldPrefix.length);
       this.store.set(moved, this.store.get(key) as string);
-      this.store.delete(key);
+      ;
       this.mtimes.delete(key);
       this.touch(moved);
killedBy: InMemoryFileSystem rename moves a directory's whole subtree, nested files included
statusReason: expected true to be false // Object.is equality

[Survived] CallExpression
src/ports/in-memory-filesystem.ts:77:7
       const moved = newPrefix + key.slice(oldPrefix.length);
       this.store.set(moved, this.store.get(key) as string);
       this.store.delete(key);
-      this.mtimes.delete(key);
+      ;
       this.touch(moved);
     }

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:78:7
       this.store.set(moved, this.store.get(key) as string);
       this.store.delete(key);
       this.mtimes.delete(key);
-      this.touch(moved);
+      ;
     }
   }
killedBy: InMemoryFileSystem rename stamps each file carried along by a directory rename
statusReason: expected 0 to be greater than 1

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:82:30
     }
   }
 
-  unlink(path: string): void {
-    if (!this.store.has(path)) {
-      throw new Error(`ENOENT: no such file or directory: '${path}'`);
-    }
-    this.store.delete(path);
-    this.mtimes.delete(path);
-  }
+  unlink(path: string): void {}
 
   realpath(path: string): string {
killedBy: self-write ledger recording a write does not suppress when the recorded path is later removed rather than rewritten
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:83:32
   }
 
   unlink(path: string): void {
-    if (!this.store.has(path)) {
-      throw new Error(`ENOENT: no such file or directory: '${path}'`);
-    }
+    if (!this.store.has(path)) {}
     this.store.delete(path);
     this.mtimes.delete(path);
killedBy: InMemoryFileSystem unlink throws when unlinking a non-existent file
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:83:9
   }
 
   unlink(path: string): void {
-    if (!this.store.has(path)) {
+    if (true) {
       throw new Error(`ENOENT: no such file or directory: '${path}'`);
     }
killedBy: self-write ledger recording a write does not suppress when the recorded path is later removed rather than rewritten
statusReason: ENOENT: no such file or directory: '/workspace/d.ts'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:86:5
     if (!this.store.has(path)) {
       throw new Error(`ENOENT: no such file or directory: '${path}'`);
     }
-    this.store.delete(path);
+    ;
     this.mtimes.delete(path);
   }
killedBy: InMemoryFileSystem unlink removes a file so it no longer exists
statusReason: expected true to be false // Object.is equality

[Survived] CallExpression
src/ports/in-memory-filesystem.ts:87:5
       throw new Error(`ENOENT: no such file or directory: '${path}'`);
     }
     this.store.delete(path);
-    this.mtimes.delete(path);
+    ;
   }
 

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:90:34
     this.mtimes.delete(path);
   }
 
-  realpath(path: string): string {
-    return path;
-  }
+  realpath(path: string): string {}
 
   resolve(...segments: string[]): string {
killedBy: InMemoryFileSystem realpath returns a non-empty string for an existing file
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:94:42
     return path;
   }
 
-  resolve(...segments: string[]): string {
-    return nodePath.resolve(...segments);
-  }
+  resolve(...segments: string[]): string {}
 
   stat(path: string): { isDirectory(): boolean; mtimeMs: number } {
killedBy: InMemoryFileSystem resolve resolves a single absolute path to itself
statusReason: expected undefined to be '/a/b/c' // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:98:67
     return nodePath.resolve(...segments);
   }
 
-  stat(path: string): { isDirectory(): boolean; mtimeMs: number } {
-    if (!this.exists(path)) {
-      throw new Error(`ENOENT: no such file or directory, stat '${path}'`);
-    }
-    const isDir = this.isDirectory(path);
-    const marker = path.endsWith("/") ? path : `${path}/`;
-    const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
-    return { isDirectory: () => isDir, mtimeMs };
-  }
+  stat(path: string): { isDirectory(): boolean; mtimeMs: number } {}
 
   /**
killedBy: InMemoryFileSystem stat reports a created directory as a directory
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:99:29
   }
 
   stat(path: string): { isDirectory(): boolean; mtimeMs: number } {
-    if (!this.exists(path)) {
-      throw new Error(`ENOENT: no such file or directory, stat '${path}'`);
-    }
+    if (!this.exists(path)) {}
     const isDir = this.isDirectory(path);
     const marker = path.endsWith("/") ? path : `${path}/`;
killedBy: self-write ledger recording a write records nothing when the path has already vanished by the time it is stamped
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:99:9
   }
 
   stat(path: string): { isDirectory(): boolean; mtimeMs: number } {
-    if (!this.exists(path)) {
+    if (true) {
       throw new Error(`ENOENT: no such file or directory, stat '${path}'`);
     }
killedBy: validateWorkspace with InMemoryFileSystem accepts a valid workspace directory
statusReason: ENOENT: no such file or directory, stat '/workspace'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:100:7
 
   stat(path: string): { isDirectory(): boolean; mtimeMs: number } {
     if (!this.exists(path)) {
-      throw new Error(`ENOENT: no such file or directory, stat '${path}'`);
+      ;
     }
     const isDir = this.isDirectory(path);
killedBy: InMemoryFileSystem stat throws when statting a path that does not exist
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:103:20
       throw new Error(`ENOENT: no such file or directory, stat '${path}'`);
     }
     const isDir = this.isDirectory(path);
-    const marker = path.endsWith("/") ? path : `${path}/`;
+    const marker = path.startsWith("/") ? path : `${path}/`;
     const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
     return { isDirectory: () => isDir, mtimeMs };
killedBy: InMemoryFileSystem mkdir stamps the created directory with a positive mtimeMs, queryable without a trailing slash
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/ports/in-memory-filesystem.ts:104:21
     }
     const isDir = this.isDirectory(path);
     const marker = path.endsWith("/") ? path : `${path}/`;
-    const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
+    const mtimeMs = this.mtimes.get(path) && this.mtimes.get(marker) ?? 0;
     return { isDirectory: () => isDir, mtimeMs };
   }
killedBy: InMemoryFileSystem stat reports a finite positive mtimeMs for a freshly written path
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/ports/in-memory-filesystem.ts:104:21
     }
     const isDir = this.isDirectory(path);
     const marker = path.endsWith("/") ? path : `${path}/`;
-    const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
+    const mtimeMs = (this.mtimes.get(path) ?? this.mtimes.get(marker)) && 0;
     return { isDirectory: () => isDir, mtimeMs };
   }
killedBy: InMemoryFileSystem stat reports a finite positive mtimeMs for a freshly written path
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/ports/in-memory-filesystem.ts:105:27
     const isDir = this.isDirectory(path);
     const marker = path.endsWith("/") ? path : `${path}/`;
     const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
-    return { isDirectory: () => isDir, mtimeMs };
+    return { isDirectory: () => undefined, mtimeMs };
   }
 
killedBy: InMemoryFileSystem stat reports a created directory as a directory
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/ports/in-memory-filesystem.ts:105:12
     const isDir = this.isDirectory(path);
     const marker = path.endsWith("/") ? path : `${path}/`;
     const mtimeMs = this.mtimes.get(path) ?? this.mtimes.get(marker) ?? 0;
-    return { isDirectory: () => isDir, mtimeMs };
+    return {};
   }
 
killedBy: InMemoryFileSystem stat reports a created directory as a directory
statusReason: vfs.stat(...).isDirectory is not a function

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:113:37
    * clock — every mutation is a distinct tick, so callers only ever need to
    * compare stamps for ordering, never their magnitude.
    */
-  private touch(path: string): void {
-    this.mtimeCounter += 1;
-    this.mtimes.set(path, this.mtimeCounter);
-  }
+  private touch(path: string): void {}
 
   readdir(path: string): DirEntry[] {
killedBy: InMemoryFileSystem stat reports a finite positive mtimeMs for a freshly written path
statusReason: expected 0 to be greater than 0

[Killed] AssignmentOperator
src/ports/in-memory-filesystem.ts:114:5
    * compare stamps for ordering, never their magnitude.
    */
   private touch(path: string): void {
-    this.mtimeCounter += 1;
+    this.mtimeCounter -= 1;
     this.mtimes.set(path, this.mtimeCounter);
   }
killedBy: InMemoryFileSystem stat reports a finite positive mtimeMs for a freshly written path
statusReason: expected -1 to be greater than 0
