[Killed] CallExpression
src/ports/in-memory-filesystem.ts:115:5
    */
   private touch(path: string): void {
     this.mtimeCounter += 1;
-    this.mtimes.set(path, this.mtimeCounter);
+    ;
   }
 
killedBy: InMemoryFileSystem stat reports a finite positive mtimeMs for a freshly written path
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:118:37
     this.mtimes.set(path, this.mtimeCounter);
   }
 
-  readdir(path: string): DirEntry[] {
-    if (!this.isDirectory(path)) {
-      throw new Error(`ENOTDIR: not a directory: '${path}'`);
-    }
-    const prefix = path.endsWith("/") ? path : `${path}/`;
-    // A child is a directory if any key nests below it (has a further slash),
-    // otherwise a plain file. Collecting into sets keeps this order-independent
-    // and lets directory classification win when a name appears as both.
-    const dirs = new Set<string>();
-    const files = new Set<string>();
-    for (const key of this.store.keys()) {
-      if (!key.startsWith(prefix)) continue;
-      const rest = key.slice(prefix.length);
-      if (rest === "") continue; // the directory's own marker key
-      const slash = rest.indexOf("/");
-      if (slash === -1) files.add(rest);
-      else dirs.add(rest.slice(0, slash));
-    }
-    return [...new Set([...dirs, ...files])].map((name) => {
-      const isDir = dirs.has(name);
-      return { name, isDirectory: () => isDir, isFile: () => !isDir };
-    });
-  }
+  readdir(path: string): DirEntry[] {}
 
   private isDirectory(path: string): boolean {
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:119:9
   }
 
   readdir(path: string): DirEntry[] {
-    if (!this.isDirectory(path)) {
+    if (true) {
       throw new Error(`ENOTDIR: not a directory: '${path}'`);
     }
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: ENOTDIR: not a directory: '/workspace'

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:119:9
   }
 
   readdir(path: string): DirEntry[] {
-    if (!this.isDirectory(path)) {
+    if (false) {
       throw new Error(`ENOTDIR: not a directory: '${path}'`);
     }
killedBy: InMemoryFileSystem readdir throws when the path does not exist
statusReason: expected [Function] to throw an error

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:120:7
 
   readdir(path: string): DirEntry[] {
     if (!this.isDirectory(path)) {
-      throw new Error(`ENOTDIR: not a directory: '${path}'`);
+      ;
     }
     const prefix = path.endsWith("/") ? path : `${path}/`;
killedBy: InMemoryFileSystem readdir throws when the path does not exist
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:122:20
     if (!this.isDirectory(path)) {
       throw new Error(`ENOTDIR: not a directory: '${path}'`);
     }
-    const prefix = path.endsWith("/") ? path : `${path}/`;
+    const prefix = path.startsWith("/") ? path : `${path}/`;
     // A child is a directory if any key nests below it (has a further slash),
     // otherwise a plain file. Collecting into sets keeps this order-independent
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: expected [ '' ] to deeply equal [ 'a.txt', 'b.txt' ]

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:128:42
     // and lets directory classification win when a name appears as both.
     const dirs = new Set<string>();
     const files = new Set<string>();
-    for (const key of this.store.keys()) {
-      if (!key.startsWith(prefix)) continue;
-      const rest = key.slice(prefix.length);
-      if (rest === "") continue; // the directory's own marker key
-      const slash = rest.indexOf("/");
-      if (slash === -1) files.add(rest);
-      else dirs.add(rest.slice(0, slash));
-    }
+    for (const key of this.store.keys()) {}
     return [...new Set([...dirs, ...files])].map((name) => {
       const isDir = dirs.has(name);
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: expected [] to deeply equal [ 'a.txt', 'b.txt' ]

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:129:11
     const dirs = new Set<string>();
     const files = new Set<string>();
     for (const key of this.store.keys()) {
-      if (!key.startsWith(prefix)) continue;
+      if (false) continue;
       const rest = key.slice(prefix.length);
       if (rest === "") continue; // the directory's own marker key
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) walks the in-memory tree when no glob is given
statusReason: expected [ Array(4) ] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] BooleanLiteral
src/ports/in-memory-filesystem.ts:129:11
     const dirs = new Set<string>();
     const files = new Set<string>();
     for (const key of this.store.keys()) {
-      if (!key.startsWith(prefix)) continue;
+      if (key.startsWith(prefix)) continue;
       const rest = key.slice(prefix.length);
       if (rest === "") continue; // the directory's own marker key
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: expected [] to deeply equal [ 'a.txt', 'b.txt' ]

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:130:20
     const files = new Set<string>();
     for (const key of this.store.keys()) {
       if (!key.startsWith(prefix)) continue;
-      const rest = key.slice(prefix.length);
+      const rest = key;
       if (rest === "") continue; // the directory's own marker key
       const slash = rest.indexOf("/");
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: expected [ '' ] to deeply equal [ 'a.txt', 'b.txt' ]

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:131:11
     for (const key of this.store.keys()) {
       if (!key.startsWith(prefix)) continue;
       const rest = key.slice(prefix.length);
-      if (rest === "") continue; // the directory's own marker key
+      if (true) continue; // the directory's own marker key
       const slash = rest.indexOf("/");
       if (slash === -1) files.add(rest);
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) walks the in-memory tree when no glob is given
statusReason: expected [] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:131:11
     for (const key of this.store.keys()) {
       if (!key.startsWith(prefix)) continue;
       const rest = key.slice(prefix.length);
-      if (rest === "") continue; // the directory's own marker key
+      if (false) continue; // the directory's own marker key
       const slash = rest.indexOf("/");
       if (slash === -1) files.add(rest);
killedBy: InMemoryFileSystem readdir returns an empty list for a freshly created directory
statusReason: expected [ { name: '', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
src/ports/in-memory-filesystem.ts:133:11
       const rest = key.slice(prefix.length);
       if (rest === "") continue; // the directory's own marker key
       const slash = rest.indexOf("/");
-      if (slash === -1) files.add(rest);
+      if (true) files.add(rest);
       else dirs.add(rest.slice(0, slash));
     }
killedBy: InMemoryFileSystem readdir lists a child directory once, classified as a directory, without recursing
statusReason: expected [ 'sub/', 'sub/c.txt', 'sub/d.txt' ] to include 'sub'

[Killed] CallExpression
src/ports/in-memory-filesystem.ts:133:25
       const rest = key.slice(prefix.length);
       if (rest === "") continue; // the directory's own marker key
       const slash = rest.indexOf("/");
-      if (slash === -1) files.add(rest);
+      if (slash === -1) ;
       else dirs.add(rest.slice(0, slash));
     }
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: expected [] to deeply equal [ 'a.txt', 'b.txt' ]

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:134:21
       if (rest === "") continue; // the directory's own marker key
       const slash = rest.indexOf("/");
       if (slash === -1) files.add(rest);
-      else dirs.add(rest.slice(0, slash));
+      else dirs.add(rest);
     }
     return [...new Set([...dirs, ...files])].map((name) => {
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) walks the in-memory tree when no glob is given
statusReason: expected [ 'README.md' ] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:136:60
       if (slash === -1) files.add(rest);
       else dirs.add(rest.slice(0, slash));
     }
-    return [...new Set([...dirs, ...files])].map((name) => {
-      const isDir = dirs.has(name);
-      return { name, isDirectory: () => isDir, isFile: () => !isDir };
-    });
+    return [...new Set([...dirs, ...files])].map((name) => {});
   }
 
killedBy: InMemoryFileSystem readdir lists immediate child files by basename, classified as files
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArrowFunction
src/ports/in-memory-filesystem.ts:138:56
     }
     return [...new Set([...dirs, ...files])].map((name) => {
       const isDir = dirs.has(name);
-      return { name, isDirectory: () => isDir, isFile: () => !isDir };
+      return { name, isDirectory: () => isDir, isFile: () => undefined };
     });
   }
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) walks the in-memory tree when no glob is given
statusReason: expected [] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] ArrowFunction
src/ports/in-memory-filesystem.ts:138:35
     }
     return [...new Set([...dirs, ...files])].map((name) => {
       const isDir = dirs.has(name);
-      return { name, isDirectory: () => isDir, isFile: () => !isDir };
+      return { name, isDirectory: () => undefined, isFile: () => !isDir };
     });
   }
killedBy: InMemoryFileSystem readdir lists a child directory once, classified as a directory, without recursing
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:142:46
     });
   }
 
-  private isDirectory(path: string): boolean {
-    if (path.endsWith("/")) return true;
-    const prefix = `${path}/`;
-    for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
-    }
-    return false;
-  }
+  private isDirectory(path: string): boolean {}
 }
 
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) walks the in-memory tree when no glob is given
statusReason: expected [] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] MethodExpression
src/ports/in-memory-filesystem.ts:143:9
   }
 
   private isDirectory(path: string): boolean {
-    if (path.endsWith("/")) return true;
+    if (path.startsWith("/")) return true;
     const prefix = `${path}/`;
     for (const key of this.store.keys()) {
killedBy: InMemoryFileSystem stat reports a written file as not a directory
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/ports/in-memory-filesystem.ts:143:36
   }
 
   private isDirectory(path: string): boolean {
-    if (path.endsWith("/")) return true;
+    if (path.endsWith("/")) return false;
     const prefix = `${path}/`;
     for (const key of this.store.keys()) {
killedBy: InMemoryFileSystem stat treats a path with a trailing slash as a directory
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ports/in-memory-filesystem.ts:145:42
   private isDirectory(path: string): boolean {
     if (path.endsWith("/")) return true;
     const prefix = `${path}/`;
-    for (const key of this.store.keys()) {
-      if (key.startsWith(prefix)) return true;
-    }
+    for (const key of this.store.keys()) {}
     return false;
   }
killedBy: validateWorkspace with InMemoryFileSystem accepts a valid workspace directory
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, workspace: '/workspace' }
