[Killed] CallExpression
src/plugins/vue/engine.ts:375:7
     scope: WorkspaceScope,
   ): Promise<SetExportResult> {
     if (file.endsWith(".vue")) {
-      throw new EngineError(
-        `Cannot change the visibility of '${symbolName}' in ${file}: a top-level export is not valid inside a Vue SFC script block.`,
-        "NOT_SUPPORTED",
-      );
+      ;
     }
 
killedBy: setExport scenarios refuses to change the visibility of a .vue target file
statusReason: src/App.vue should have been left alone: expected '<script setup lang="ts">\nexport cons…' to be '<script setup lang="ts">\nconst label…' // Object.is equality

[Killed] BlockStatement
src/plugins/vue/engine.ts:398:37
     endCol: number,
     functionName: string,
     scope: WorkspaceScope,
-  ): Promise<ExtractFunctionResult> {
-    if (file.endsWith(".vue")) {
-      const result = vueExtractFunction(
-        file,
-        startLine,
-        startCol,
-        endLine,
-        endCol,
-        functionName,
-        scope,
-      );
-      this.invalidateService(file);
-      return result;
-    }
-    return this.tsEngine.extractFunction(
-      file,
-      startLine,
-      startCol,
-      endLine,
-      endCol,
-      functionName,
-      scope,
-    );
-  }
+  ): Promise<ExtractFunctionResult> {}
 
   async getTypeErrors(
killedBy: VolarEngine.extractFunction extracts a function from a <script setup> block and preserves all other SFC blocks
statusReason: Cannot read properties of undefined (reading 'filesModified')

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:399:9
     functionName: string,
     scope: WorkspaceScope,
   ): Promise<ExtractFunctionResult> {
-    if (file.endsWith(".vue")) {
+    if (false) {
       const result = vueExtractFunction(
         file,
killedBy: VolarEngine.extractFunction extracts a function from a <script setup> block and preserves all other SFC blocks
statusReason: Could not find source file: '/var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-feYoCs/Comp.vue'.

[Killed] MethodExpression
src/plugins/vue/engine.ts:399:9
     functionName: string,
     scope: WorkspaceScope,
   ): Promise<ExtractFunctionResult> {
-    if (file.endsWith(".vue")) {
+    if (file.startsWith(".vue")) {
       const result = vueExtractFunction(
         file,
killedBy: VolarEngine.extractFunction extracts a function from a <script setup> block and preserves all other SFC blocks
statusReason: Could not find source file: '/var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-5mkfX4/Comp.vue'.

[Survived] CallExpression
src/plugins/vue/engine.ts:409:7
         functionName,
         scope,
       );
-      this.invalidateService(file);
+      ;
       return result;
     }

[Killed] BlockStatement
src/plugins/vue/engine.ts:428:29
     scope: WorkspaceScope,
     tsConfigPath?: string,
   ): Promise<GetTypeErrorsResult> {
-    if (file !== undefined) {
-      if (file.endsWith(".vue")) {
-        return vueGetTypeErrorsForFile(file, (f) => this.getService(f));
-      }
-      // .ts/.tsx file in a Vue project — the Volar service resolves .vue
-      // imports the ts-morph project cannot; see scope.root note above.
-      return vueGetTypeErrorsForTsFile(file, (f) => this.getService(f, scope.root));
-    }
+    if (file !== undefined) {}
     // Project-wide, answered entirely by the Volar service (both file kinds).
     // Root comes from the request's scope, not this.workspaceRoot — see
killedBy: moveFile scenarios leaves an SFC's .js specifier alone when a real .js file sits beside the moved one
statusReason: response: expected { status: 'warn', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] EqualityOperator
src/plugins/vue/engine.ts:428:9
     scope: WorkspaceScope,
     tsConfigPath?: string,
   ): Promise<GetTypeErrorsResult> {
-    if (file !== undefined) {
+    if (file === undefined) {
       if (file.endsWith(".vue")) {
         return vueGetTypeErrorsForFile(file, (f) => this.getService(f));
statusReason: Cannot read properties of undefined (reading 'endsWith')

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:429:11
     tsConfigPath?: string,
   ): Promise<GetTypeErrorsResult> {
     if (file !== undefined) {
-      if (file.endsWith(".vue")) {
+      if (true) {
         return vueGetTypeErrorsForFile(file, (f) => this.getService(f));
       }
killedBy: moveFile scenarios still reports a genuinely missing SFC import untouched by the move
statusReason: main.ts imports both the moved Widget (repointed automatically) and a Ghost
component that never existed. Repointing the one must not silence the other:
a missing SFC is a real error and still belongs in the response.


response: expected { status: 'success', …(7) } to deeply equal { status: 'warn', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:429:11
     tsConfigPath?: string,
   ): Promise<GetTypeErrorsResult> {
     if (file !== undefined) {
-      if (file.endsWith(".vue")) {
+      if (false) {
         return vueGetTypeErrorsForFile(file, (f) => this.getService(f));
       }
killedBy: getTypeErrors operation Vue SFC support via VolarEngine single .vue file with type errors returns diagnostics with the real .vue path (not the virtual .vue.ts path)
statusReason: Could not find source file: '/var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-KuY7m4/src/Broken.vue'.

[Killed] ArrowFunction
src/plugins/vue/engine.ts:430:46
   ): Promise<GetTypeErrorsResult> {
     if (file !== undefined) {
       if (file.endsWith(".vue")) {
-        return vueGetTypeErrorsForFile(file, (f) => this.getService(f));
+        return vueGetTypeErrorsForFile(file, () => undefined);
       }
       // .ts/.tsx file in a Vue project — the Volar service resolves .vue
killedBy: getTypeErrors operation Vue SFC support via VolarEngine single .vue file with type errors returns diagnostics with the real .vue path (not the virtual .vue.ts path)
statusReason: Cannot read properties of undefined (reading 'vueVirtualToReal')

[Killed] ArrowFunction
src/plugins/vue/engine.ts:434:46
       }
       // .ts/.tsx file in a Vue project — the Volar service resolves .vue
       // imports the ts-morph project cannot; see scope.root note above.
-      return vueGetTypeErrorsForTsFile(file, (f) => this.getService(f, scope.root));
+      return vueGetTypeErrorsForTsFile(file, () => undefined);
     }
     // Project-wide, answered entirely by the Volar service (both file kinds).
killedBy: getTypeErrors operation Vue SFC support via VolarEngine .ts file in a Vue project (regression guard) returns the same errors for a .ts file as TsMorphEngine would
statusReason: Cannot read properties of undefined (reading 'baseService')

[Killed] BooleanLiteral
src/plugins/vue/engine.ts:464:9
     const offset = this.resolveOffset(file, line, col);
     const locs = await this.getRenameLocations(file, offset);
 
-    if (!locs) {
+    if (locs) {
       throw new EngineError(
         `No renameable symbol at line ${line}, col ${col} in ${file}`,
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:464:9
     const offset = this.resolveOffset(file, line, col);
     const locs = await this.getRenameLocations(file, offset);
 
-    if (!locs) {
+    if (true) {
       throw new EngineError(
         `No renameable symbol at line ${line}, col ${col} in ${file}`,
statusReason: No renameable symbol at line 1, col 17 in /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-CfFuxz/src/composables/useCounter.ts

[NoCoverage] CallExpression
src/plugins/vue/engine.ts:465:7
     const locs = await this.getRenameLocations(file, offset);
 
     if (!locs) {
-      throw new EngineError(
-        `No renameable symbol at line ${line}, col ${col} in ${file}`,
-        "SYMBOL_NOT_FOUND",
-      );
+      ;
     }
 

[Killed] MethodExpression
src/plugins/vue/engine.ts:473:21
 
     const firstLoc = locs[0];
     const firstContent = this.readFile(firstLoc.fileName);
-    const oldName = firstContent.slice(
-      firstLoc.textSpan.start,
-      firstLoc.textSpan.start + firstLoc.textSpan.length,
-    );
+    const oldName = firstContent;
 
     const editsByFile = new Map<
statusReason: expected 'import { describe, expect, it } from …' to be 'useCounter' // Object.is equality

[Killed] ArithmeticOperator
src/plugins/vue/engine.ts:475:7
     const firstContent = this.readFile(firstLoc.fileName);
     const oldName = firstContent.slice(
       firstLoc.textSpan.start,
-      firstLoc.textSpan.start + firstLoc.textSpan.length,
+      firstLoc.textSpan.start - firstLoc.textSpan.length,
     );
 
statusReason: expected '' to be 'useCounter' // Object.is equality

[Killed] BlockStatement
src/plugins/vue/engine.ts:482:29
       string,
       { span: { start: number; length: number }; newText: string }[]
     >();
-    for (const loc of locs) {
-      let fileEdits = editsByFile.get(loc.fileName);
-      if (!fileEdits) {
-        fileEdits = [];
-        editsByFile.set(loc.fileName, fileEdits);
-      }
-      fileEdits.push({ span: loc.textSpan, newText: newName });
-    }
+    for (const loc of locs) {}
 
     const oldContents = new Map<string, string>();
statusReason: expected 'import { describe, expect, it } from …' to contain 'import { useTimer }'

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:484:11
     >();
     for (const loc of locs) {
       let fileEdits = editsByFile.get(loc.fileName);
-      if (!fileEdits) {
+      if (false) {
         fileEdits = [];
         editsByFile.set(loc.fileName, fileEdits);
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:484:11
     >();
     for (const loc of locs) {
       let fileEdits = editsByFile.get(loc.fileName);
-      if (!fileEdits) {
+      if (true) {
         fileEdits = [];
         editsByFile.set(loc.fileName, fileEdits);
killedBy: rename action with VolarEngine — vue-ts-boundary renames across TypeScript/Vue boundary
statusReason: expected '<script setup lang="ts">\nimport { we…' not to contain 'greetUser'

[Killed] CallExpression
src/plugins/vue/engine.ts:486:9
       let fileEdits = editsByFile.get(loc.fileName);
       if (!fileEdits) {
         fileEdits = [];
-        editsByFile.set(loc.fileName, fileEdits);
+        ;
       }
       fileEdits.push({ span: loc.textSpan, newText: newName });
statusReason: expected '<script setup lang="ts">\nimport { gr…' to contain 'salute'

[Killed] BlockStatement
src/plugins/vue/engine.ts:492:50
     }
 
     const oldContents = new Map<string, string>();
-    for (const [fileName, edits] of editsByFile) {
-      if (!scope.contains(fileName)) {
-        scope.recordSkipped(fileName);
-        continue;
-      }
-      const original = this.readFile(fileName);
-      oldContents.set(fileName, original);
-      const updated = applyTextEdits(original, edits);
-      scope.writeFile(fileName, updated);
-      service.fileContents.set(fileName, updated);
-    }
+    for (const [fileName, edits] of editsByFile) {}
 
     const excludePositions = locs.map((loc) => ({
killedBy: rename action with VolarEngine renames a composable in a .ts file and updates .vue files
statusReason: expected 0 to be greater than or equal to 2

[Killed] ConditionalExpression
src/plugins/vue/engine.ts:493:11
 
     const oldContents = new Map<string, string>();
     for (const [fileName, edits] of editsByFile) {
-      if (!scope.contains(fileName)) {
+      if (true) {
         scope.recordSkipped(fileName);
         continue;
killedBy: rename action with VolarEngine renames a composable in a .ts file and updates .vue files
statusReason: expected 0 to be greater than or equal to 2

[Killed] BooleanLiteral
src/plugins/vue/engine.ts:493:11
 
     const oldContents = new Map<string, string>();
     for (const [fileName, edits] of editsByFile) {
-      if (!scope.contains(fileName)) {
+      if (scope.contains(fileName)) {
         scope.recordSkipped(fileName);
         continue;
statusReason: expected '<script setup lang="ts">\nimport { gr…' to contain 'salute'

[NoCoverage] CallExpression
src/plugins/vue/engine.ts:494:9
     const oldContents = new Map<string, string>();
     for (const [fileName, edits] of editsByFile) {
       if (!scope.contains(fileName)) {
-        scope.recordSkipped(fileName);
+        ;
         continue;
       }

[Killed] CallExpression
src/plugins/vue/engine.ts:498:7
         continue;
       }
       const original = this.readFile(fileName);
-      oldContents.set(fileName, original);
+      ;
       const updated = applyTextEdits(original, edits);
       scope.writeFile(fileName, updated);
killedBy: VolarEngine.rename nameMatches — integration returns nameMatches for renamed .ts files, excluding renamed sites even when newName contains oldName
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/plugins/vue/engine.ts:500:7
       const original = this.readFile(fileName);
       oldContents.set(fileName, original);
       const updated = applyTextEdits(original, edits);
-      scope.writeFile(fileName, updated);
+      ;
       service.fileContents.set(fileName, updated);
     }
statusReason: expected '<script setup lang="ts">\nimport { gr…' to contain 'salute'

[Survived] CallExpression
src/plugins/vue/engine.ts:501:7
       oldContents.set(fileName, original);
       const updated = applyTextEdits(original, edits);
       scope.writeFile(fileName, updated);
-      service.fileContents.set(fileName, updated);
+      ;
     }
 

[Killed] ArrowFunction
src/plugins/vue/engine.ts:504:39
       service.fileContents.set(fileName, updated);
     }
 
-    const excludePositions = locs.map((loc) => ({
-      file: loc.fileName,
-      offset: loc.textSpan.start,
-    }));
+    const excludePositions = locs.map(() => undefined);
     const nameMatches = scanVueNameMatches(oldName, oldContents, excludePositions);
 
killedBy: rename action with VolarEngine renames a composable in a .ts file and updates .vue files
statusReason: Cannot read properties of undefined (reading 'file')

[Killed] ObjectLiteral
src/plugins/vue/engine.ts:510:12
     }));
     const nameMatches = scanVueNameMatches(oldName, oldContents, excludePositions);
 
-    return {
-      filesModified: scope.modified,
-      filesSkipped: scope.skipped,
-      symbolName: oldName,
-      newName,
-      locationCount: locs.length,
-      nameMatches,
-    };
+    return {};
   }
 }
killedBy: rename action with VolarEngine renames a composable in a .ts file and updates .vue files
statusReason: expected undefined to be 'useCounter' // Object.is equality
