[Killed] BlockStatement
src/plugins/vue/service.ts:49:83
 function parseTsConfig(
   tsConfigPath: string | null,
   ts: typeof import("typescript"),
-): { compilerOptions: import("typescript").CompilerOptions; fileNames: string[] } {
-  if (!tsConfigPath) {
-    return { compilerOptions: {}, fileNames: [] };
-  }
-  const parsed = ts.readConfigFile(tsConfigPath, ts.sys.readFile);
-  if (parsed.error) {
-    return { compilerOptions: {}, fileNames: [] };
-  }
-  const result = ts.parseJsonConfigFileContent(parsed.config, ts.sys, path.dirname(tsConfigPath));
-  return { compilerOptions: result.options, fileNames: result.fileNames };
-}
+): { compilerOptions: import("typescript").CompilerOptions; fileNames: string[] } {}
 
 function buildLanguageServiceHost(params: {
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] BooleanLiteral
src/plugins/vue/service.ts:50:7
   tsConfigPath: string | null,
   ts: typeof import("typescript"),
 ): { compilerOptions: import("typescript").CompilerOptions; fileNames: string[] } {
-  if (!tsConfigPath) {
+  if (tsConfigPath) {
     return { compilerOptions: {}, fileNames: [] };
   }
killedBy: moveFile scenarios repoints an SFC's aliased import when the composable it names moves
statusReason: The alias is preserved rather than flattened to a relative specifier, so the SFC keeps the import style its author chose.

src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[Killed] ConditionalExpression
src/plugins/vue/service.ts:50:7
   tsConfigPath: string | null,
   ts: typeof import("typescript"),
 ): { compilerOptions: import("typescript").CompilerOptions; fileNames: string[] } {
-  if (!tsConfigPath) {
+  if (true) {
     return { compilerOptions: {}, fileNames: [] };
   }
killedBy: moveFile scenarios repoints an SFC's aliased import when the composable it names moves
statusReason: The alias is preserved rather than flattened to a relative specifier, so the SFC keeps the import style its author chose.

src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[NoCoverage] ObjectLiteral
src/plugins/vue/service.ts:51:12
   ts: typeof import("typescript"),
 ): { compilerOptions: import("typescript").CompilerOptions; fileNames: string[] } {
   if (!tsConfigPath) {
-    return { compilerOptions: {}, fileNames: [] };
+    return {};
   }
   const parsed = ts.readConfigFile(tsConfigPath, ts.sys.readFile);

[Killed] ConditionalExpression
src/plugins/vue/service.ts:54:7
     return { compilerOptions: {}, fileNames: [] };
   }
   const parsed = ts.readConfigFile(tsConfigPath, ts.sys.readFile);
-  if (parsed.error) {
+  if (true) {
     return { compilerOptions: {}, fileNames: [] };
   }
killedBy: moveFile scenarios repoints an SFC's aliased import when the composable it names moves
statusReason: The alias is preserved rather than flattened to a relative specifier, so the SFC keeps the import style its author chose.

src/App.vue was listed as changed but is identical: expected '<script setup lang="ts">\nimport { us…' not to be '<script setup lang="ts">\nimport { us…' // Object.is equality

[NoCoverage] BlockStatement
src/plugins/vue/service.ts:54:21
     return { compilerOptions: {}, fileNames: [] };
   }
   const parsed = ts.readConfigFile(tsConfigPath, ts.sys.readFile);
-  if (parsed.error) {
-    return { compilerOptions: {}, fileNames: [] };
-  }
+  if (parsed.error) {}
   const result = ts.parseJsonConfigFileContent(parsed.config, ts.sys, path.dirname(tsConfigPath));
   return { compilerOptions: result.options, fileNames: result.fileNames };

[NoCoverage] ObjectLiteral
src/plugins/vue/service.ts:55:12
   }
   const parsed = ts.readConfigFile(tsConfigPath, ts.sys.readFile);
   if (parsed.error) {
-    return { compilerOptions: {}, fileNames: [] };
+    return {};
   }
   const result = ts.parseJsonConfigFileContent(parsed.config, ts.sys, path.dirname(tsConfigPath));

[Killed] ObjectLiteral
src/plugins/vue/service.ts:58:10
     return { compilerOptions: {}, fileNames: [] };
   }
   const result = ts.parseJsonConfigFileContent(parsed.config, ts.sys, path.dirname(tsConfigPath));
-  return { compilerOptions: result.options, fileNames: result.fileNames };
+  return {};
 }
 
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Survived] ArrowFunction
src/plugins/vue/service.ts:80:22
     ts,
   } = params;
   const versions = new Map<string, number>();
-  const getVersion = (filePath: string) => String(versions.get(filePath) ?? 0);
+  const getVersion = () => undefined;
 
   return {

[Survived] LogicalOperator
src/plugins/vue/service.ts:80:51
     ts,
   } = params;
   const versions = new Map<string, number>();
-  const getVersion = (filePath: string) => String(versions.get(filePath) ?? 0);
+  const getVersion = (filePath: string) => String(versions.get(filePath) && 0);
 
   return {

[Killed] ArrowFunction
src/plugins/vue/service.ts:83:29
   const getVersion = (filePath: string) => String(versions.get(filePath) ?? 0);
 
   return {
-    getCompilationSettings: () => compilerOptions,
+    getCompilationSettings: () => undefined,
     getScriptFileNames: () => scriptFileNames,
     getScriptVersion: (filePath) => {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Killed] ArrowFunction
src/plugins/vue/service.ts:84:25
 
   return {
     getCompilationSettings: () => compilerOptions,
-    getScriptFileNames: () => scriptFileNames,
+    getScriptFileNames: () => undefined,
     getScriptVersion: (filePath) => {
       const realPath = vueVirtualToReal.get(filePath) ?? filePath;
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Survived] BlockStatement
src/plugins/vue/service.ts:85:37
   return {
     getCompilationSettings: () => compilerOptions,
     getScriptFileNames: () => scriptFileNames,
-    getScriptVersion: (filePath) => {
-      const realPath = vueVirtualToReal.get(filePath) ?? filePath;
-      return getVersion(realPath);
-    },
+    getScriptVersion: (filePath) => {},
     getScriptSnapshot: (filePath) => {
       const realVuePath = vueVirtualToReal.get(filePath);

[Survived] LogicalOperator
src/plugins/vue/service.ts:86:24
     getCompilationSettings: () => compilerOptions,
     getScriptFileNames: () => scriptFileNames,
     getScriptVersion: (filePath) => {
-      const realPath = vueVirtualToReal.get(filePath) ?? filePath;
+      const realPath = vueVirtualToReal.get(filePath) && filePath;
       return getVersion(realPath);
     },

[Killed] BlockStatement
src/plugins/vue/service.ts:89:38
       const realPath = vueVirtualToReal.get(filePath) ?? filePath;
       return getVersion(realPath);
     },
-    getScriptSnapshot: (filePath) => {
-      const realVuePath = vueVirtualToReal.get(filePath);
-      if (realVuePath !== undefined) {
-        const sourceScript = languageRef.current?.scripts.get(realVuePath);
-        if (sourceScript?.generated) {
-          const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
-            sourceScript.generated.root,
-          );
-          if (serviceScript) return serviceScript.code.snapshot;
-        }
-        return undefined;
-      }
-      const content = readFile(filePath);
-      return content !== undefined ? ts.ScriptSnapshot.fromString(content) : undefined;
-    },
+    getScriptSnapshot: (filePath) => {},
     getCurrentDirectory: () => (tsConfigPath ? path.dirname(tsConfigPath) : process.cwd()),
     getDefaultLibFileName: ts.getDefaultLibFilePath,
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:91:11
     },
     getScriptSnapshot: (filePath) => {
       const realVuePath = vueVirtualToReal.get(filePath);
-      if (realVuePath !== undefined) {
+      if (false) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
         if (sourceScript?.generated) {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:91:11
     },
     getScriptSnapshot: (filePath) => {
       const realVuePath = vueVirtualToReal.get(filePath);
-      if (realVuePath !== undefined) {
+      if (true) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
         if (sourceScript?.generated) {
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Survived] OptionalChaining
src/plugins/vue/service.ts:92:30
     getScriptSnapshot: (filePath) => {
       const realVuePath = vueVirtualToReal.get(filePath);
       if (realVuePath !== undefined) {
-        const sourceScript = languageRef.current?.scripts.get(realVuePath);
+        const sourceScript = languageRef.current.scripts.get(realVuePath);
         if (sourceScript?.generated) {
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(

[Killed] ConditionalExpression
src/plugins/vue/service.ts:93:13
       const realVuePath = vueVirtualToReal.get(filePath);
       if (realVuePath !== undefined) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
-        if (sourceScript?.generated) {
+        if (false) {
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:93:38
       const realVuePath = vueVirtualToReal.get(filePath);
       if (realVuePath !== undefined) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
-        if (sourceScript?.generated) {
-          const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
-            sourceScript.generated.root,
-          );
-          if (serviceScript) return serviceScript.code.snapshot;
-        }
+        if (sourceScript?.generated) {}
         return undefined;
       }
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Survived] OptionalChaining
src/plugins/vue/service.ts:94:33
       if (realVuePath !== undefined) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
         if (sourceScript?.generated) {
-          const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
+          const serviceScript = sourceScript.generated.languagePlugin.typescript.getServiceScript(
             sourceScript.generated.root,
           );

[Killed] ConditionalExpression
src/plugins/vue/service.ts:97:15
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,
           );
-          if (serviceScript) return serviceScript.code.snapshot;
+          if (false) return serviceScript.code.snapshot;
         }
         return undefined;
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Survived] ConditionalExpression
src/plugins/vue/service.ts:97:15
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,
           );
-          if (serviceScript) return serviceScript.code.snapshot;
+          if (true) return serviceScript.code.snapshot;
         }
         return undefined;

[Killed] EqualityOperator
src/plugins/vue/service.ts:102:14
         return undefined;
       }
       const content = readFile(filePath);
-      return content !== undefined ? ts.ScriptSnapshot.fromString(content) : undefined;
+      return content === undefined ? ts.ScriptSnapshot.fromString(content) : undefined;
     },
     getCurrentDirectory: () => (tsConfigPath ? path.dirname(tsConfigPath) : process.cwd()),
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:102:14
         return undefined;
       }
       const content = readFile(filePath);
-      return content !== undefined ? ts.ScriptSnapshot.fromString(content) : undefined;
+      return false ? ts.ScriptSnapshot.fromString(content) : undefined;
     },
     getCurrentDirectory: () => (tsConfigPath ? path.dirname(tsConfigPath) : process.cwd()),
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Survived] ArrowFunction
src/plugins/vue/service.ts:104:26
       const content = readFile(filePath);
       return content !== undefined ? ts.ScriptSnapshot.fromString(content) : undefined;
     },
-    getCurrentDirectory: () => (tsConfigPath ? path.dirname(tsConfigPath) : process.cwd()),
+    getCurrentDirectory: () => undefined,
     getDefaultLibFileName: ts.getDefaultLibFilePath,
     // Why identity canonicalisation: docs/tech/volar-v3.md.

[Killed] BlockStatement
src/plugins/vue/service.ts:108:35
     getDefaultLibFileName: ts.getDefaultLibFilePath,
     // Why identity canonicalisation: docs/tech/volar-v3.md.
     useCaseSensitiveFileNames: () => true,
-    fileExists: (filePath) => {
-      if (vueVirtualToReal.has(filePath)) return true;
-      return ts.sys.fileExists(filePath);
-    },
+    fileExists: (filePath) => {{},
     readFile: (filePath) => {
       const realVuePath = vueVirtualToReal.get(filePath);
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'warn', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:109:11
     // Why identity canonicalisation: docs/tech/volar-v3.md.
     useCaseSensitiveFileNames: () => true,
     fileExists: (filePath) => {
-      if (vueVirtualToReal.has(filePath)) return true;
+      if (false) return true;
       return ts.sys.fileExists(filePath);
     },
killedBy: moveDirectory action - VolarEngine integration external .ts files importing moved .vue components updates path-alias import specifier in external .ts file after moving directory
statusReason: expected 'import Button from "./ui/Button.vue";…' not to contain '@/components/Button.vue'

[Killed] ConditionalExpression
src/plugins/vue/service.ts:109:11
     // Why identity canonicalisation: docs/tech/volar-v3.md.
     useCaseSensitiveFileNames: () => true,
     fileExists: (filePath) => {
-      if (vueVirtualToReal.has(filePath)) return true;
+      if (true) return true;
       return ts.sys.fileExists(filePath);
     },
killedBy: moveDirectory action - VolarEngine integration external .ts files importing moved .vue components updates path-alias import specifier in external .ts file after moving directory
statusReason: expected 'import Button from "./components/Butt…' not to contain '@/components/Button.vue'

[Survived] BlockStatement
src/plugins/vue/service.ts:112:29
       if (vueVirtualToReal.has(filePath)) return true;
       return ts.sys.fileExists(filePath);
     },
-    readFile: (filePath) => {
-      const realVuePath = vueVirtualToReal.get(filePath);
-      if (realVuePath !== undefined) {
-        const sourceScript = languageRef.current?.scripts.get(realVuePath);
-        if (sourceScript?.generated) {
-          const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
-            sourceScript.generated.root,
-          );
-          if (serviceScript) {
-            return serviceScript.code.snapshot.getText(0, serviceScript.code.snapshot.getLength());
-          }
-        }
-        return undefined;
-      }
-      return ts.sys.readFile(filePath);
-    },
+    readFile: (filePath) => {},
     readDirectory: ts.sys.readDirectory,
     directoryExists: ts.sys.directoryExists,

[NoCoverage] OptionalChaining
src/plugins/vue/service.ts:116:13
       const realVuePath = vueVirtualToReal.get(filePath);
       if (realVuePath !== undefined) {
         const sourceScript = languageRef.current?.scripts.get(realVuePath);
-        if (sourceScript?.generated) {
+        if (sourceScript.generated) {
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,

[NoCoverage] ConditionalExpression
src/plugins/vue/service.ts:120:15
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,
           );
-          if (serviceScript) {
+          if (false) {
             return serviceScript.code.snapshot.getText(0, serviceScript.code.snapshot.getLength());
           }

[NoCoverage] BlockStatement
src/plugins/vue/service.ts:120:30
           const serviceScript = sourceScript.generated.languagePlugin.typescript?.getServiceScript(
             sourceScript.generated.root,
           );
-          if (serviceScript) {
-            return serviceScript.code.snapshot.getText(0, serviceScript.code.snapshot.getLength());
-          }
+          if (serviceScript) {}
         }
         return undefined;

[Killed] BlockStatement
src/plugins/vue/service.ts:148:62
 
   const fileContents = new Map<string, string>();
 
-  const readFile = (filePath: string): string | undefined => {
-    if (fileContents.has(filePath)) return fileContents.get(filePath);
-    try {
-      const content = fs.readFileSync(filePath, "utf8");
-      fileContents.set(filePath, content);
-      return content;
-    } catch {
-      return undefined;
-    }
-  };
+  const readFile = (filePath: string): string | undefined => {};
 
   const { compilerOptions, fileNames: tsConfigFileNames } = parseTsConfig(tsConfigPath, ts);
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:149:9
   const fileContents = new Map<string, string>();
 
   const readFile = (filePath: string): string | undefined => {
-    if (fileContents.has(filePath)) return fileContents.get(filePath);
+    if (true) return fileContents.get(filePath);
     try {
       const content = fs.readFileSync(filePath, "utf8");
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Survived] ConditionalExpression
src/plugins/vue/service.ts:149:9
   const fileContents = new Map<string, string>();
 
   const readFile = (filePath: string): string | undefined => {
-    if (fileContents.has(filePath)) return fileContents.get(filePath);
+    if (false) return fileContents.get(filePath);
     try {
       const content = fs.readFileSync(filePath, "utf8");

[Killed] BlockStatement
src/plugins/vue/service.ts:150:9
 
   const readFile = (filePath: string): string | undefined => {
     if (fileContents.has(filePath)) return fileContents.get(filePath);
-    try {
-      const content = fs.readFileSync(filePath, "utf8");
-      fileContents.set(filePath, content);
-      return content;
-    } catch {
+    try {} catch {
       return undefined;
     }
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] CallExpression
src/plugins/vue/service.ts:152:7
     if (fileContents.has(filePath)) return fileContents.get(filePath);
     try {
       const content = fs.readFileSync(filePath, "utf8");
-      fileContents.set(filePath, content);
+      ;
       return content;
     } catch {
killedBy: getTypeErrors operation Vue SFC support via VolarEngine single .vue file with type errors returns diagnostics with the real .vue path (not the virtual .vue.ts path)
statusReason: expected 0 to be greater than 0

[Survived] BlockStatement
src/plugins/vue/service.ts:154:13
       const content = fs.readFileSync(filePath, "utf8");
       fileContents.set(filePath, content);
       return content;
-    } catch {
-      return undefined;
-    }
+    } catch {}
   };
 

[Killed] ArrowFunction
src/plugins/vue/service.ts:167:5
     ts,
     compilerOptions,
     vueCompilerOptions,
-    (id) => id,
+    () => undefined,
   );
 
killedBy: getTypeErrors operation Vue SFC support via VolarEngine single .vue file with type errors returns diagnostics with the real .vue path (not the virtual .vue.ts path)
statusReason: expected 0 to be greater than 0

[NoCoverage] LogicalOperator
src/plugins/vue/service.ts:180:10
     ? path.dirname(tsConfigPath)
     : rootFilePath
       ? path.dirname(rootFilePath)
-      : (workspaceRoot ?? process.cwd());
+      : (workspaceRoot && process.cwd());
 
   // Always include .vue files from the project directory, even when the

[Killed] MethodExpression
src/plugins/vue/service.ts:184:26
 
   // Always include .vue files from the project directory, even when the
   // tsconfig does not list them (e.g. bundler-only Vue setups).
-  const vueFilesOnDisk = ts.sys
-    .readDirectory(projectRoot, [".vue"], [], [], 1000)
-    .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
+  const vueFilesOnDisk = ts.sys.readDirectory(projectRoot, [".vue"], [], [], 1000);
   for (const f of vueFilesOnDisk) {
     if (!projectFiles.includes(f)) projectFiles.push(f);
killedBy: rename action with VolarEngine does not rename symbols in dist/ .vue files
statusReason: expected [ …(4) ] to not include '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…'

[Killed] MethodExpression
src/plugins/vue/service.ts:186:21
   // tsconfig does not list them (e.g. bundler-only Vue setups).
   const vueFilesOnDisk = ts.sys
     .readDirectory(projectRoot, [".vue"], [], [], 1000)
-    .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
+    .filter((f) => !f.split("/").every(seg => SKIP_DIRS.has(seg)));
   for (const f of vueFilesOnDisk) {
     if (!projectFiles.includes(f)) projectFiles.push(f);
killedBy: rename action with VolarEngine does not rename symbols in dist/ .vue files
statusReason: expected [ …(4) ] to not include '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…'

[Killed] BooleanLiteral
src/plugins/vue/service.ts:186:20
   // tsconfig does not list them (e.g. bundler-only Vue setups).
   const vueFilesOnDisk = ts.sys
     .readDirectory(projectRoot, [".vue"], [], [], 1000)
-    .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
+    .filter((f) => f.split("/").some(seg => SKIP_DIRS.has(seg)));
   for (const f of vueFilesOnDisk) {
     if (!projectFiles.includes(f)) projectFiles.push(f);
killedBy: getTypeErrors operation Vue SFC support via VolarEngine single .vue file with type errors returns diagnostics with the real .vue path (not the virtual .vue.ts path)
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/plugins/vue/service.ts:187:35
   const vueFilesOnDisk = ts.sys
     .readDirectory(projectRoot, [".vue"], [], [], 1000)
     .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
-  for (const f of vueFilesOnDisk) {
-    if (!projectFiles.includes(f)) projectFiles.push(f);
-  }
+  for (const f of vueFilesOnDisk) {}
 
   // Snapshot before the workspace walk below widens `projectFiles` further —
killedBy: rename action with VolarEngine — vue-ts-boundary renames across TypeScript/Vue boundary
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/plugins/vue/service.ts:188:9
     .readDirectory(projectRoot, [".vue"], [], [], 1000)
     .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
   for (const f of vueFilesOnDisk) {
-    if (!projectFiles.includes(f)) projectFiles.push(f);
+    if (false) projectFiles.push(f);
   }
 
killedBy: rename action with VolarEngine — vue-ts-boundary renames across TypeScript/Vue boundary
statusReason: expected 1 to be greater than or equal to 2

[Killed] BooleanLiteral
src/plugins/vue/service.ts:188:9
     .readDirectory(projectRoot, [".vue"], [], [], 1000)
     .filter((f) => !f.split("/").some((seg) => SKIP_DIRS.has(seg)));
   for (const f of vueFilesOnDisk) {
-    if (!projectFiles.includes(f)) projectFiles.push(f);
+    if (projectFiles.includes(f)) projectFiles.push(f);
   }
 
killedBy: rename action with VolarEngine — vue-ts-boundary renames across TypeScript/Vue boundary
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/plugins/vue/service.ts:197:7
 
   // Include all workspace TS/JS files so test files and scripts outside
   // tsconfig.include are visible to the Volar language service.
-  if (workspaceRoot) {
+  if (false) {
     const existingSet = new Set(projectFiles);
     for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {
killedBy: moveFile scenarios repoints an out-of-project test when the composable it imports moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:197:22
 
   // Include all workspace TS/JS files so test files and scripts outside
   // tsconfig.include are visible to the Volar language service.
-  if (workspaceRoot) {
-    const existingSet = new Set(projectFiles);
-    for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!existingSet.has(f)) projectFiles.push(f);
-    }
-  }
+  if (workspaceRoot) {}
 
   const scriptRegistry = new Map();
killedBy: moveFile scenarios repoints an out-of-project test when the composable it imports moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:199:67
   // tsconfig.include are visible to the Volar language service.
   if (workspaceRoot) {
     const existingSet = new Set(projectFiles);
-    for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!existingSet.has(f)) projectFiles.push(f);
-    }
+    for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {}
   }
 
killedBy: moveFile scenarios repoints an out-of-project test when the composable it imports moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Killed] CallExpression
src/plugins/vue/service.ts:200:32
   if (workspaceRoot) {
     const existingSet = new Set(projectFiles);
     for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!existingSet.has(f)) projectFiles.push(f);
+      if (!existingSet.has(f)) ;
     }
   }
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/plugins/vue/service.ts:200:11
   if (workspaceRoot) {
     const existingSet = new Set(projectFiles);
     for (const f of walkFiles(workspaceRoot, [...TS_EXTENSIONS])) {
-      if (!existingSet.has(f)) projectFiles.push(f);
+      if (existingSet.has(f)) projectFiles.push(f);
     }
   }
killedBy: moveFile scenarios repoints an out-of-project test when the composable it imports moves
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(7) }

[Survived] ObjectLiteral
src/plugins/vue/service.ts:208:66
 
   // languageRef is assigned synchronously after createLanguage returns.
   // The sync callback is only invoked lazily — never during construction.
-  const languageRef: { current: Language<string> | undefined } = { current: undefined };
+  const languageRef: { current: Language<string> | undefined } = {};
 
   const language = createLanguage<string>(

[Survived] BlockStatement
src/plugins/vue/service.ts:213:46
   const language = createLanguage<string>(
     [vuePlugin],
     scriptRegistry,
-    (id, _includeFsFiles, shouldRegister) => {
-      if (shouldRegister) {
-        const content = readFile(id);
-        if (content !== undefined) {
-          const snapshot = ts.ScriptSnapshot.fromString(content);
-          languageRef.current?.scripts.set(
-            id,
-            snapshot,
-            id.endsWith(".vue") ? "vue" : "typescript",
-          );
-        }
-      }
-    },
+    (id, _includeFsFiles, shouldRegister) => {},
   );
   languageRef.current = language;
