[Survived] ConditionalExpression
src/plugins/vue/service.ts:214:11
     [vuePlugin],
     scriptRegistry,
     (id, _includeFsFiles, shouldRegister) => {
-      if (shouldRegister) {
+      if (true) {
         const content = readFile(id);
         if (content !== undefined) {

[Survived] ConditionalExpression
src/plugins/vue/service.ts:214:11
     [vuePlugin],
     scriptRegistry,
     (id, _includeFsFiles, shouldRegister) => {
-      if (shouldRegister) {
+      if (false) {
         const content = readFile(id);
         if (content !== undefined) {

[Survived] ConditionalExpression
src/plugins/vue/service.ts:216:13
     (id, _includeFsFiles, shouldRegister) => {
       if (shouldRegister) {
         const content = readFile(id);
-        if (content !== undefined) {
+        if (false) {
           const snapshot = ts.ScriptSnapshot.fromString(content);
           languageRef.current?.scripts.set(

[Survived] EqualityOperator
src/plugins/vue/service.ts:216:13
     (id, _includeFsFiles, shouldRegister) => {
       if (shouldRegister) {
         const content = readFile(id);
-        if (content !== undefined) {
+        if (content === undefined) {
           const snapshot = ts.ScriptSnapshot.fromString(content);
           languageRef.current?.scripts.set(

[Survived] OptionalChaining
src/plugins/vue/service.ts:218:11
         const content = readFile(id);
         if (content !== undefined) {
           const snapshot = ts.ScriptSnapshot.fromString(content);
-          languageRef.current?.scripts.set(
+          languageRef.current.scripts.set(
             id,
             snapshot,

[Survived] MethodExpression
src/plugins/vue/service.ts:221:13
           languageRef.current?.scripts.set(
             id,
             snapshot,
-            id.endsWith(".vue") ? "vue" : "typescript",
+            id.startsWith(".vue") ? "vue" : "typescript",
           );
         }

[Killed] BlockStatement
src/plugins/vue/service.ts:231:38
 
   // Pre-load all project files so Volar generates their virtual TypeScript
   // before any language service operation runs.
-  for (const fileId of projectFiles) {
-    const content = readFile(fileId);
-    if (content !== undefined) {
-      const snapshot = ts.ScriptSnapshot.fromString(content);
-      language.scripts.set(fileId, snapshot, fileId.endsWith(".vue") ? "vue" : "typescript");
-    }
-  }
+  for (const fileId of projectFiles) {}
 
   // Build virtual filename mapping.
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] EqualityOperator
src/plugins/vue/service.ts:233:9
   // before any language service operation runs.
   for (const fileId of projectFiles) {
     const content = readFile(fileId);
-    if (content !== undefined) {
+    if (content === undefined) {
       const snapshot = ts.ScriptSnapshot.fromString(content);
       language.scripts.set(fileId, snapshot, fileId.endsWith(".vue") ? "vue" : "typescript");
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:233:32
   // before any language service operation runs.
   for (const fileId of projectFiles) {
     const content = readFile(fileId);
-    if (content !== undefined) {
-      const snapshot = ts.ScriptSnapshot.fromString(content);
-      language.scripts.set(fileId, snapshot, fileId.endsWith(".vue") ? "vue" : "typescript");
-    }
+    if (content !== undefined) {}
   }
 
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] MethodExpression
src/plugins/vue/service.ts:235:46
     const content = readFile(fileId);
     if (content !== undefined) {
       const snapshot = ts.ScriptSnapshot.fromString(content);
-      language.scripts.set(fileId, snapshot, fileId.endsWith(".vue") ? "vue" : "typescript");
+      language.scripts.set(fileId, snapshot, fileId.startsWith(".vue") ? "vue" : "typescript");
     }
   }
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:241:38
 
   // Build virtual filename mapping.
   const vueVirtualToReal = new Map<string, string>(); // App.vue.ts → App.vue
-  for (const fileId of projectFiles) {
-    if (fileId.endsWith(".vue")) {
-      vueVirtualToReal.set(`${fileId}.ts`, fileId);
-    }
-  }
+  for (const fileId of projectFiles) {}
 
   // Replace .vue entries with their virtual .vue.ts equivalents.
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] BlockStatement
src/plugins/vue/service.ts:242:34
   // Build virtual filename mapping.
   const vueVirtualToReal = new Map<string, string>(); // App.vue.ts → App.vue
   for (const fileId of projectFiles) {
-    if (fileId.endsWith(".vue")) {
-      vueVirtualToReal.set(`${fileId}.ts`, fileId);
-    }
+    if (fileId.endsWith(".vue")) {}
   }
 
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] ConditionalExpression
src/plugins/vue/service.ts:242:9
   // Build virtual filename mapping.
   const vueVirtualToReal = new Map<string, string>(); // App.vue.ts → App.vue
   for (const fileId of projectFiles) {
-    if (fileId.endsWith(".vue")) {
+    if (true) {
       vueVirtualToReal.set(`${fileId}.ts`, fileId);
     }
statusReason: Could not find source file: '/var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-0BDKZI/src/main.ts.ts'.

[Killed] CallExpression
src/plugins/vue/service.ts:243:7
   const vueVirtualToReal = new Map<string, string>(); // App.vue.ts → App.vue
   for (const fileId of projectFiles) {
     if (fileId.endsWith(".vue")) {
-      vueVirtualToReal.set(`${fileId}.ts`, fileId);
+      ;
     }
   }
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] MethodExpression
src/plugins/vue/service.ts:249:111
 
   // Replace .vue entries with their virtual .vue.ts equivalents.
   const scriptFileNames = projectFiles.map(toVirtualVuePath);
-  const seedFileNames = tsConfigPath === null ? null : seedFiles.map(toVirtualVuePath);
+  const seedFileNames = tsConfigPath === null ? null : seedFiles.map(toVirtualVuePath);f.startsWith(".vue")
 
   const host = buildLanguageServiceHost({
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: response: expected { status: 'success', …(7) } to deeply equal { status: 'success', …(7) }

[Killed] ObjectLiteral
src/plugins/vue/service.ts:251:41
   const scriptFileNames = projectFiles.map(toVirtualVuePath);
   const seedFileNames = tsConfigPath === null ? null : seedFiles.map(toVirtualVuePath);
 
-  const host = buildLanguageServiceHost({
-    compilerOptions,
-    scriptFileNames,
-    vueVirtualToReal,
-    languageRef,
-    tsConfigPath,
-    readFile,
-    ts,
-  });
+  const host = buildLanguageServiceHost({});
 
   decorateLanguageServiceHost(ts, language, host);
killedBy: moveFile scenarios repoints a Vue SFC import when the composable it uses moves
statusReason: src/composables/useCounter.ts should have moved away: expected 'export function useCounter(initialVal…' to be undefined

[Survived] CallExpression
src/plugins/vue/service.ts:261:3
     ts,
   });
 
-  decorateLanguageServiceHost(ts, language, host);
+  ;
 
   const baseService = ts.createLanguageService(host);

[Survived] CallExpression
src/plugins/vue/service.ts:265:3
 
   const baseService = ts.createLanguageService(host);
   const { proxy, initialize } = createProxyLanguageService(baseService);
-  initialize(language);
+  ;
 
   return {
