[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:9:99
 import type { TsMorphEngine } from "./engine.js";
 import { describeCheckedScope, typeCheckedFiles } from "./type-check-scope.js";
 
-export function extractDiagnosticMessage(messageText: string | ts.DiagnosticMessageChain): string {
-  return typeof messageText === "string" ? messageText : messageText.messageText;
-}
+export function extractDiagnosticMessage(messageText: string | ts.DiagnosticMessageChain): string {}
 
 export function toDiagnostic(
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/ts-engine/get-type-errors.ts:10:10
 import { describeCheckedScope, typeCheckedFiles } from "./type-check-scope.js";
 
 export function extractDiagnosticMessage(messageText: string | ts.DiagnosticMessageChain): string {
-  return typeof messageText === "string" ? messageText : messageText.messageText;
+  return true ? messageText : messageText.messageText;
 }
 
killedBy: getTypeErrors operation single file mode (file param provided) returns only the top-level message for chained diagnostics, not the full chain
statusReason: expected [] to include 'not assignable to type \'(x: string) …'

[Killed] ConditionalExpression
src/ts-engine/get-type-errors.ts:10:10
 import { describeCheckedScope, typeCheckedFiles } from "./type-check-scope.js";
 
 export function extractDiagnosticMessage(messageText: string | ts.DiagnosticMessageChain): string {
-  return typeof messageText === "string" ? messageText : messageText.messageText;
+  return false ? messageText : messageText.messageText;
 }
 
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:15:19
 
 export function toDiagnostic(
   d: ReturnType<ts.LanguageService["getSemanticDiagnostics"]>[number],
-): TypeDiagnostic {
-  const sourceFile = d.file;
-  const file = sourceFile?.fileName ?? "";
-  let line = 1;
-  let col = 1;
-  if (sourceFile !== undefined && d.start !== undefined) {
-    const lc = ts.getLineAndCharacterOfPosition(sourceFile, d.start);
-    line = lc.line + 1;
-    col = lc.character + 1;
-  }
-  return { file, line, col, code: d.code, message: extractDiagnosticMessage(d.messageText) };
-}
+): TypeDiagnostic {}
 
 /**
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: Cannot read properties of undefined (reading 'file')

[Killed] OptionalChaining
src/ts-engine/get-type-errors.ts:17:16
   d: ReturnType<ts.LanguageService["getSemanticDiagnostics"]>[number],
 ): TypeDiagnostic {
   const sourceFile = d.file;
-  const file = sourceFile?.fileName ?? "";
+  const file = sourceFile.fileName ?? "";
   let line = 1;
   let col = 1;
killedBy: capDiagnostics reports the true total and flags truncation once past the cap
statusReason: Cannot read properties of undefined (reading 'fileName')

[Killed] LogicalOperator
src/ts-engine/get-type-errors.ts:17:16
   d: ReturnType<ts.LanguageService["getSemanticDiagnostics"]>[number],
 ): TypeDiagnostic {
   const sourceFile = d.file;
-  const file = sourceFile?.fileName ?? "";
+  const file = sourceFile?.fileName && "";
   let line = 1;
   let col = 1;
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: expected '' to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] EqualityOperator
src/ts-engine/get-type-errors.ts:20:7
   const file = sourceFile?.fileName ?? "";
   let line = 1;
   let col = 1;
-  if (sourceFile !== undefined && d.start !== undefined) {
+  if (sourceFile === undefined && d.start !== undefined) {
     const lc = ts.getLineAndCharacterOfPosition(sourceFile, d.start);
     line = lc.line + 1;
killedBy: getTypeErrors operation single file mode (file param provided) pins the exact error codes, positions and messages for broken.ts
statusReason: expected { …(5) } to match object { line: 6, col: 17, code: 2345, …(1) }
(1 matching property omitted from actual)

[Killed] LogicalOperator
src/ts-engine/get-type-errors.ts:20:7
   const file = sourceFile?.fileName ?? "";
   let line = 1;
   let col = 1;
-  if (sourceFile !== undefined && d.start !== undefined) {
+  if (sourceFile !== undefined || d.start !== undefined) {
     const lc = ts.getLineAndCharacterOfPosition(sourceFile, d.start);
     line = lc.line + 1;
killedBy: toDiagnostic falls back to 1:1 for a file-level diagnostic that names a file but no offset
statusReason: Debug Failure. False expression: position cannot precede the beginning of the file

[Killed] ArithmeticOperator
src/ts-engine/get-type-errors.ts:22:12
   let col = 1;
   if (sourceFile !== undefined && d.start !== undefined) {
     const lc = ts.getLineAndCharacterOfPosition(sourceFile, d.start);
-    line = lc.line + 1;
+    line = lc.line - 1;
     col = lc.character + 1;
   }
killedBy: getTypeErrors operation single file mode (file param provided) pins the exact error codes, positions and messages for broken.ts
statusReason: expected { …(5) } to match object { line: 6, col: 17, code: 2345, …(1) }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/ts-engine/get-type-errors.ts:23:11
   if (sourceFile !== undefined && d.start !== undefined) {
     const lc = ts.getLineAndCharacterOfPosition(sourceFile, d.start);
     line = lc.line + 1;
-    col = lc.character + 1;
+    col = lc.character - 1;
   }
   return { file, line, col, code: d.code, message: extractDiagnosticMessage(d.messageText) };
killedBy: getTypeErrors operation single file mode (file param provided) pins the exact error codes, positions and messages for broken.ts
statusReason: expected { …(5) } to match object { line: 6, col: 17, code: 2345, …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:37:100
 export function semanticErrors(
   ls: Pick<ts.LanguageService, "getSemanticDiagnostics">,
   fileName: string,
-): ts.Diagnostic[] {
-  return ls
-    .getSemanticDiagnostics(fileName)
-    .filter((d) => d.category === ts.DiagnosticCategory.Error);
-}
+): ts.Diagnostic[] {{}
 
 /**
killedBy: setExport scenarios adds the export keyword to a function declaration
statusReason: response: expected { status: 'error', …(3) } to deeply equal { status: 'success', …(6) }

[Killed] MethodExpression
src/ts-engine/get-type-errors.ts:38:10
   ls: Pick<ts.LanguageService, "getSemanticDiagnostics">,
   fileName: string,
 ): ts.Diagnostic[] {
-  return ls
-    .getSemanticDiagnostics(fileName)
-    .filter((d) => d.category === ts.DiagnosticCategory.Error);
+  return ls.getSemanticDiagnostics(fileName);
 }
 
statusReason: expected { …(3) } to deeply equal { diagnostics: [], …(2) }

[Killed] ArrowFunction
src/ts-engine/get-type-errors.ts:40:13
 ): ts.Diagnostic[] {
   return ls
     .getSemanticDiagnostics(fileName)
-    .filter((d) => d.category === ts.DiagnosticCategory.Error);
+    .filter(() => undefined);
 }
 
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: expected +0 to be 3 // Object.is equality

[Killed] EqualityOperator
src/ts-engine/get-type-errors.ts:40:20
 ): ts.Diagnostic[] {
   return ls
     .getSemanticDiagnostics(fileName)
-    .filter((d) => d.category === ts.DiagnosticCategory.Error);
+    .filter((d) => d.category !== ts.DiagnosticCategory.Error);
 }
 
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:48:78
  * shape. `errorCount` stays the true total, so a caller can tell that results
  * were trimmed rather than that fewer errors existed.
  */
-export function capDiagnostics(errors: ts.Diagnostic[]): GetTypeErrorsResult {
-  return {
-    diagnostics: errors.slice(0, MAX_DIAGNOSTICS).map(toDiagnostic),
-    errorCount: errors.length,
-    truncated: errors.length > MAX_DIAGNOSTICS,
-  };
-}
+export function capDiagnostics(errors: ts.Diagnostic[]): GetTypeErrorsResult {}
 
 function tsGetTypeErrorsForFile(compiler: TsMorphEngine, absPath: string): GetTypeErrorsResult {
statusReason: expected undefined to deeply equal { diagnostics: [ { …(5) } ], …(2) }

[Killed] ObjectLiteral
src/ts-engine/get-type-errors.ts:49:10
  * were trimmed rather than that fewer errors existed.
  */
 export function capDiagnostics(errors: ts.Diagnostic[]): GetTypeErrorsResult {
-  return {
-    diagnostics: errors.slice(0, MAX_DIAGNOSTICS).map(toDiagnostic),
-    errorCount: errors.length,
-    truncated: errors.length > MAX_DIAGNOSTICS,
-  };
+  return {};
 }
 
statusReason: expected {} to deeply equal { diagnostics: [ { …(5) } ], …(2) }

[Killed] MethodExpression
src/ts-engine/get-type-errors.ts:50:18
  */
 export function capDiagnostics(errors: ts.Diagnostic[]): GetTypeErrorsResult {
   return {
-    diagnostics: errors.slice(0, MAX_DIAGNOSTICS).map(toDiagnostic),
+    diagnostics: errors.map(toDiagnostic),
     errorCount: errors.length,
     truncated: errors.length > MAX_DIAGNOSTICS,
statusReason: expected [ …(101) ] to have a length of 100 but got 101

[Killed] EqualityOperator
src/ts-engine/get-type-errors.ts:52:16
   return {
     diagnostics: errors.slice(0, MAX_DIAGNOSTICS).map(toDiagnostic),
     errorCount: errors.length,
-    truncated: errors.length > MAX_DIAGNOSTICS,
+    truncated: errors.length <= MAX_DIAGNOSTICS,
   };
 }
statusReason: expected { diagnostics: [ { …(5) } ], …(2) } to deeply equal { diagnostics: [ { …(5) } ], …(2) }

[Killed] EqualityOperator
src/ts-engine/get-type-errors.ts:52:16
   return {
     diagnostics: errors.slice(0, MAX_DIAGNOSTICS).map(toDiagnostic),
     errorCount: errors.length,
-    truncated: errors.length > MAX_DIAGNOSTICS,
+    truncated: errors.length >= MAX_DIAGNOSTICS,
   };
 }
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:77:177
   const walked = program.getSourceFiles().map((sf) => sf.fileName);
   const checked = typeCheckedFiles(seed, seed === null ? walked : [], program);
   const allErrors: ts.Diagnostic[] = [];
-  for (const filePath of checked) {
-    // getSemanticDiagnostics throws for a path outside the compiled program, and
-    // addWorkspaceFiles deliberately adds files the program excludes (.js with allowJs unset)
-    // so that a move can still repoint their imports.
-    if (!program.getSourceFile(filePath)) continue;
-    allErrors.push(...semanticErrors(ls, filePath));
-  }
+  for (const filePath of checked) {{}
   return {
     ...capDiagnostics(allErrors),
killedBy: getTypeErrors operation project-wide mode (no file param) returns errors from all files in the project
statusReason: expected 0 to be greater than 100

[Killed] ConditionalExpression
src/ts-engine/get-type-errors.ts:81:9
     // getSemanticDiagnostics throws for a path outside the compiled program, and
     // addWorkspaceFiles deliberately adds files the program excludes (.js with allowJs unset)
     // so that a move can still repoint their imports.
-    if (!program.getSourceFile(filePath)) continue;
+    if (true) continue;
     allErrors.push(...semanticErrors(ls, filePath));
   }
killedBy: getTypeErrors operation project-wide mode (no file param) returns errors from all files in the project
statusReason: expected 0 to be greater than 100

[Killed] BooleanLiteral
src/ts-engine/get-type-errors.ts:81:9
     // getSemanticDiagnostics throws for a path outside the compiled program, and
     // addWorkspaceFiles deliberately adds files the program excludes (.js with allowJs unset)
     // so that a move can still repoint their imports.
-    if (!program.getSourceFile(filePath)) continue;
+    if (program.getSourceFile(filePath)) continue;
     allErrors.push(...semanticErrors(ls, filePath));
   }
killedBy: getTypeErrors operation project-wide mode (no file param) returns errors from all files in the project
statusReason: expected 0 to be greater than 100

[Killed] CallExpression
src/ts-engine/get-type-errors.ts:82:5
     // addWorkspaceFiles deliberately adds files the program excludes (.js with allowJs unset)
     // so that a move can still repoint their imports.
     if (!program.getSourceFile(filePath)) continue;
-    allErrors.push(...semanticErrors(ls, filePath));
+    ;
   }
   return {
killedBy: getTypeErrors operation project-wide mode (no file param) returns errors from all files in the project
statusReason: expected 0 to be greater than 100

[Killed] ConditionalExpression
src/ts-engine/get-type-errors.ts:96:7
   scope: WorkspaceScope,
   explicitTsConfig: string | null = null,
 ): GetTypeErrorsResult {
-  if (file !== undefined) {
+  if (true) {
     return tsGetTypeErrorsForFile(compiler, file);
   }
killedBy: getTypeErrors operation project-wide mode (no file param) returns errors from all files in the project
statusReason: The "paths[0]" argument must be of type string. Received undefined

[Killed] BlockStatement
src/ts-engine/get-type-errors.ts:96:27
   scope: WorkspaceScope,
   explicitTsConfig: string | null = null,
 ): GetTypeErrorsResult {
-  if (file !== undefined) {
-    return tsGetTypeErrorsForFile(compiler, file);
-  }
+  if (file !== undefined) {}
   return tsGetTypeErrorsForProject(compiler, scope.root, explicitTsConfig);
 }
killedBy: getTypeErrors operation single file mode (file param provided) returns type errors with correct shape for a file with errors
statusReason: expected 109 to be 3 // Object.is equality
