[Killed] BlockStatement
src/daemon/paths.ts:17:55
  */
 const defaultFs = new NodeFileSystem();
 
-function workspaceHash(workspaceRoot: string): string {
-  let canonical = workspaceRoot;
-  try {
-    canonical = fs.realpathSync(workspaceRoot);
-  } catch {
-    // Path doesn't exist yet or filesystem doesn't support symlinks — use as-is.
-  }
-  return crypto.createHash("sha1").update(canonical).digest("hex").slice(0, 16);
-}
+function workspaceHash(workspaceRoot: string): string {}
 
 export function socketPath(workspaceRoot: string): string {
statusReason: expected '/Users/dan/.cache/weaver/undefined.so…' not to be '/Users/dan/.cache/weaver/undefined.so…' // Object.is equality

[Survived] BlockStatement
src/daemon/paths.ts:19:7
 
 function workspaceHash(workspaceRoot: string): string {
   let canonical = workspaceRoot;
-  try {
-    canonical = fs.realpathSync(workspaceRoot);
-  } catch {
+  try {} catch {
     // Path doesn't exist yet or filesystem doesn't support symlinks — use as-is.
   }

[Survived] MethodExpression
src/daemon/paths.ts:24:10
   } catch {
     // Path doesn't exist yet or filesystem doesn't support symlinks — use as-is.
   }
-  return crypto.createHash("sha1").update(canonical).digest("hex").slice(0, 16);
+  return crypto.createHash("sha1").update(canonical).digest("hex");
 }
 

[Killed] BlockStatement
src/daemon/paths.ts:27:59
   return crypto.createHash("sha1").update(canonical).digest("hex").slice(0, 16);
 }
 
-export function socketPath(workspaceRoot: string): string {
-  return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.sock`);
-}
+export function socketPath(workspaceRoot: string): string {}
 
 export function lockfilePath(workspaceRoot: string): string {
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
src/daemon/paths.ts:31:61
   return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.sock`);
 }
 
-export function lockfilePath(workspaceRoot: string): string {
-  return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.pid`);
-}
+export function lockfilePath(workspaceRoot: string): string {}
 
 export function logfilePath(workspaceRoot: string): string {
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
src/daemon/paths.ts:35:60
   return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.pid`);
 }
 
-export function logfilePath(workspaceRoot: string): string {
-  return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.log`);
-}
+export function logfilePath(workspaceRoot: string): string {}
 
 export function ensureCacheDir(fs: FileSystem = defaultFs): void {
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
src/daemon/paths.ts:39:66
   return path.join(CACHE_DIR, `${workspaceHash(workspaceRoot)}.log`);
 }
 
-export function ensureCacheDir(fs: FileSystem = defaultFs): void {
-  fs.mkdir(CACHE_DIR, { recursive: true });
-}
+export function ensureCacheDir(fs: FileSystem = defaultFs): void {}
 
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/daemon/paths.ts:40:36
 }
 
 export function ensureCacheDir(fs: FileSystem = defaultFs): void {
-  fs.mkdir(CACHE_DIR, { recursive: true });
+  fs.mkdir(CACHE_DIR, { recursive: false });
 }
 
