[Killed] BooleanLiteral
src/daemon/ensure-daemon.ts:17:21
  * One check per CLI process is enough: a process is short-lived and the build
  * cannot meaningfully change underneath it mid-invocation.
  */
-let buildVerified = false;
+let buildVerified = true;
 
 /**
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Killed] LogicalOperator
src/daemon/ensure-daemon.ts:42:7
   const sockPath = socketPath(absWorkspace);
 
   // If socket file exists but process is dead, remove stale files
-  if (fs.exists(sockPath) && !isDaemonAlive(absWorkspace, fs)) {
+  if (fs.exists(sockPath) || !isDaemonAlive(absWorkspace, fs)) {
     removeDaemonFiles(absWorkspace, fs);
     buildVerified = false;
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/test/workspace",

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:42:7
   const sockPath = socketPath(absWorkspace);
 
   // If socket file exists but process is dead, remove stale files
-  if (fs.exists(sockPath) && !isDaemonAlive(absWorkspace, fs)) {
+  if (false) {
     removeDaemonFiles(absWorkspace, fs);
     buildVerified = false;
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Survived] BooleanLiteral
src/daemon/ensure-daemon.ts:44:21
   // If socket file exists but process is dead, remove stale files
   if (fs.exists(sockPath) && !isDaemonAlive(absWorkspace, fs)) {
     removeDaemonFiles(absWorkspace, fs);
-    buildVerified = false;
+    buildVerified = true;
   }
 

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:47:7
     buildVerified = false;
   }
 
-  if (isDaemonAlive(absWorkspace, fs)) {
+  if (false) {
     if (buildVerified) return;
 
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:47:40
     buildVerified = false;
   }
 
-  if (isDaemonAlive(absWorkspace, fs)) {
-    if (buildVerified) return;
-
-    // First contact with this daemon process — check it is running our build.
-    try {
-      const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
-      if (isSameBuild(ping.buildId, readBuildId())) {
-        buildVerified = true;
-        return;
-      }
-      // Daemon is running a build that is no longer on disk — kill it and
-      // fall through to respawn, which sets the flag for the new process.
-      await stopDaemon(absWorkspace, { fs });
-    } catch {
-      // Ping failed unexpectedly; proceed without respawning to preserve
-      // existing behaviour for callers that were already mid-flight.
-      buildVerified = true;
-      return;
-    }
-  }
+  if (isDaemonAlive(absWorkspace, fs)) {}
 
   // Auto-spawn the daemon as a detached child so it outlives this process.
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:48:9
   }
 
   if (isDaemonAlive(absWorkspace, fs)) {
-    if (buildVerified) return;
+    if (false) return;
 
     // First contact with this daemon process — check it is running our build.
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:48:9
   }
 
   if (isDaemonAlive(absWorkspace, fs)) {
-    if (buildVerified) return;
+    if (true) return;
 
     // First contact with this daemon process — check it is running our build.
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:51:9
     if (buildVerified) return;
 
     // First contact with this daemon process — check it is running our build.
-    try {
-      const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
-      if (isSameBuild(ping.buildId, readBuildId())) {
-        buildVerified = true;
-        return;
-      }
-      // Daemon is running a build that is no longer on disk — kill it and
-      // fall through to respawn, which sets the flag for the new process.
-      await stopDaemon(absWorkspace, { fs });
-    } catch {
+    try {} catch {
       // Ping failed unexpectedly; proceed without respawning to preserve
       // existing behaviour for callers that were already mid-flight.
statusReason: Cannot read properties of undefined (reading 'stderr')

[Survived] ObjectLiteral
src/daemon/ensure-daemon.ts:52:47
 
     // First contact with this daemon process — check it is running our build.
     try {
-      const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
+      const ping = await callDaemon(sockPath, {}, 10_000);
       if (isSameBuild(ping.buildId, readBuildId())) {
         buildVerified = true;

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:53:11
     // First contact with this daemon process — check it is running our build.
     try {
       const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
-      if (isSameBuild(ping.buildId, readBuildId())) {
+      if (false) {
         buildVerified = true;
         return;
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:53:11
     // First contact with this daemon process — check it is running our build.
     try {
       const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
-      if (isSameBuild(ping.buildId, readBuildId())) {
+      if (true) {
         buildVerified = true;
         return;
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Killed] BooleanLiteral
src/daemon/ensure-daemon.ts:54:25
     try {
       const ping = await callDaemon(sockPath, { method: "ping", params: {} }, 10_000);
       if (isSameBuild(ping.buildId, readBuildId())) {
-        buildVerified = true;
+        buildVerified = false;
         return;
       }
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:60:13
       // Daemon is running a build that is no longer on disk — kill it and
       // fall through to respawn, which sets the flag for the new process.
       await stopDaemon(absWorkspace, { fs });
-    } catch {
-      // Ping failed unexpectedly; proceed without respawning to preserve
-      // existing behaviour for callers that were already mid-flight.
-      buildVerified = true;
-      return;
-    }
+    } catch {}
   }
 
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] BooleanLiteral
src/daemon/ensure-daemon.ts:63:23
     } catch {
       // Ping failed unexpectedly; proceed without respawning to preserve
       // existing behaviour for callers that were already mid-flight.
-      buildVerified = true;
+      buildVerified = false;
       return;
     }
statusReason: Cannot read properties of undefined (reading 'stderr')

[Survived] ConditionalExpression
src/daemon/ensure-daemon.ts:69:19
   }
 
   // Auto-spawn the daemon as a detached child so it outlives this process.
-  const verbose = process.env.WEAVER_VERBOSE === "1";
+  const verbose = false;
   await spawnDaemon(absWorkspace, { verbose });
   buildVerified = true;

[Survived] ConditionalExpression
src/daemon/ensure-daemon.ts:69:19
   }
 
   // Auto-spawn the daemon as a detached child so it outlives this process.
-  const verbose = process.env.WEAVER_VERBOSE === "1";
+  const verbose = true;
   await spawnDaemon(absWorkspace, { verbose });
   buildVerified = true;

[Killed] BooleanLiteral
src/daemon/ensure-daemon.ts:71:19
   // Auto-spawn the daemon as a detached child so it outlives this process.
   const verbose = process.env.WEAVER_VERBOSE === "1";
   await spawnDaemon(absWorkspace, { verbose });
-  buildVerified = true;
+  buildVerified = false;
 }
 
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/test/workspace",

[NoCoverage] BlockStatement
src/daemon/ensure-daemon.ts:85:32
 
     socket.setTimeout(timeoutMs);
 
-    socket.on("timeout", () => {
-      // destroy() with an error fires the "error" event, which calls reject.
-      socket.destroy(new Error(`callDaemon timed out after ${timeoutMs}ms`));
-    });
+    socket.on("timeout", () => {});
 
     socket.on("connect", () => {

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:90:32
       socket.destroy(new Error(`callDaemon timed out after ${timeoutMs}ms`));
     });
 
-    socket.on("connect", () => {
-      socket.write(`${JSON.stringify(req)}\n`);
-    });
+    socket.on("connect", () => {});
 
     socket.on("data", (chunk: Buffer) => {
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:94:42
       socket.write(`${JSON.stringify(req)}\n`);
     });
 
-    socket.on("data", (chunk: Buffer) => {
-      buf += chunk.toString();
-      const nl = buf.indexOf("\n");
-      if (nl !== -1) {
-        try {
-          resolve(JSON.parse(buf.slice(0, nl)));
-        } catch (e) {
-          reject(e);
-        }
-        socket.destroy();
-      }
-    });
+    socket.on("data", (chunk: Buffer) => {});
 
     socket.on("error", reject);
statusReason: Test timed out in 60000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:97:22
     socket.on("data", (chunk: Buffer) => {
       buf += chunk.toString();
       const nl = buf.indexOf("\n");
-      if (nl !== -1) {
-        try {
-          resolve(JSON.parse(buf.slice(0, nl)));
-        } catch (e) {
-          reject(e);
-        }
-        socket.destroy();
-      }
+      if (nl !== -1) {}
     });
 
statusReason: Test timed out in 60000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:97:11
     socket.on("data", (chunk: Buffer) => {
       buf += chunk.toString();
       const nl = buf.indexOf("\n");
-      if (nl !== -1) {
+      if (false) {
         try {
           resolve(JSON.parse(buf.slice(0, nl)));
statusReason: Test timed out in 60000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:98:13
       buf += chunk.toString();
       const nl = buf.indexOf("\n");
       if (nl !== -1) {
-        try {
-          resolve(JSON.parse(buf.slice(0, nl)));
-        } catch (e) {
+        try {} catch (e) {
           reject(e);
         }
statusReason: Test timed out in 60000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] MethodExpression
src/daemon/ensure-daemon.ts:99:30
       const nl = buf.indexOf("\n");
       if (nl !== -1) {
         try {
-          resolve(JSON.parse(buf.slice(0, nl)));
+          resolve(JSON.parse(buf));
         } catch (e) {
           reject(e);

[NoCoverage] BlockStatement
src/daemon/ensure-daemon.ts:100:21
       if (nl !== -1) {
         try {
           resolve(JSON.parse(buf.slice(0, nl)));
-        } catch (e) {
-          reject(e);
-        }
+        } catch (e) {}
         socket.destroy();
       }

[Survived] ConditionalExpression
src/daemon/ensure-daemon.ts:114:9
 function spawnDaemon(absWorkspace: string, opts: { verbose?: boolean } = {}): Promise<void> {
   return new Promise((resolve, reject) => {
     const args = [CLI_ENTRY, "daemon", "--workspace", absWorkspace];
-    if (opts.verbose) args.push("--verbose");
+    if (true) args.push("--verbose");
     const child = spawn(process.execPath, args, {
       stdio: ["ignore", "ignore", "pipe"],

[Survived] ConditionalExpression
src/daemon/ensure-daemon.ts:114:9
 function spawnDaemon(absWorkspace: string, opts: { verbose?: boolean } = {}): Promise<void> {
   return new Promise((resolve, reject) => {
     const args = [CLI_ENTRY, "daemon", "--workspace", absWorkspace];
-    if (opts.verbose) args.push("--verbose");
+    if (false) args.push("--verbose");
     const child = spawn(process.execPath, args, {
       stdio: ["ignore", "ignore", "pipe"],

[Killed] BooleanLiteral
src/daemon/ensure-daemon.ts:117:17
     if (opts.verbose) args.push("--verbose");
     const child = spawn(process.execPath, args, {
       stdio: ["ignore", "ignore", "pipe"],
-      detached: true,
+      detached: false,
     });
 
statusReason: expected { stdio: [ 'ignore', …(2) ], …(1) } to match object { stdio: [ 'ignore', …(2) ], …(1) }

[NoCoverage] BlockStatement
src/daemon/ensure-daemon.ts:123:36
     let stderrBuf = "";
     let consumed = 0;
 
-    const timer = setTimeout(() => {
-      reject(new Error("Timed out waiting for daemon ready signal"));
-    }, 30_000);
+    const timer = setTimeout(() => {}, 30_000);
 
     const onExit = (code: number | null) => {

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:127:45
       reject(new Error("Timed out waiting for daemon ready signal"));
     }, 30_000);
 
-    const onExit = (code: number | null) => {
-      clearTimeout(timer);
-      reject(new Error(`Daemon exited unexpectedly with code ${code}`));
-    };
+    const onExit = (code: number | null) => {};
 
     const onData = (chunk: Buffer) => {
statusReason: expected [Function] to throw error matching /exited unexpectedly/i but got 'Timed out waiting for daemon ready si…'

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:132:39
       reject(new Error(`Daemon exited unexpectedly with code ${code}`));
     };
 
-    const onData = (chunk: Buffer) => {
-      stderrBuf += chunk.toString();
-      while (stderrBuf.indexOf("\n", consumed) !== -1) {
-        const newline = stderrBuf.indexOf("\n", consumed);
-        const line = stderrBuf.slice(consumed, newline).trim();
-        consumed = newline + 1;
-        try {
-          const msg = JSON.parse(line);
-          if (msg.status === "ready") {
-            clearTimeout(timer);
-            child.stderr.off("data", onData);
-            child.off("exit", onExit);
-            // The piped stderr is a separate handle from the child process;
-            // unref() alone leaves it active and hangs the parent's event loop.
-            child.stderr.destroy();
-            child.unref();
-            resolve();
-            return;
-          }
-        } catch {
-          // not JSON, ignore
-        }
-      }
-    };
+    const onData = (chunk: Buffer) => {};
 
     child.stderr.on("data", onData);
statusReason: Timed out waiting for daemon ready signal

[Killed] AssignmentOperator
src/daemon/ensure-daemon.ts:133:7
     };
 
     const onData = (chunk: Buffer) => {
-      stderrBuf += chunk.toString();
+      stderrBuf -= chunk.toString();
       while (stderrBuf.indexOf("\n", consumed) !== -1) {
         const newline = stderrBuf.indexOf("\n", consumed);
statusReason: Timed out waiting for daemon ready signal

[Killed] EqualityOperator
src/daemon/ensure-daemon.ts:134:14
 
     const onData = (chunk: Buffer) => {
       stderrBuf += chunk.toString();
-      while (stderrBuf.indexOf("\n", consumed) !== -1) {
+      while (stderrBuf.indexOf("\n", consumed) === -1) {
         const newline = stderrBuf.indexOf("\n", consumed);
         const line = stderrBuf.slice(consumed, newline).trim();
statusReason: Timed out waiting for daemon ready signal

[Killed] ConditionalExpression
src/daemon/ensure-daemon.ts:134:14
 
     const onData = (chunk: Buffer) => {
       stderrBuf += chunk.toString();
-      while (stderrBuf.indexOf("\n", consumed) !== -1) {
+      while (false) {
         const newline = stderrBuf.indexOf("\n", consumed);
         const line = stderrBuf.slice(consumed, newline).trim();
statusReason: Timed out waiting for daemon ready signal

[Survived] MethodExpression
src/daemon/ensure-daemon.ts:136:22
       stderrBuf += chunk.toString();
       while (stderrBuf.indexOf("\n", consumed) !== -1) {
         const newline = stderrBuf.indexOf("\n", consumed);
-        const line = stderrBuf.slice(consumed, newline).trim();
+        const line = stderrBuf.slice(consumed, newline);
         consumed = newline + 1;
         try {

[Survived] MethodExpression
src/daemon/ensure-daemon.ts:136:22
       stderrBuf += chunk.toString();
       while (stderrBuf.indexOf("\n", consumed) !== -1) {
         const newline = stderrBuf.indexOf("\n", consumed);
-        const line = stderrBuf.slice(consumed, newline).trim();
+        const line = stderrBuf.trim();
         consumed = newline + 1;
         try {

[Timeout] ArithmeticOperator
src/daemon/ensure-daemon.ts:137:20
       while (stderrBuf.indexOf("\n", consumed) !== -1) {
         const newline = stderrBuf.indexOf("\n", consumed);
         const line = stderrBuf.slice(consumed, newline).trim();
-        consumed = newline + 1;
+        consumed = newline - 1;
         try {
           const msg = JSON.parse(line);

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:138:13
         const newline = stderrBuf.indexOf("\n", consumed);
         const line = stderrBuf.slice(consumed, newline).trim();
         consumed = newline + 1;
-        try {
-          const msg = JSON.parse(line);
-          if (msg.status === "ready") {
-            clearTimeout(timer);
-            child.stderr.off("data", onData);
-            child.off("exit", onExit);
-            // The piped stderr is a separate handle from the child process;
-            // unref() alone leaves it active and hangs the parent's event loop.
-            child.stderr.destroy();
-            child.unref();
-            resolve();
-            return;
-          }
-        } catch {
+        try {} catch {
           // not JSON, ignore
         }
statusReason: Timed out waiting for daemon ready signal

[Killed] EqualityOperator
src/daemon/ensure-daemon.ts:140:15
         consumed = newline + 1;
         try {
           const msg = JSON.parse(line);
-          if (msg.status === "ready") {
+          if (msg.status !== "ready") {
             clearTimeout(timer);
             child.stderr.off("data", onData);
statusReason: Timed out waiting for daemon ready signal

[Killed] BlockStatement
src/daemon/ensure-daemon.ts:140:39
         consumed = newline + 1;
         try {
           const msg = JSON.parse(line);
-          if (msg.status === "ready") {
-            clearTimeout(timer);
-            child.stderr.off("data", onData);
-            child.off("exit", onExit);
-            // The piped stderr is a separate handle from the child process;
-            // unref() alone leaves it active and hangs the parent's event loop.
-            child.stderr.destroy();
-            child.unref();
-            resolve();
-            return;
-          }
+          if (msg.status === "ready") {}
         } catch {
           // not JSON, ignore
statusReason: Timed out waiting for daemon ready signal
