[Killed] BlockStatement
src/utils/ts-project.ts:14:63
  * resetDiscoveryCaches, so it is fresh within a dispatch but not guaranteed empty between
  * dispatches — watcher callbacks and refreshFile's own lookups can repopulate it while idle.
  */
-export function findTsConfig(startDir: string): string | null {
-  const normalised = path.resolve(startDir);
-
-  if (cache.has(normalised)) {
-    // biome-ignore lint/style/noNonNullAssertion: guarded by .has() above
-    return cache.get(normalised)!;
-  }
-
-  let dir = normalised;
-  while (true) {
-    const candidate = path.join(dir, "tsconfig.json");
-    if (fs.existsSync(candidate)) {
-      cache.set(normalised, candidate);
-      return candidate;
-    }
-    const parent = path.dirname(dir);
-    if (parent === dir) {
-      // Reached filesystem root
-      cache.set(normalised, null);
-      return null;
-    }
-    dir = parent;
-  }
-}
+export function findTsConfig(startDir: string): string | null {}
 
 /** Cache key standing in for "no tsconfig above this file", which is not a path. */
statusReason: expected 0 to be greater than 100

[Killed] ConditionalExpression
src/utils/ts-project.ts:17:7
 export function findTsConfig(startDir: string): string | null {
   const normalised = path.resolve(startDir);
 
-  if (cache.has(normalised)) {
+  if (true) {
     // biome-ignore lint/style/noNonNullAssertion: guarded by .has() above
     return cache.get(normalised)!;
statusReason: expected 0 to be greater than 100

[Killed] BlockStatement
src/utils/ts-project.ts:17:30
 export function findTsConfig(startDir: string): string | null {
   const normalised = path.resolve(startDir);
 
-  if (cache.has(normalised)) {
-    // biome-ignore lint/style/noNonNullAssertion: guarded by .has() above
-    return cache.get(normalised)!;
-  }
+  if (cache.has(normalised)) {}
 
   let dir = normalised;
killedBy: findTsConfig caches a found tsconfig — second call returns same path even after file is deleted
statusReason: expected null to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] BooleanLiteral
src/utils/ts-project.ts:23:10
   }
 
   let dir = normalised;
-  while (true) {
+  while (false) {
     const candidate = path.join(dir, "tsconfig.json");
     if (fs.existsSync(candidate)) {
killedBy: findTsConfig returns the tsconfig.json path when present in the start directory
statusReason: expected undefined to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] BlockStatement
src/utils/ts-project.ts:25:35
   let dir = normalised;
   while (true) {
     const candidate = path.join(dir, "tsconfig.json");
-    if (fs.existsSync(candidate)) {
-      cache.set(normalised, candidate);
-      return candidate;
-    }
+    if (fs.existsSync(candidate)) {}
     const parent = path.dirname(dir);
     if (parent === dir) {
killedBy: findTsConfig returns the tsconfig.json path when present in the start directory
statusReason: expected null to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] ConditionalExpression
src/utils/ts-project.ts:25:9
   let dir = normalised;
   while (true) {
     const candidate = path.join(dir, "tsconfig.json");
-    if (fs.existsSync(candidate)) {
+    if (false) {
       cache.set(normalised, candidate);
       return candidate;
killedBy: findTsConfig returns the tsconfig.json path when present in the start directory
statusReason: expected null to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] ConditionalExpression
src/utils/ts-project.ts:30:9
       return candidate;
     }
     const parent = path.dirname(dir);
-    if (parent === dir) {
+    if (true) {
       // Reached filesystem root
       cache.set(normalised, null);
killedBy: findTsConfig walks up directories to find tsconfig.json in a parent
statusReason: expected null to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] BlockStatement
src/utils/ts-project.ts:54:70
 /**
  * Find tsconfig.json starting from the directory containing the given file.
  */
-export function findTsConfigForFile(filePath: string): string | null {
-  return findTsConfig(path.dirname(path.resolve(filePath)));
-}
+export function findTsConfigForFile(filePath: string): string | null {}
 
 /**
killedBy: findTsConfigForFile finds tsconfig.json starting from the directory containing the file
statusReason: expected undefined to be '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' // Object.is equality

[Killed] ConditionalExpression
src/utils/ts-project.ts:70:7
 
 export function isVueProject(tsConfigPath: string): boolean {
   const projectRoot = path.dirname(tsConfigPath);
-  if (vueProjectCache.has(projectRoot)) {
+  if (false) {
     // biome-ignore lint/style/noNonNullAssertion: guarded by .has() above
     return vueProjectCache.get(projectRoot)!;
killedBy: isVueProject caches a true result — second call returns true even after .vue file is deleted
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/ts-project.ts:70:7
 
 export function isVueProject(tsConfigPath: string): boolean {
   const projectRoot = path.dirname(tsConfigPath);
-  if (vueProjectCache.has(projectRoot)) {
+  if (true) {
     // biome-ignore lint/style/noNonNullAssertion: guarded by .has() above
     return vueProjectCache.get(projectRoot)!;
killedBy: isVueProject returns true when .vue files are present in the project root
statusReason: expected undefined to be true // Object.is equality

[Survived] BooleanLiteral
src/utils/ts-project.ts:111:332
         return true;
       }
     }
-    vueProjectCache.set(projectRoot, false);
+    vueProjectCache.set(projectRoot, false);false
     return false;
   }

[Killed] BlockStatement
src/utils/ts-project.ts:125:46
  * start of each dispatched request — see the memo doc comments above for the freshness guarantee
  * this provides.
  */
-export function resetDiscoveryCaches(): void {
-  cache.clear();
-  vueProjectCache.clear();
-}
+export function resetDiscoveryCaches(): void {}
 
killedBy: findTsConfig reads the filesystem again after resetDiscoveryCaches, reflecting a deletion made since the cached call
statusReason: expected '/var/folders/j_/4vzbl4c11_sfh12v5gqfg…' to be null
