[Killed] BlockStatement
src/daemon/build-id.ts:25:46
  * Returns null when the entry cannot be read. Callers treat that as a mismatch:
  * a build we cannot identify is not one we can vouch for.
  */
-export function readBuildId(): number | null {
-  try {
-    return fs.statSync(CLI_ENTRY).mtimeMs;
-  } catch {
-    return null;
-  }
-}
+export function readBuildId(): number | null {}
 
 /**
killedBy: readBuildId returns the entry file's modification time
statusReason: expected undefined to be 1700000000000 // Object.is equality

[Killed] BlockStatement
src/daemon/build-id.ts:26:7
  * a build we cannot identify is not one we can vouch for.
  */
 export function readBuildId(): number | null {
-  try {
-    return fs.statSync(CLI_ENTRY).mtimeMs;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: readBuildId returns the entry file's modification time
statusReason: expected undefined to be 1700000000000 // Object.is equality

[Killed] BlockStatement
src/daemon/build-id.ts:28:11
 export function readBuildId(): number | null {
   try {
     return fs.statSync(CLI_ENTRY).mtimeMs;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: readBuildId returns null when the entry cannot be read
statusReason: expected undefined to be null

[Killed] BlockStatement
src/daemon/build-id.ts:43:91
  * running process, so it always stats. It happens when tests run src directly,
  * where it is harmless — neither side has a build to be stale against.
  */
-export function isSameBuild(daemonBuildId: unknown, localBuildId: number | null): boolean {
-  return daemonBuildId === localBuildId;
-}
+export function isSameBuild(daemonBuildId: unknown, localBuildId: number | null): boolean {}
 
statusReason: Cannot read properties of undefined (reading 'stderr')

[Killed] ConditionalExpression
src/daemon/build-id.ts:44:10
  * where it is harmless — neither side has a build to be stale against.
  */
 export function isSameBuild(daemonBuildId: unknown, localBuildId: number | null): boolean {
-  return daemonBuildId === localBuildId;
+  return true;
 }
 
statusReason: expected "vi.fn()" to be called with arguments: [ '/test/workspace' ]

Number of calls: 0

[Killed] ConditionalExpression
src/daemon/build-id.ts:44:10
  * where it is harmless — neither side has a build to be stale against.
  */
 export function isSameBuild(daemonBuildId: unknown, localBuildId: number | null): boolean {
-  return daemonBuildId === localBuildId;
+  return false;
 }
 
statusReason: Cannot read properties of undefined (reading 'stderr')
