[Killed] BlockStatement
src/operations/searchText.ts:11:52
 const DEFAULT_MAX_RESULTS = 500;
 
 /** Return true if the string content appears to be binary (contains a null character). */
-function isBinaryContent(content: string): boolean {
-  const checkLen = Math.min(content.length, 512);
-  for (let i = 0; i < checkLen; i++) {
-    if (content.charCodeAt(i) === 0) return true;
-  }
-  return false;
-}
+function isBinaryContent(content: string): boolean {}
 
 /**
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/operations/searchText.ts:12:20
 
 /** Return true if the string content appears to be binary (contains a null character). */
 function isBinaryContent(content: string): boolean {
-  const checkLen = Math.min(content.length, 512);
+  const checkLen = Math.max(content.length, 512);
   for (let i = 0; i < checkLen; i++) {
     if (content.charCodeAt(i) === 0) return true;

[Killed] BlockStatement
src/operations/searchText.ts:13:38
 /** Return true if the string content appears to be binary (contains a null character). */
 function isBinaryContent(content: string): boolean {
   const checkLen = Math.min(content.length, 512);
-  for (let i = 0; i < checkLen; i++) {
-    if (content.charCodeAt(i) === 0) return true;
-  }
+  for (let i = 0; i < checkLen; i++) {}
   return false;
 }
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/operations/searchText.ts:13:19
 /** Return true if the string content appears to be binary (contains a null character). */
 function isBinaryContent(content: string): boolean {
   const checkLen = Math.min(content.length, 512);
-  for (let i = 0; i < checkLen; i++) {
+  for (let i = 0; false; i++) {
     if (content.charCodeAt(i) === 0) return true;
   }
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/operations/searchText.ts:14:45
 function isBinaryContent(content: string): boolean {
   const checkLen = Math.min(content.length, 512);
   for (let i = 0; i < checkLen; i++) {
-    if (content.charCodeAt(i) === 0) return true;
+    if (content.charCodeAt(i) === 0) return false;
   }
   return false;
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/operations/searchText.ts:14:9
 function isBinaryContent(content: string): boolean {
   const checkLen = Math.min(content.length, 512);
   for (let i = 0; i < checkLen; i++) {
-    if (content.charCodeAt(i) === 0) return true;
+    if (false) return true;
   }
   return false;
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/operations/searchText.ts:37:7
   const { glob, excludeGlob, context = 0, maxResults = DEFAULT_MAX_RESULTS } = opts;
 
   let re: RegExp;
-  try {
-    re = new RegExp(pattern, "g");
-  } catch {
+  try {} catch {
     throw new EngineError(`Invalid regex pattern: ${pattern}`, "PARSE_ERROR");
   }
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: Cannot set properties of undefined (setting 'lastIndex')

[Killed] BlockStatement
src/operations/searchText.ts:39:11
   let re: RegExp;
   try {
     re = new RegExp(pattern, "g");
-  } catch {
-    throw new EngineError(`Invalid regex pattern: ${pattern}`, "PARSE_ERROR");
-  }
+  } catch {}
   if (!safeRegex(re)) {
     throw new EngineError(
killedBy: searchText operation throws PARSE_ERROR for invalid regex
statusReason: expected TypeError: Cannot set properties of undef… to match object { code: 'PARSE_ERROR' }

[Killed] BooleanLiteral
src/operations/searchText.ts:42:7
   } catch {
     throw new EngineError(`Invalid regex pattern: ${pattern}`, "PARSE_ERROR");
   }
-  if (!safeRegex(re)) {
+  if (safeRegex(re)) {
     throw new EngineError(
       `Pattern rejected: potential ReDoS (catastrophic backtracking): ${pattern}`,
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: Pattern rejected: potential ReDoS (catastrophic backtracking): greetUser

[Killed] ConditionalExpression
src/operations/searchText.ts:42:7
   } catch {
     throw new EngineError(`Invalid regex pattern: ${pattern}`, "PARSE_ERROR");
   }
-  if (!safeRegex(re)) {
+  if (true) {
     throw new EngineError(
       `Pattern rejected: potential ReDoS (catastrophic backtracking): ${pattern}`,
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: Pattern rejected: potential ReDoS (catastrophic backtracking): greetUser

[Killed] BooleanLiteral
src/operations/searchText.ts:51:19
 
   const files = walkWorkspaceFiles(scope.root, { glob, excludeGlob, fs: scope.fs });
   const matches: SearchMatch[] = [];
-  let truncated = false;
+  let truncated = true;
 
   outer: for (const filePath of files) {
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/operations/searchText.ts:54:9
   let truncated = false;
 
   outer: for (const filePath of files) {
-    if (isSensitiveFile(filePath)) continue;
+    if (false) continue;
 
     let content: string;
killedBy: searchText operation skips sensitive files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/operations/searchText.ts:54:9
   let truncated = false;
 
   outer: for (const filePath of files) {
-    if (isSensitiveFile(filePath)) continue;
+    if (true) continue;
 
     let content: string;
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/operations/searchText.ts:57:9
     if (isSensitiveFile(filePath)) continue;
 
     let content: string;
-    try {
-      content = scope.fs.readFile(filePath);
-    } catch {
+    try {} catch {
       scope.recordSkipped(filePath);
       continue;
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/operations/searchText.ts:59:13
     let content: string;
     try {
       content = scope.fs.readFile(filePath);
-    } catch {
-      scope.recordSkipped(filePath);
-      continue;
-    }
+    } catch {}
     if (isBinaryContent(content)) continue;
 
killedBy: searchText operation records unreadable files as skipped
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/operations/searchText.ts:63:9
       scope.recordSkipped(filePath);
       continue;
     }
-    if (isBinaryContent(content)) continue;
+    if (true) continue;
 
     // Split into lines; trim the trailing empty string that results from a
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected 0 to be greater than or equal to 2

[Killed] ConditionalExpression
src/operations/searchText.ts:63:9
       scope.recordSkipped(filePath);
       continue;
     }
-    if (isBinaryContent(content)) continue;
+    if (false) continue;
 
     // Split into lines; trim the trailing empty string that results from a
killedBy: searchText operation skips binary files (files containing a null byte)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/operations/searchText.ts:69:7
     // final newline (virtually all text files end with one).
     const rawLines = content.split("\n");
     const lines =
-      rawLines.length > 0 && rawLines[rawLines.length - 1] === ""
+      rawLines.length <= 0 && rawLines[rawLines.length - 1] === ""
         ? rawLines.slice(0, -1)
         : rawLines;
killedBy: searchText operation trailing newline stripping: identical results for files with and without trailing newline
statusReason: expected 'aaa\nbbb\nccc\n' to be 'aaa\nbbb\nccc' // Object.is equality

[Killed] ConditionalExpression
src/operations/searchText.ts:69:7
     // final newline (virtually all text files end with one).
     const rawLines = content.split("\n");
     const lines =
-      rawLines.length > 0 && rawLines[rawLines.length - 1] === ""
+      true
         ? rawLines.slice(0, -1)
         : rawLines;
killedBy: searchText operation trailing newline stripping: identical results for files with and without trailing newline
statusReason: expected 'aaa\nbbb' to be 'aaa\nbbb\nccc' // Object.is equality

[Killed] MethodExpression
src/operations/searchText.ts:70:11
     const rawLines = content.split("\n");
     const lines =
       rawLines.length > 0 && rawLines[rawLines.length - 1] === ""
-        ? rawLines.slice(0, -1)
+        ? rawLines
         : rawLines;
 
killedBy: searchText operation trailing newline stripping: identical results for files with and without trailing newline
statusReason: expected 'aaa\nbbb\nccc\n' to be 'aaa\nbbb\nccc' // Object.is equality

[Killed] UnaryOperator
src/operations/searchText.ts:70:29
     const rawLines = content.split("\n");
     const lines =
       rawLines.length > 0 && rawLines[rawLines.length - 1] === ""
-        ? rawLines.slice(0, -1)
+        ? rawLines.slice(0, +1)
         : rawLines;
 
killedBy: searchText operation each match reports the correct matchText
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/operations/searchText.ts:73:27
         ? rawLines.slice(0, -1)
         : rawLines;
 
-    for (let lineIdx = 0; lineIdx < lines.length; lineIdx++) {
+    for (let lineIdx = 0; lineIdx >= lines.length; lineIdx++) {
       const lineText = lines[lineIdx];
       // Reset lastIndex for each line (the regex has the `g` flag)
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected 0 to be greater than or equal to 2

[Killed] EqualityOperator
src/operations/searchText.ts:73:27
         ? rawLines.slice(0, -1)
         : rawLines;
 
-    for (let lineIdx = 0; lineIdx < lines.length; lineIdx++) {
+    for (let lineIdx = 0; lineIdx <= lines.length; lineIdx++) {
       const lineText = lines[lineIdx];
       // Reset lastIndex for each line (the regex has the `g` flag)
killedBy: searchText operation zero-length match advances through all positions without skipping
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(10) ] to have a length of 3 but got 13

[Killed] EqualityOperator
src/operations/searchText.ts:79:14
       re.lastIndex = 0;
       let m: RegExpExecArray | null;
       // biome-ignore lint/suspicious/noAssignInExpressions: standard regex loop idiom
-      while ((m = re.exec(lineText)) !== null) {
+      while ((m = re.exec(lineText)) === null) {
         const lineNum = lineIdx + 1; // 1-based
         const colNum = m.index + 1; // 1-based
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: Cannot read properties of null (reading 'index')

[Killed] ConditionalExpression
src/operations/searchText.ts:79:14
       re.lastIndex = 0;
       let m: RegExpExecArray | null;
       // biome-ignore lint/suspicious/noAssignInExpressions: standard regex loop idiom
-      while ((m = re.exec(lineText)) !== null) {
+      while (false) {
         const lineNum = lineIdx + 1; // 1-based
         const colNum = m.index + 1; // 1-based
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected 0 to be greater than or equal to 2

[Killed] ArithmeticOperator
src/operations/searchText.ts:80:25
       let m: RegExpExecArray | null;
       // biome-ignore lint/suspicious/noAssignInExpressions: standard regex loop idiom
       while ((m = re.exec(lineText)) !== null) {
-        const lineNum = lineIdx + 1; // 1-based
+        const lineNum = lineIdx - 1; // 1-based
         const colNum = m.index + 1; // 1-based
 
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected -1 to be greater than 0

[Killed] ArithmeticOperator
src/operations/searchText.ts:81:24
       // biome-ignore lint/suspicious/noAssignInExpressions: standard regex loop idiom
       while ((m = re.exec(lineText)) !== null) {
         const lineNum = lineIdx + 1; // 1-based
-        const colNum = m.index + 1; // 1-based
+        const colNum = m.index - 1; // 1-based
 
         const match: SearchMatch = {
killedBy: searchText operation reports 1-based line and col
statusReason: expected 15 to be 17 // Object.is equality

[Killed] EqualityOperator
src/operations/searchText.ts:90:13
           matchText: m[0],
         };
 
-        if (context > 0) {
+        if (context >= 0) {
           const start = Math.max(0, lineIdx - context);
           const end = Math.min(lines.length - 1, lineIdx + context);
killedBy: searchText operation finds all occurrences of a pattern across workspace files
statusReason: expected [ 'file', 'line', 'col', …(2) ] to deeply equal [ 'file', 'line', 'col', 'matchText' ]

[Killed] ConditionalExpression
src/operations/searchText.ts:90:13
           matchText: m[0],
         };
 
-        if (context > 0) {
+        if (false) {
           const start = Math.max(0, lineIdx - context);
           const end = Math.min(lines.length - 1, lineIdx + context);
killedBy: searchText operation returns context lines when requested
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] ArithmeticOperator
src/operations/searchText.ts:91:37
         };
 
         if (context > 0) {
-          const start = Math.max(0, lineIdx - context);
+          const start = Math.max(0, lineIdx + context);
           const end = Math.min(lines.length - 1, lineIdx + context);
           match.surroundingText = lines.slice(start, end + 1).join("\n");
killedBy: searchText operation returns context lines when requested
statusReason: expected '' to be truthy

[Killed] MethodExpression
src/operations/searchText.ts:91:25
         };
 
         if (context > 0) {
-          const start = Math.max(0, lineIdx - context);
+          const start = Math.min(0, lineIdx - context);
           const end = Math.min(lines.length - 1, lineIdx + context);
           match.surroundingText = lines.slice(start, end + 1).join("\n");
killedBy: searchText operation returns context lines when requested
statusReason: expected '' to be truthy

[Killed] ArithmeticOperator
src/operations/searchText.ts:92:50
 
         if (context > 0) {
           const start = Math.max(0, lineIdx - context);
-          const end = Math.min(lines.length - 1, lineIdx + context);
+          const end = Math.min(lines.length - 1, lineIdx - context);
           match.surroundingText = lines.slice(start, end + 1).join("\n");
         }
killedBy: searchText operation returns context lines when requested
statusReason: expected '' to be truthy

[Killed] MethodExpression
src/operations/searchText.ts:92:23
 
         if (context > 0) {
           const start = Math.max(0, lineIdx - context);
-          const end = Math.min(lines.length - 1, lineIdx + context);
+          const end = Math.max(lines.length - 1, lineIdx + context);
           match.surroundingText = lines.slice(start, end + 1).join("\n");
         }
killedBy: searchText operation surroundingText contains exactly the right window of lines
statusReason: expected [ 'line2', 'MATCH', 'line4', 'line5' ] to have a length of 3 but got 4

[Killed] MethodExpression
src/operations/searchText.ts:93:35
         if (context > 0) {
           const start = Math.max(0, lineIdx - context);
           const end = Math.min(lines.length - 1, lineIdx + context);
-          match.surroundingText = lines.slice(start, end + 1).join("\n");
+          match.surroundingText = lines.join("\n");
         }
 
killedBy: searchText operation surroundingText contains exactly the right window of lines
statusReason: expected [ 'line1', 'line2', 'MATCH', …(2) ] to have a length of 3 but got 5

[Killed] ArithmeticOperator
src/operations/searchText.ts:93:54
         if (context > 0) {
           const start = Math.max(0, lineIdx - context);
           const end = Math.min(lines.length - 1, lineIdx + context);
-          match.surroundingText = lines.slice(start, end + 1).join("\n");
+          match.surroundingText = lines.slice(start, end - 1).join("\n");
         }
 
killedBy: searchText operation returns context lines when requested
statusReason: expected '' to be truthy

[Killed] ConditionalExpression
src/operations/searchText.ts:98:13
 
         matches.push(match);
 
-        if (matches.length >= maxResults) {
+        if (false) {
           truncated = true;
           break outer;
killedBy: searchText operation respects maxResults cap and sets truncated=true
statusReason: expected 26 to be less than or equal to 2

[Killed] BlockStatement
src/operations/searchText.ts:98:43
 
         matches.push(match);
 
-        if (matches.length >= maxResults) {
-          truncated = true;
-          break outer;
-        }
+        if (matches.length >= maxResults) {}
 
         // Prevent infinite loop on zero-length matches
killedBy: searchText operation respects maxResults cap and sets truncated=true
statusReason: expected 26 to be less than or equal to 2

[Killed] BooleanLiteral
src/operations/searchText.ts:99:23
         matches.push(match);
 
         if (matches.length >= maxResults) {
-          truncated = true;
+          truncated = false;
           break outer;
         }
killedBy: searchText operation respects maxResults cap and sets truncated=true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/operations/searchText.ts:104:13
         }
 
         // Prevent infinite loop on zero-length matches
-        if (m[0].length === 0) re.lastIndex++;
+        if (m[0].length !== 0) re.lastIndex++;
       }
     }
killedBy: searchText operation zero-length match advances through all positions without skipping
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(97) ] to have a length of 3 but got 100

[Killed] ConditionalExpression
src/operations/searchText.ts:104:13
         }
 
         // Prevent infinite loop on zero-length matches
-        if (m[0].length === 0) re.lastIndex++;
+        if (false) re.lastIndex++;
       }
     }
killedBy: searchText operation zero-length match advances through all positions without skipping
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(97) ] to have a length of 3 but got 100
