[Killed] BlockStatement
src/utils/file-walk.ts:31:100
  * - Otherwise (non-git workspace), fall back to a recursive readdir walk that
  *   skips SKIP_DIRS.
  */
-export function walkFiles(dir: string, extensions: string[], fs: FileSystem = defaultFs): string[] {
-  const extSet = new Set(extensions);
-
-  const result = spawnSync("git", ["ls-files", "--cached", "--others", "--exclude-standard"], {
-    cwd: dir,
-    encoding: "utf8",
-  });
-
-  if (result.status === 0) {
-    return result.stdout
-      .split("\n")
-      .filter(Boolean)
-      .filter((line) => extSet.has(path.extname(line)))
-      .map((line) => path.join(dir, line))
-      .filter((abs) => fs.exists(abs));
-  }
-
-  // Fallback for non-git workspaces
-  return walkRecursive(dir, fs).filter((f) => extSet.has(path.extname(f)));
-}
+export function walkFiles(dir: string, extensions: string[], fs: FileSystem = defaultFs): string[] {}
 
 /**
statusReason: walkFiles is not a function or its return value is not iterable

[Killed] ObjectLiteral
src/utils/file-walk.ts:34:95
 export function walkFiles(dir: string, extensions: string[], fs: FileSystem = defaultFs): string[] {
   const extSet = new Set(extensions);
 
-  const result = spawnSync("git", ["ls-files", "--cached", "--others", "--exclude-standard"], {
-    cwd: dir,
-    encoding: "utf8",
-  });
+  const result = spawnSync("git", ["ls-files", "--cached", "--others", "--exclude-standard"], {});
 
   if (result.status === 0) {
statusReason: result.stdout.split is not a function

[Killed] ConditionalExpression
src/utils/file-walk.ts:39:7
     encoding: "utf8",
   });
 
-  if (result.status === 0) {
+  if (false) {
     return result.stdout
       .split("\n")
killedBy: walkFiles git repo excludes gitignored files in directories not in SKIP_DIRS
statusReason: expected [ 'secret.ts', 'a.ts' ] to not include 'secret.ts'

[Killed] EqualityOperator
src/utils/file-walk.ts:39:7
     encoding: "utf8",
   });
 
-  if (result.status === 0) {
+  if (result.status !== 0) {
     return result.stdout
       .split("\n")
statusReason: expected 'import { greetUser } from "../lib/uti…' to contain './utils'

[Killed] MethodExpression
src/utils/file-walk.ts:40:12
   });
 
   if (result.status === 0) {
-    return result.stdout
-      .split("\n")
-      .filter(Boolean)
-      .filter((line) => extSet.has(path.extname(line)))
-      .map((line) => path.join(dir, line))
-      .filter((abs) => fs.exists(abs));
+    return result.stdout.split("\n").filter(Boolean).filter(line => extSet.has(path.extname(line))).map(line => path.join(dir, line));
   }
 
killedBy: walkFiles git repo excludes git-tracked files deleted from disk
statusReason: expected [ 'a.ts', 'b.ts' ] to not include 'b.ts'

[Killed] MethodExpression
src/utils/file-walk.ts:40:12
   });
 
   if (result.status === 0) {
-    return result.stdout
-      .split("\n")
-      .filter(Boolean)
-      .filter((line) => extSet.has(path.extname(line)))
+    return result.stdout.split("\n").filter(Boolean)
       .map((line) => path.join(dir, line))
       .filter((abs) => fs.exists(abs));
killedBy: walkFiles git repo excludes files with non-matching extensions in git mode
statusReason: expected [ 'a.ts', 'b.vue' ] to not include 'b.vue'

[Killed] ArrowFunction
src/utils/file-walk.ts:43:15
     return result.stdout
       .split("\n")
       .filter(Boolean)
-      .filter((line) => extSet.has(path.extname(line)))
+      .filter(() => undefined)
       .map((line) => path.join(dir, line))
       .filter((abs) => fs.exists(abs));
killedBy: walkFiles git repo returns staged .ts files
statusReason: expected [] to include 'a.ts'

[Killed] ArrowFunction
src/utils/file-walk.ts:44:12
       .split("\n")
       .filter(Boolean)
       .filter((line) => extSet.has(path.extname(line)))
-      .map((line) => path.join(dir, line))
+      .map(() => undefined)
       .filter((abs) => fs.exists(abs));
   }
killedBy: walkFiles git repo returns staged .ts files
statusReason: expected [] to include 'a.ts'

[Killed] ArrowFunction
src/utils/file-walk.ts:45:15
       .filter(Boolean)
       .filter((line) => extSet.has(path.extname(line)))
       .map((line) => path.join(dir, line))
-      .filter((abs) => fs.exists(abs));
+      .filter(() => undefined);
   }
 
killedBy: walkFiles git repo returns staged .ts files
statusReason: expected [] to include 'a.ts'

[Killed] MethodExpression
src/utils/file-walk.ts:49:10
   }
 
   // Fallback for non-git workspaces
-  return walkRecursive(dir, fs).filter((f) => extSet.has(path.extname(f)));
+  return walkRecursive(dir, fs);
 }
 
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [ 'a.ts', 'b.tsx', 'c.vue', 'd.js' ] to deeply equal [ 'a.ts', 'b.tsx' ]

[Killed] ArrowFunction
src/utils/file-walk.ts:49:40
   }
 
   // Fallback for non-git workspaces
-  return walkRecursive(dir, fs).filter((f) => extSet.has(path.extname(f)));
+  return walkRecursive(dir, fs).filter(() => undefined);
 }
 
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [] to deeply equal [ 'a.ts', 'b.tsx' ]

[Killed] BlockStatement
src/utils/file-walk.ts:74:28
   });
 
   let files: string[];
-  if (result.status === 0) {
-    files = result.stdout
-      .split("\n")
-      .filter(Boolean)
-      .map((line) => path.join(workspace, line));
-  } else {
+  if (result.status === 0) {} else {
     files = walkRecursive(workspace, fs);
   }
killedBy: walkWorkspaceFiles git repo returns all tracked and untracked files without a glob
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/utils/file-walk.ts:74:7
   });
 
   let files: string[];
-  if (result.status === 0) {
+  if (true) {
     files = result.stdout
       .split("\n")
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) returns all files when no glob is given
statusReason: expected [] to deeply equal [ 'README.md', 'a.ts', 'b.js' ]

[Killed] MethodExpression
src/utils/file-walk.ts:75:13
 
   let files: string[];
   if (result.status === 0) {
-    files = result.stdout
-      .split("\n")
-      .filter(Boolean)
+    files = result.stdout.split("\n")
       .map((line) => path.join(workspace, line));
   } else {
killedBy: walkWorkspaceFiles git repo all returned paths exist on disk (empty git output lines are filtered)
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/utils/file-walk.ts:78:12
     files = result.stdout
       .split("\n")
       .filter(Boolean)
-      .map((line) => path.join(workspace, line));
+      .map(() => undefined);
   } else {
     files = walkRecursive(workspace, fs);
killedBy: walkWorkspaceFiles git repo returns all tracked and untracked files without a glob
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
src/utils/file-walk.ts:79:10
       .split("\n")
       .filter(Boolean)
       .map((line) => path.join(workspace, line));
-  } else {
-    files = walkRecursive(workspace, fs);
-  }
+  } else {}
 
   if (globPred || excludePred) {
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) returns all files when no glob is given
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/utils/file-walk.ts:83:32
     files = walkRecursive(workspace, fs);
   }
 
-  if (globPred || excludePred) {
-    files = files.filter((f) => {
-      const rel = path.relative(workspace, f).split(path.sep).join("/");
-      if (globPred && !globPred(rel)) return false;
-      if (excludePred?.(rel)) return false;
-      return true;
-    });
-  }
+  if (globPred || excludePred) {}
 
   return files;
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [ 'a.ts', 'b.js', 'c.vue' ] to not include 'b.js'

[Killed] ConditionalExpression
src/utils/file-walk.ts:83:7
     files = walkRecursive(workspace, fs);
   }
 
-  if (globPred || excludePred) {
+  if (false) {
     files = files.filter((f) => {
       const rel = path.relative(workspace, f).split(path.sep).join("/");
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [ 'a.ts', 'b.js', 'c.vue' ] to not include 'b.js'

[Killed] MethodExpression
src/utils/file-walk.ts:84:13
   }
 
   if (globPred || excludePred) {
-    files = files.filter((f) => {
-      const rel = path.relative(workspace, f).split(path.sep).join("/");
-      if (globPred && !globPred(rel)) return false;
-      if (excludePred?.(rel)) return false;
-      return true;
-    });
+    files = files;
   }
 
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [ 'a.ts', 'b.js', 'c.vue' ] to not include 'b.js'

[Killed] BlockStatement
src/utils/file-walk.ts:84:33
   }
 
   if (globPred || excludePred) {
-    files = files.filter((f) => {
-      const rel = path.relative(workspace, f).split(path.sep).join("/");
-      if (globPred && !globPred(rel)) return false;
-      if (excludePred?.(rel)) return false;
-      return true;
-    });
+    files = files.filter((f) => {});
   }
 
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [] to include 'a.ts'

[Killed] ConditionalExpression
src/utils/file-walk.ts:86:11
   if (globPred || excludePred) {
     files = files.filter((f) => {
       const rel = path.relative(workspace, f).split(path.sep).join("/");
-      if (globPred && !globPred(rel)) return false;
+      if (false) return false;
       if (excludePred?.(rel)) return false;
       return true;
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [ 'a.ts', 'b.js', 'c.vue' ] to not include 'b.js'

[Killed] LogicalOperator
src/utils/file-walk.ts:86:11
   if (globPred || excludePred) {
     files = files.filter((f) => {
       const rel = path.relative(workspace, f).split(path.sep).join("/");
-      if (globPred && !globPred(rel)) return false;
+      if (globPred || !globPred(rel)) return false;
       if (excludePred?.(rel)) return false;
       return true;
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [] to include 'a.ts'

[Killed] ConditionalExpression
src/utils/file-walk.ts:87:11
     files = files.filter((f) => {
       const rel = path.relative(workspace, f).split(path.sep).join("/");
       if (globPred && !globPred(rel)) return false;
-      if (excludePred?.(rel)) return false;
+      if (false) return false;
       return true;
     });
killedBy: walkWorkspaceFiles injected FileSystem (in-memory fallback) excludes matches from the excludeGlob after the glob filter is applied
statusReason: expected [ 'a.ts', 'guide.md', 'old.md' ] to deeply equal [ 'a.ts', 'guide.md' ]

[Killed] OptionalChaining
src/utils/file-walk.ts:87:11
     files = files.filter((f) => {
       const rel = path.relative(workspace, f).split(path.sep).join("/");
       if (globPred && !globPred(rel)) return false;
-      if (excludePred?.(rel)) return false;
+      if (excludePred(rel)) return false;
       return true;
     });
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: excludePred is not a function

[Killed] BooleanLiteral
src/utils/file-walk.ts:88:14
       const rel = path.relative(workspace, f).split(path.sep).join("/");
       if (globPred && !globPred(rel)) return false;
       if (excludePred?.(rel)) return false;
-      return true;
+      return false;
     });
   }
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) filters by glob pattern
statusReason: expected [] to include 'a.ts'

[Killed] BlockStatement
src/utils/file-walk.ts:99:82
  * Recursively enumerate all files under `dir`, skipping SKIP_DIRS.
  * Returns all files without any extension or glob filtering.
  */
-export function walkRecursive(dir: string, fs: FileSystem = defaultFs): string[] {
-  const results: string[] = [];
-  let entries: DirEntry[];
-  try {
-    entries = fs.readdir(dir);
-  } catch {
-    return results;
-  }
-  for (const entry of entries) {
-    if (SKIP_DIRS.has(entry.name)) continue;
-    const full = path.join(dir, entry.name);
-    // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
-    // skipped — never recursed into, which would risk cycling through its target.
-    if (entry.isDirectory()) {
-      results.push(...walkRecursive(full, fs));
-    } else if (entry.isFile()) {
-      results.push(full);
-    }
-  }
-  return results;
-}
+export function walkRecursive(dir: string, fs: FileSystem = defaultFs): string[] {}
 
killedBy: walkFiles non-git fallback (no .git dir) returns empty array when the directory does not exist
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/utils/file-walk.ts:102:7
 export function walkRecursive(dir: string, fs: FileSystem = defaultFs): string[] {
   const results: string[] = [];
   let entries: DirEntry[];
-  try {
-    entries = fs.readdir(dir);
-  } catch {
+  try {} catch {
     return results;
   }
killedBy: walkFiles non-git fallback (no .git dir) returns empty array when the directory does not exist
statusReason: entries is not iterable

[Killed] BlockStatement
src/utils/file-walk.ts:104:11
   let entries: DirEntry[];
   try {
     entries = fs.readdir(dir);
-  } catch {
-    return results;
-  }
+  } catch {}
   for (const entry of entries) {
     if (SKIP_DIRS.has(entry.name)) continue;
killedBy: walkFiles non-git fallback (no .git dir) returns empty array when the directory does not exist
statusReason: entries is not iterable

[Killed] BlockStatement
src/utils/file-walk.ts:107:32
   } catch {
     return results;
   }
-  for (const entry of entries) {
-    if (SKIP_DIRS.has(entry.name)) continue;
-    const full = path.join(dir, entry.name);
-    // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
-    // skipped — never recursed into, which would risk cycling through its target.
-    if (entry.isDirectory()) {
-      results.push(...walkRecursive(full, fs));
-    } else if (entry.isFile()) {
-      results.push(full);
-    }
-  }
+  for (const entry of entries) {}
   return results;
 }
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [] to deeply equal [ 'a.ts', 'b.tsx' ]

[Killed] ConditionalExpression
src/utils/file-walk.ts:108:9
     return results;
   }
   for (const entry of entries) {
-    if (SKIP_DIRS.has(entry.name)) continue;
+    if (true) continue;
     const full = path.join(dir, entry.name);
     // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [] to deeply equal [ 'a.ts', 'b.tsx' ]

[Killed] ConditionalExpression
src/utils/file-walk.ts:108:9
     return results;
   }
   for (const entry of entries) {
-    if (SKIP_DIRS.has(entry.name)) continue;
+    if (false) continue;
     const full = path.join(dir, entry.name);
     // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
killedBy: walkFiles non-git fallback (no .git dir) skips node_modules
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/utils/file-walk.ts:112:9
     const full = path.join(dir, entry.name);
     // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
     // skipped — never recursed into, which would risk cycling through its target.
-    if (entry.isDirectory()) {
+    if (false) {
       results.push(...walkRecursive(full, fs));
     } else if (entry.isFile()) {
killedBy: walkFiles non-git fallback (no .git dir) recurses into subdirectories
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/utils/file-walk.ts:112:9
     const full = path.join(dir, entry.name);
     // isDirectory/isFile do not follow symlinks, so a symlink is neither and is
     // skipped — never recursed into, which would risk cycling through its target.
-    if (entry.isDirectory()) {
+    if (true) {
       results.push(...walkRecursive(full, fs));
     } else if (entry.isFile()) {
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [] to deeply equal [ 'a.ts', 'b.tsx' ]

[Killed] ConditionalExpression
src/utils/file-walk.ts:114:16
     // skipped — never recursed into, which would risk cycling through its target.
     if (entry.isDirectory()) {
       results.push(...walkRecursive(full, fs));
-    } else if (entry.isFile()) {
+    } else if (true) {
       results.push(full);
     }
killedBy: walkWorkspaceFiles non-git fallback (no .git dir) excludes symlinks — only real files are returned
statusReason: expected [ 'a.ts', 'link.ts' ] to deeply equal [ 'a.ts' ]

[Killed] ConditionalExpression
src/utils/file-walk.ts:114:16
     // skipped — never recursed into, which would risk cycling through its target.
     if (entry.isDirectory()) {
       results.push(...walkRecursive(full, fs));
-    } else if (entry.isFile()) {
+    } else if (false) {
       results.push(full);
     }
killedBy: walkFiles non-git fallback (no .git dir) returns files matching extensions
statusReason: expected [] to deeply equal [ 'a.ts', 'b.tsx' ]
