[Killed] BlockStatement
src/operations/findImporters.ts:12:33
   compiler: Engine,
   filePath: string,
   fs: FileSystem,
-): Promise<FindImportersResult> {
-  const absPath = assertFileExists(filePath, fs);
-
-  const refs = await compiler.getFileReferences(absPath);
-  const fileName = path.basename(absPath);
-
-  if (!refs || refs.length === 0) {
-    return { fileName, references: [] };
-  }
-
-  const references = refs.map((ref) => {
-    const content = compiler.readFile(ref.fileName);
-    const lc = offsetToLineCol(content, ref.textSpan.start);
-    return { file: ref.fileName, line: lc.line, col: lc.col, length: ref.textSpan.length };
-  });
-
-  return { fileName, references };
-}
+): Promise<FindImportersResult> {}
 
killedBy: findImporters returns all files that import the given file
statusReason: Cannot read properties of undefined (reading 'fileName')

[Killed] ConditionalExpression
src/operations/findImporters.ts:18:7
   const refs = await compiler.getFileReferences(absPath);
   const fileName = path.basename(absPath);
 
-  if (!refs || refs.length === 0) {
+  if (false) {
     return { fileName, references: [] };
   }
killedBy: findImporters returns empty references for a file with no importers
statusReason: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
src/operations/findImporters.ts:18:35
   const refs = await compiler.getFileReferences(absPath);
   const fileName = path.basename(absPath);
 
-  if (!refs || refs.length === 0) {
-    return { fileName, references: [] };
-  }
+  if (!refs || refs.length === 0) {}
 
   const references = refs.map((ref) => {
killedBy: findImporters returns empty references for a file with no importers
statusReason: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
src/operations/findImporters.ts:22:40
     return { fileName, references: [] };
   }
 
-  const references = refs.map((ref) => {
-    const content = compiler.readFile(ref.fileName);
-    const lc = offsetToLineCol(content, ref.textSpan.start);
-    return { file: ref.fileName, line: lc.line, col: lc.col, length: ref.textSpan.length };
-  });
+  const references = refs.map((ref) => {});
 
   return { fileName, references };
killedBy: findImporters returns all files that import the given file
statusReason: Cannot read properties of undefined (reading 'file')
