[Killed] BlockStatement
src/operations/moveDirectory.ts:8:66
 import type { Engine } from "../ts-engine/types.js";
 import type { MoveDirectoryResult } from "./types.js";
 
-function isNonEmptyDir(absPath: string, fs: FileSystem): boolean {
-  // readdir throws for a missing path or a file — both mean "not a non-empty dir".
-  try {
-    return fs.readdir(absPath).length > 0;
-  } catch {
-    return false;
-  }
-}
+function isNonEmptyDir(absPath: string, fs: FileSystem): boolean {}
 
 export async function moveDirectory(
killedBy: moveDirectory error cases throws DESTINATION_EXISTS when destination is a non-empty directory
statusReason: expected Error: ENOTEMPTY: directory not empty, re… { …(5) } to match object { code: 'DESTINATION_EXISTS' }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/operations/moveDirectory.ts:10:7
 
 function isNonEmptyDir(absPath: string, fs: FileSystem): boolean {
   // readdir throws for a missing path or a file — both mean "not a non-empty dir".
-  try {
-    return fs.readdir(absPath).length > 0;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: moveDirectory error cases throws DESTINATION_EXISTS when destination is a non-empty directory
statusReason: expected Error: ENOTEMPTY: directory not empty, re… { …(5) } to match object { code: 'DESTINATION_EXISTS' }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:11:12
 function isNonEmptyDir(absPath: string, fs: FileSystem): boolean {
   // readdir throws for a missing path or a file — both mean "not a non-empty dir".
   try {
-    return fs.readdir(absPath).length > 0;
+    return false;
   } catch {
     return false;
killedBy: moveDirectory error cases throws DESTINATION_EXISTS when destination is a non-empty directory
statusReason: expected Error: ENOTEMPTY: directory not empty, re… { …(5) } to match object { code: 'DESTINATION_EXISTS' }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:11:12
 function isNonEmptyDir(absPath: string, fs: FileSystem): boolean {
   // readdir throws for a missing path or a file — both mean "not a non-empty dir".
   try {
-    return fs.readdir(absPath).length > 0;
+    return true;
   } catch {
     return false;
killedBy: moveDirectory basic directory move moves directory files and rewrites external imports
statusReason: Destination already exists and is non-empty: /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-w5sd13/src/lib/helpers

[Survived] BlockStatement
src/operations/moveDirectory.ts:12:11
   // readdir throws for a missing path or a file — both mean "not a non-empty dir".
   try {
     return fs.readdir(absPath).length > 0;
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:26:7
   const absOld = path.resolve(oldPath);
   const absNew = path.resolve(newPath);
 
-  if (!scope.fs.exists(absOld)) {
+  if (false) {
     throw new EngineError(`Directory not found: ${absOld}`, "FILE_NOT_FOUND");
   }
killedBy: moveDirectory error cases throws FILE_NOT_FOUND when source does not exist
statusReason: expected Error: ENOENT: no such file or directory,… { …(4) } to match object { code: 'FILE_NOT_FOUND' }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:26:7
   const absOld = path.resolve(oldPath);
   const absNew = path.resolve(newPath);
 
-  if (!scope.fs.exists(absOld)) {
+  if (true) {
     throw new EngineError(`Directory not found: ${absOld}`, "FILE_NOT_FOUND");
   }
killedBy: moveDirectory basic directory move moves directory files and rewrites external imports
statusReason: Directory not found: /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-cXIFG4/src/utils

[Killed] BlockStatement
src/operations/moveDirectory.ts:29:45
   if (!scope.fs.exists(absOld)) {
     throw new EngineError(`Directory not found: ${absOld}`, "FILE_NOT_FOUND");
   }
-  if (!scope.fs.stat(absOld).isDirectory()) {
-    throw new EngineError(`Path is not a directory: ${absOld}`, "NOT_A_DIRECTORY");
-  }
+  if (!scope.fs.stat(absOld).isDirectory()) {}
 
   const rel = path.relative(absOld, absNew);
killedBy: moveDirectory error cases throws NOT_A_DIRECTORY when source is a file
statusReason: promise resolved "{ filesMoved: [], …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:29:7
   if (!scope.fs.exists(absOld)) {
     throw new EngineError(`Directory not found: ${absOld}`, "FILE_NOT_FOUND");
   }
-  if (!scope.fs.stat(absOld).isDirectory()) {
+  if (false) {
     throw new EngineError(`Path is not a directory: ${absOld}`, "NOT_A_DIRECTORY");
   }
killedBy: moveDirectory error cases throws NOT_A_DIRECTORY when source is a file
statusReason: promise resolved "{ filesMoved: [], …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:34:7
   }
 
   const rel = path.relative(absOld, absNew);
-  if (!rel.startsWith("..")) {
+  if (true) {
     throw new EngineError(`Cannot move a directory into itself: ${absNew}`, "MOVE_INTO_SELF");
   }
killedBy: moveDirectory basic directory move moves directory files and rewrites external imports
statusReason: Cannot move a directory into itself: /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-XWu2yx/src/lib/helpers

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:34:7
   }
 
   const rel = path.relative(absOld, absNew);
-  if (!rel.startsWith("..")) {
+  if (false) {
     throw new EngineError(`Cannot move a directory into itself: ${absNew}`, "MOVE_INTO_SELF");
   }
killedBy: moveDirectory edge cases throws MOVE_INTO_SELF when oldPath and newPath are the same directory
statusReason: expected EngineError: Destination already exists a… { code: '…' } to match object { code: 'MOVE_INTO_SELF' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:38:7
     throw new EngineError(`Cannot move a directory into itself: ${absNew}`, "MOVE_INTO_SELF");
   }
 
-  if (isNonEmptyDir(absNew, scope.fs)) {
+  if (true) {
     throw new EngineError(
       `Destination already exists and is non-empty: ${absNew}`,
killedBy: moveDirectory basic directory move moves directory files and rewrites external imports
statusReason: Destination already exists and is non-empty: /var/folders/j_/4vzbl4c11_sfh12v5gqfg0zm0000gn/T/ns-qBnQS7/src/lib/helpers

[Killed] ConditionalExpression
src/operations/moveDirectory.ts:38:7
     throw new EngineError(`Cannot move a directory into itself: ${absNew}`, "MOVE_INTO_SELF");
   }
 
-  if (isNonEmptyDir(absNew, scope.fs)) {
+  if (false) {
     throw new EngineError(
       `Destination already exists and is non-empty: ${absNew}`,
killedBy: moveDirectory error cases throws DESTINATION_EXISTS when destination is a non-empty directory
statusReason: expected Error: ENOTEMPTY: directory not empty, re… { …(5) } to match object { code: 'DESTINATION_EXISTS' }
(4 matching properties omitted from actual)
