[Killed] BlockStatement
src/adapters/cli/classify-error.ts:1:89
-export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {
-  if (!(err instanceof Error)) return "INTERNAL_ERROR";
-  const code = (err as NodeJS.ErrnoException).code;
-  if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
-    return "DAEMON_STARTING";
-  if (err.message.includes("timed out")) return "DAEMON_STARTING";
-  return "INTERNAL_ERROR";
-}
+export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {}
 
killedBy: classifyDaemonError returns DAEMON_STARTING for ECONNREFUSED (daemon not yet listening)
statusReason: expected undefined to be 'DAEMON_STARTING' // Object.is equality

[Killed] ConditionalExpression
src/adapters/cli/classify-error.ts:2:7
 export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {
-  if (!(err instanceof Error)) return "INTERNAL_ERROR";
+  if (false) return "INTERNAL_ERROR";
   const code = (err as NodeJS.ErrnoException).code;
   if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
killedBy: classifyDaemonError returns INTERNAL_ERROR for non-Error values
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BooleanLiteral
src/adapters/cli/classify-error.ts:2:7
 export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {
-  if (!(err instanceof Error)) return "INTERNAL_ERROR";
+  if (err instanceof Error) return "INTERNAL_ERROR";
   const code = (err as NodeJS.ErrnoException).code;
   if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
killedBy: classifyDaemonError returns DAEMON_STARTING for ECONNREFUSED (daemon not yet listening)
statusReason: expected 'INTERNAL_ERROR' to be 'DAEMON_STARTING' // Object.is equality

[Killed] LogicalOperator
src/adapters/cli/classify-error.ts:4:7
 export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {
   if (!(err instanceof Error)) return "INTERNAL_ERROR";
   const code = (err as NodeJS.ErrnoException).code;
-  if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
+  if ((code === "ECONNREFUSED" || code === "ENOENT") && code === "ECONNRESET")
     return "DAEMON_STARTING";
   if (err.message.includes("timed out")) return "DAEMON_STARTING";
killedBy: classifyDaemonError returns DAEMON_STARTING for ECONNREFUSED (daemon not yet listening)
statusReason: expected 'INTERNAL_ERROR' to be 'DAEMON_STARTING' // Object.is equality

[Killed] EqualityOperator
src/adapters/cli/classify-error.ts:4:34
 export function classifyDaemonError(err: unknown): "DAEMON_STARTING" | "INTERNAL_ERROR" {
   if (!(err instanceof Error)) return "INTERNAL_ERROR";
   const code = (err as NodeJS.ErrnoException).code;
-  if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
+  if (code === "ECONNREFUSED" || code !== "ENOENT" || code === "ECONNRESET")
     return "DAEMON_STARTING";
   if (err.message.includes("timed out")) return "DAEMON_STARTING";
killedBy: classifyDaemonError returns DAEMON_STARTING for ENOENT (socket file missing)
statusReason: expected 'INTERNAL_ERROR' to be 'DAEMON_STARTING' // Object.is equality

[Killed] ConditionalExpression
src/adapters/cli/classify-error.ts:6:7
   const code = (err as NodeJS.ErrnoException).code;
   if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
     return "DAEMON_STARTING";
-  if (err.message.includes("timed out")) return "DAEMON_STARTING";
+  if (true) return "DAEMON_STARTING";
   return "INTERNAL_ERROR";
 }
killedBy: classifyDaemonError returns INTERNAL_ERROR for JSON parse failures (malformed daemon response)
statusReason: expected 'DAEMON_STARTING' to be 'INTERNAL_ERROR' // Object.is equality

[Killed] ConditionalExpression
src/adapters/cli/classify-error.ts:6:7
   const code = (err as NodeJS.ErrnoException).code;
   if (code === "ECONNREFUSED" || code === "ENOENT" || code === "ECONNRESET")
     return "DAEMON_STARTING";
-  if (err.message.includes("timed out")) return "DAEMON_STARTING";
+  if (false) return "DAEMON_STARTING";
   return "INTERNAL_ERROR";
 }
killedBy: classifyDaemonError returns DAEMON_STARTING for timeout (daemon slow to respond)
statusReason: expected 'INTERNAL_ERROR' to be 'DAEMON_STARTING' // Object.is equality
