[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:33:7
   const vueContent = scope.fs.readFile(sourceFile);
   const { descriptor } = parse(vueContent);
 
-  if (!descriptor.scriptSetup) {
+  if (descriptor.scriptSetup) {
     throw new EngineError(
       `<script setup> block is required to move a symbol from ${sourceFile}`,
statusReason: <script setup> block is required to move a symbol from /tmp/ns-vue-project-fTqCfe/src/App.vue

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:33:7
   const vueContent = scope.fs.readFile(sourceFile);
   const { descriptor } = parse(vueContent);
 
-  if (!descriptor.scriptSetup) {
+  if (false) {
     throw new EngineError(
       `<script setup> block is required to move a symbol from ${sourceFile}`,
statusReason: expected TypeError: Cannot destructure property 'l… to match object { code: 'NOT_SUPPORTED' }

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:44:41
 
   const scriptSF = createThrowawaySourceFile("__script__.ts", scriptContent);
 
-  if (isReExport(scriptSF, symbolName)) {
-    throw new EngineError(
-      `Symbol '${symbolName}' in ${sourceFile} is a re-export via 'export { } from'. Re-exports are not supported.`,
-      "NOT_SUPPORTED",
-    );
-  }
+  if (isReExport(scriptSF, symbolName)) {}
 
   const sourceRef = SymbolRef.fromExport(scriptSF, symbolName);
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:44:7
 
   const scriptSF = createThrowawaySourceFile("__script__.ts", scriptContent);
 
-  if (isReExport(scriptSF, symbolName)) {
+  if (false) {
     throw new EngineError(
       `Symbol '${symbolName}' in ${sourceFile} is a re-export via 'export { } from'. Re-exports are not supported.`,
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] MethodExpression
src/plugins/vue/move-symbol.ts:53:8
 
   const sourceRef = SymbolRef.fromExport(scriptSF, symbolName);
 
-  if (!sourceRef.declarationText.trimStart().startsWith("export")) {
+  if (!sourceRef.declarationText.trimStart().endsWith("export")) {
     throw new EngineError(
       `Symbol '${symbolName}' in ${sourceFile} is not a direct export.`,
statusReason: Symbol 'formatLabel' in /tmp/vue-movesym-X4kqij/src/App.vue is not a direct export.

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:53:68
 
   const sourceRef = SymbolRef.fromExport(scriptSF, symbolName);
 
-  if (!sourceRef.declarationText.trimStart().startsWith("export")) {
-    throw new EngineError(
-      `Symbol '${symbolName}' in ${sourceFile} is not a direct export.`,
-      "NOT_SUPPORTED",
-    );
-  }
+  if (!sourceRef.declarationText.trimStart().startsWith("export")) {}
 
   const declarationText = sourceRef.declarationText;
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:63:27
   const declarationText = sourceRef.declarationText;
 
   const declStmt = resolveDeclarationStatement(scriptSF, symbolName);
-  const needsSelfImport = declStmt !== null && hasRefsOutsideDeclaration(scriptSF, declStmt);
+  const needsSelfImport = false;
 
   sourceRef.remove();
statusReason: expected '<script setup lang="ts">\nconst v = h…' to match /import\s*\{\s*helper\s*\}\s*fro…/utils\

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:63:27
   const declarationText = sourceRef.declarationText;
 
   const declStmt = resolveDeclarationStatement(scriptSF, symbolName);
-  const needsSelfImport = declStmt !== null && hasRefsOutsideDeclaration(scriptSF, declStmt);
+  const needsSelfImport = true;
 
   sourceRef.remove();
statusReason: expected '<script setup lang="ts">\nimport { fo…' not to contain 'formatLabel'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:67:24
 
   sourceRef.remove();
   let newScript = scriptSF.getFullText();
-  if (needsSelfImport) {
-    const specifier = computeRelativeImportPath(sourceFile, destFile);
-    newScript = `\nimport { ${symbolName} } from "${specifier}";${newScript}`;
-  }
+  if (needsSelfImport) {}
   const newVueContent =
     vueContent.slice(0, loc.start.offset) + newScript + vueContent.slice(loc.end.offset);
statusReason: expected '<script setup lang="ts">\nconst v = h…' to match /import\s*\{\s*helper\s*\}\s*fro…/utils\

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:67:7
 
   sourceRef.remove();
   let newScript = scriptSF.getFullText();
-  if (needsSelfImport) {
+  if (true) {
     const specifier = computeRelativeImportPath(sourceFile, destFile);
     newScript = `\nimport { ${symbolName} } from "${specifier}";${newScript}`;
statusReason: expected '<script setup lang="ts">\nimport { fo…' not to contain 'formatLabel'

[Killed] ArithmeticOperator
src/plugins/vue/move-symbol.ts:72:5
     newScript = `\nimport { ${symbolName} } from "${specifier}";${newScript}`;
   }
   const newVueContent =
-    vueContent.slice(0, loc.start.offset) + newScript + vueContent.slice(loc.end.offset);
+    vueContent.slice(0, loc.start.offset) - newScript + vueContent.slice(loc.end.offset);
 
   const newDestContent = destFile.endsWith(".vue")
statusReason: expected 'NaN</script>\n\n<template>\n  <div>{{…' to contain 'const x = 1;'

[Killed] MethodExpression
src/plugins/vue/move-symbol.ts:72:57
     newScript = `\nimport { ${symbolName} } from "${specifier}";${newScript}`;
   }
   const newVueContent =
-    vueContent.slice(0, loc.start.offset) + newScript + vueContent.slice(loc.end.offset);
+    vueContent.slice(0, loc.start.offset) + newScript + vueContent;
 
   const newDestContent = destFile.endsWith(".vue")
statusReason: expected '<script setup lang="ts">\nconst x = 1…' not to contain 'formatLabel'

[Killed] MethodExpression
src/plugins/vue/move-symbol.ts:74:26
   const newVueContent =
     vueContent.slice(0, loc.start.offset) + newScript + vueContent.slice(loc.end.offset);
 
-  const newDestContent = destFile.endsWith(".vue")
+  const newDestContent = destFile.startsWith(".vue")
     ? composeVueDest(destFile, declarationText, scope)
     : composeTsDest(destFile, declarationText, scope);
statusReason: expected '<script setup lang="ts">\nconst exist…' to contain 'export const SHARED = 1;'

[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:78:55
     ? composeVueDest(destFile, declarationText, scope)
     : composeTsDest(destFile, declarationText, scope);
 
-  scope.fs.mkdir(path.dirname(destFile), { recursive: true });
+  scope.fs.mkdir(path.dirname(destFile), { recursive: false });
 
   writeOrSkip(sourceFile, newVueContent, scope);
statusReason: EEXIST: file already exists, mkdir '/tmp/vue-movesym-MgnTRZ/src/utils'

[Killed] ObjectLiteral
src/plugins/vue/move-symbol.ts:78:42
     ? composeVueDest(destFile, declarationText, scope)
     : composeTsDest(destFile, declarationText, scope);
 
-  scope.fs.mkdir(path.dirname(destFile), { recursive: true });
+  scope.fs.mkdir(path.dirname(destFile), {});
 
   writeOrSkip(sourceFile, newVueContent, scope);
statusReason: EEXIST: file already exists, mkdir '/tmp/vue-movesym-3Cas5L/src/utils'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:91:9
   destFile: string,
   symbolName: string,
   scope: WorkspaceScope,
-): void {
-  const tsConfig = findTsConfigForFile(sourceFile);
-  const searchRoot = tsConfig ? path.dirname(tsConfig) : scope.root;
-
-  updateVueImportsAfterSymbolMove(symbolName, sourceFile, destFile, searchRoot, scope);
-
-  const rewriter = new ImportRewriter();
-  const alreadyModified = new Set(scope.modified);
-  for (const file of walkFiles(searchRoot, [".ts", ".tsx"])) {
-    if (alreadyModified.has(file)) continue;
-    const content = scope.fs.readFile(file);
-    const rewritten = rewriter.rewriteScript(
-      file,
-      content,
-      symbolName,
-      sourceFile,
-      destFile,
-      scope,
-    );
-    if (rewritten !== null) {
-      scope.writeFile(file, rewritten);
-    }
-  }
-}
+): void {}
 
 function composeTsDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
statusReason: expected 'import { shared } from "./lib/Source.…' to contain 'from "./utils/shared.js"'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:99:62
 
   const rewriter = new ImportRewriter();
   const alreadyModified = new Set(scope.modified);
-  for (const file of walkFiles(searchRoot, [".ts", ".tsx"])) {
-    if (alreadyModified.has(file)) continue;
-    const content = scope.fs.readFile(file);
-    const rewritten = rewriter.rewriteScript(
-      file,
-      content,
-      symbolName,
-      sourceFile,
-      destFile,
-      scope,
-    );
-    if (rewritten !== null) {
-      scope.writeFile(file, rewritten);
-    }
-  }
+  for (const file of walkFiles(searchRoot, [".ts", ".tsx"])) {}
 }
 
statusReason: expected 'import { shared } from "./lib/Source.…' to contain 'from "./utils/shared.js"'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:100:9
   const rewriter = new ImportRewriter();
   const alreadyModified = new Set(scope.modified);
   for (const file of walkFiles(searchRoot, [".ts", ".tsx"])) {
-    if (alreadyModified.has(file)) continue;
+    if (true) continue;
     const content = scope.fs.readFile(file);
     const rewritten = rewriter.rewriteScript(
statusReason: expected 'import { shared } from "./lib/Source.…' to contain 'from "./utils/shared.js"'

[Survived] ConditionalExpression
src/plugins/vue/move-symbol.ts:100:9
   const rewriter = new ImportRewriter();
   const alreadyModified = new Set(scope.modified);
   for (const file of walkFiles(searchRoot, [".ts", ".tsx"])) {
-    if (alreadyModified.has(file)) continue;
+    if (false) continue;
     const content = scope.fs.readFile(file);
     const rewritten = rewriter.rewriteScript(

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:110:9
       destFile,
       scope,
     );
-    if (rewritten !== null) {
+    if (false) {
       scope.writeFile(file, rewritten);
     }
statusReason: expected 'import { shared } from "./lib/Source.…' to contain 'from "./utils/shared.js"'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:110:9
       destFile,
       scope,
     );
-    if (rewritten !== null) {
+    if (true) {
       scope.writeFile(file, rewritten);
     }
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received null

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:116:98
   }
 }
 
-function composeTsDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
-  if (!scope.fs.exists(destFile)) {
-    return `${declarationText}\n`;
-  }
-  const existing = scope.fs.readFile(destFile).trimEnd();
-  if (existing.length === 0) return `${declarationText}\n`;
-  return `${existing}\n\n${declarationText}\n`;
-}
+function composeTsDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {}
 
 function composeVueDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:117:7
 }
 
 function composeTsDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
-  if (!scope.fs.exists(destFile)) {
+  if (scope.fs.exists(destFile)) {
     return `${declarationText}\n`;
   }
statusReason: ENOENT: no such file or directory, open '/tmp/vue-movesym-P03I5x/src/utils/format.ts'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:117:7
 }
 
 function composeTsDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
-  if (!scope.fs.exists(destFile)) {
+  if (true) {
     return `${declarationText}\n`;
   }
statusReason: expected 'export const GREETING = \'hi\';\n' to contain 'export const FAREWELL = \'bye\''

[Survived] MethodExpression
src/plugins/vue/move-symbol.ts:120:20
   if (!scope.fs.exists(destFile)) {
     return `${declarationText}\n`;
   }
-  const existing = scope.fs.readFile(destFile).trimEnd();
+  const existing = scope.fs.readFile(destFile).trimStart();
   if (existing.length === 0) return `${declarationText}\n`;
   return `${existing}\n\n${declarationText}\n`;

[Killed] EqualityOperator
src/plugins/vue/move-symbol.ts:121:7
     return `${declarationText}\n`;
   }
   const existing = scope.fs.readFile(destFile).trimEnd();
-  if (existing.length === 0) return `${declarationText}\n`;
+  if (existing.length !== 0) return `${declarationText}\n`;
   return `${existing}\n\n${declarationText}\n`;
 }
statusReason: expected 'export const GREETING = \'hi\';\n' to contain 'export const FAREWELL = \'bye\''

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:121:7
     return `${declarationText}\n`;
   }
   const existing = scope.fs.readFile(destFile).trimEnd();
-  if (existing.length === 0) return `${declarationText}\n`;
+  if (true) return `${declarationText}\n`;
   return `${existing}\n\n${declarationText}\n`;
 }
statusReason: expected 'export const GREETING = \'hi\';\n' to contain 'export const FAREWELL = \'bye\''

[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:128:7
 function composeVueDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
   const newBlock = `<script setup lang="ts">\n${declarationText}\n</script>\n`;
 
-  if (!scope.fs.exists(destFile)) {
+  if (scope.fs.exists(destFile)) {
     return newBlock;
   }
statusReason: expected '<script setup lang="ts">\nexport cons…' to contain 'const existing = 2;'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:128:35
 function composeVueDest(destFile: string, declarationText: string, scope: WorkspaceScope): string {
   const newBlock = `<script setup lang="ts">\n${declarationText}\n</script>\n`;
 
-  if (!scope.fs.exists(destFile)) {
-    return newBlock;
-  }
+  if (!scope.fs.exists(destFile)) {}
 
   const existing = scope.fs.readFile(destFile);
statusReason: ENOENT: no such file or directory, open '/tmp/vue-movesym-ahMosK/src/types/Foo.vue'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:135:7
   const existing = scope.fs.readFile(destFile);
   const { descriptor } = parse(existing);
 
-  if (descriptor.scriptSetup) {
+  if (false) {
     const { loc, content: scriptContent } = descriptor.scriptSetup;
     const newScriptContent = `${scriptContent.replace(/\s*$/, "")}\n\n${declarationText}\n`;
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:135:31
   const existing = scope.fs.readFile(destFile);
   const { descriptor } = parse(existing);
 
-  if (descriptor.scriptSetup) {
-    const { loc, content: scriptContent } = descriptor.scriptSetup;
-    const newScriptContent = `${scriptContent.replace(/\s*$/, "")}\n\n${declarationText}\n`;
-    return existing.slice(0, loc.start.offset) + newScriptContent + existing.slice(loc.end.offset);
-  }
+  if (descriptor.scriptSetup) {}
 
   if (descriptor.template) {
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/plugins/vue/move-symbol.ts:138:12
   if (descriptor.scriptSetup) {
     const { loc, content: scriptContent } = descriptor.scriptSetup;
     const newScriptContent = `${scriptContent.replace(/\s*$/, "")}\n\n${declarationText}\n`;
-    return existing.slice(0, loc.start.offset) + newScriptContent + existing.slice(loc.end.offset);
+    return existing.slice(0, loc.start.offset) + newScriptContent - existing.slice(loc.end.offset);
   }
 
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received type number (NaN)

[Killed] MethodExpression
src/plugins/vue/move-symbol.ts:138:12
   if (descriptor.scriptSetup) {
     const { loc, content: scriptContent } = descriptor.scriptSetup;
     const newScriptContent = `${scriptContent.replace(/\s*$/, "")}\n\n${declarationText}\n`;
-    return existing.slice(0, loc.start.offset) + newScriptContent + existing.slice(loc.end.offset);
+    return existing + newScriptContent + existing.slice(loc.end.offset);
   }
 
statusReason: expected '<script setup lang="ts">\nconst exist…' to contain 'export const SHARED = 1;'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:141:7
     return existing.slice(0, loc.start.offset) + newScriptContent + existing.slice(loc.end.offset);
   }
 
-  if (descriptor.template) {
+  if (false) {
     const templateStart = descriptor.template.loc.start.offset;
     // Walk back to the opening `<template` to capture any preceding whitespace.
statusReason: expected 40 to be less than 0

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:141:28
     return existing.slice(0, loc.start.offset) + newScriptContent + existing.slice(loc.end.offset);
   }
 
-  if (descriptor.template) {
-    const templateStart = descriptor.template.loc.start.offset;
-    // Walk back to the opening `<template` to capture any preceding whitespace.
-    const openIdx = existing.lastIndexOf("<template", templateStart);
-    const insertAt = openIdx >= 0 ? openIdx : templateStart;
-    return `${existing.slice(0, insertAt)}${newBlock}\n${existing.slice(insertAt)}`;
-  }
+  if (descriptor.template) {}
 
   const trimmedExisting = existing.replace(/\s*$/, "");
statusReason: expected 40 to be less than 0

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:145:22
     const templateStart = descriptor.template.loc.start.offset;
     // Walk back to the opening `<template` to capture any preceding whitespace.
     const openIdx = existing.lastIndexOf("<template", templateStart);
-    const insertAt = openIdx >= 0 ? openIdx : templateStart;
+    const insertAt = false ? openIdx : templateStart;
     return `${existing.slice(0, insertAt)}${newBlock}\n${existing.slice(insertAt)}`;
   }
statusReason: expected 10 to be less than 0

[Killed] EqualityOperator
src/plugins/vue/move-symbol.ts:145:22
     const templateStart = descriptor.template.loc.start.offset;
     // Walk back to the opening `<template` to capture any preceding whitespace.
     const openIdx = existing.lastIndexOf("<template", templateStart);
-    const insertAt = openIdx >= 0 ? openIdx : templateStart;
+    const insertAt = openIdx > 0 ? openIdx : templateStart;
     return `${existing.slice(0, insertAt)}${newBlock}\n${existing.slice(insertAt)}`;
   }
statusReason: expected 10 to be less than 0

[Killed] MethodExpression
src/plugins/vue/move-symbol.ts:146:15
     // Walk back to the opening `<template` to capture any preceding whitespace.
     const openIdx = existing.lastIndexOf("<template", templateStart);
     const insertAt = openIdx >= 0 ? openIdx : templateStart;
-    return `${existing.slice(0, insertAt)}${newBlock}\n${existing.slice(insertAt)}`;
+    return `${existing}${newBlock}\n${existing.slice(insertAt)}`;
   }
 
statusReason: expected 39 to be less than 0

[Survived] MethodExpression
src/plugins/vue/move-symbol.ts:146:58
     // Walk back to the opening `<template` to capture any preceding whitespace.
     const openIdx = existing.lastIndexOf("<template", templateStart);
     const insertAt = openIdx >= 0 ? openIdx : templateStart;
-    return `${existing.slice(0, insertAt)}${newBlock}\n${existing.slice(insertAt)}`;
+    return `${existing.slice(0, insertAt)}${newBlock}\n${existing}`;
   }
 

[Killed] EqualityOperator
src/plugins/vue/move-symbol.ts:150:10
   }
 
   const trimmedExisting = existing.replace(/\s*$/, "");
-  return trimmedExisting.length > 0 ? `${trimmedExisting}\n\n${newBlock}` : newBlock;
+  return trimmedExisting.length <= 0 ? `${trimmedExisting}\n\n${newBlock}` : newBlock;
 }
 
statusReason: expected '<script setup lang="ts">\nexport cons…' to contain '.foo { color: red; }'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:150:10
   }
 
   const trimmedExisting = existing.replace(/\s*$/, "");
-  return trimmedExisting.length > 0 ? `${trimmedExisting}\n\n${newBlock}` : newBlock;
+  return false ? `${trimmedExisting}\n\n${newBlock}` : newBlock;
 }
 
statusReason: expected '<script setup lang="ts">\nexport cons…' to contain '.foo { color: red; }'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:153:72
   return trimmedExisting.length > 0 ? `${trimmedExisting}\n\n${newBlock}` : newBlock;
 }
 
-function isReExport(scriptSF: SourceFile, symbolName: string): boolean {
-  for (const decl of scriptSF.getExportDeclarations()) {
-    if (!decl.getModuleSpecifierValue()) continue;
-    for (const spec of decl.getNamedExports()) {
-      const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
-      if (exportedAs === symbolName) return true;
-    }
-  }
-  return false;
-}
+function isReExport(scriptSF: SourceFile, symbolName: string): boolean {}
 
 function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:154:56
 }
 
 function isReExport(scriptSF: SourceFile, symbolName: string): boolean {
-  for (const decl of scriptSF.getExportDeclarations()) {
-    if (!decl.getModuleSpecifierValue()) continue;
-    for (const spec of decl.getNamedExports()) {
-      const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
-      if (exportedAs === symbolName) return true;
-    }
-  }
+  for (const decl of scriptSF.getExportDeclarations()) {}
   return false;
 }
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:155:9
 
 function isReExport(scriptSF: SourceFile, symbolName: string): boolean {
   for (const decl of scriptSF.getExportDeclarations()) {
-    if (!decl.getModuleSpecifierValue()) continue;
+    if (true) continue;
     for (const spec of decl.getNamedExports()) {
       const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:155:9
 
 function isReExport(scriptSF: SourceFile, symbolName: string): boolean {
   for (const decl of scriptSF.getExportDeclarations()) {
-    if (!decl.getModuleSpecifierValue()) continue;
+    if (decl.getModuleSpecifierValue()) continue;
     for (const spec of decl.getNamedExports()) {
       const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:156:48
 function isReExport(scriptSF: SourceFile, symbolName: string): boolean {
   for (const decl of scriptSF.getExportDeclarations()) {
     if (!decl.getModuleSpecifierValue()) continue;
-    for (const spec of decl.getNamedExports()) {
-      const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
-      if (exportedAs === symbolName) return true;
-    }
+    for (const spec of decl.getNamedExports()) {}
   }
   return false;
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] LogicalOperator
src/plugins/vue/move-symbol.ts:157:26
   for (const decl of scriptSF.getExportDeclarations()) {
     if (!decl.getModuleSpecifierValue()) continue;
     for (const spec of decl.getNamedExports()) {
-      const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
+      const exportedAs = spec.getAliasNode()?.getText() && spec.getName();
       if (exportedAs === symbolName) return true;
     }
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] OptionalChaining
src/plugins/vue/move-symbol.ts:157:26
   for (const decl of scriptSF.getExportDeclarations()) {
     if (!decl.getModuleSpecifierValue()) continue;
     for (const spec of decl.getNamedExports()) {
-      const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
+      const exportedAs = spec.getAliasNode().getText() ?? spec.getName();
       if (exportedAs === symbolName) return true;
     }
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] BooleanLiteral
src/plugins/vue/move-symbol.ts:158:45
     if (!decl.getModuleSpecifierValue()) continue;
     for (const spec of decl.getNamedExports()) {
       const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
-      if (exportedAs === symbolName) return true;
+      if (exportedAs === symbolName) return false;
     }
   }
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:158:11
     if (!decl.getModuleSpecifierValue()) continue;
     for (const spec of decl.getNamedExports()) {
       const exportedAs = spec.getAliasNode()?.getText() ?? spec.getName();
-      if (exportedAs === symbolName) return true;
+      if (false) return true;
     }
   }
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'NOT_SUPPORTED' }

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:164:86
   return false;
 }
 
-function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {
-  if (scope.contains(filePath)) {
-    scope.writeFile(filePath, content);
-  } else {
-    scope.recordSkipped(filePath);
-  }
-}
+function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {}
 
statusReason: expected '<script setup lang="ts">\nexport func…' not to contain 'formatLabel'

[Killed] BlockStatement
src/plugins/vue/move-symbol.ts:165:33
 }
 
 function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {
-  if (scope.contains(filePath)) {
-    scope.writeFile(filePath, content);
-  } else {
+  if (scope.contains(filePath)) {} else {
     scope.recordSkipped(filePath);
   }
statusReason: expected '<script setup lang="ts">\nexport func…' not to contain 'formatLabel'

[Killed] ConditionalExpression
src/plugins/vue/move-symbol.ts:165:7
 }
 
 function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {
-  if (scope.contains(filePath)) {
+  if (false) {
     scope.writeFile(filePath, content);
   } else {
statusReason: expected '<script setup lang="ts">\nexport func…' not to contain 'formatLabel'

[NoCoverage] BlockStatement
src/plugins/vue/move-symbol.ts:167:10
 function writeOrSkip(filePath: string, content: string, scope: WorkspaceScope): void {
   if (scope.contains(filePath)) {
     scope.writeFile(filePath, content);
-  } else {
-    scope.recordSkipped(filePath);
-  }
+  } else {}
 }
 
