[Killed] BlockStatement
src/plugins/vue/name-matches.ts:16:34
   fileContent: string,
   blockStartOffset: number,
   identOffsetInBlock: number,
-): { line: number; col: number } {
-  return offsetToLineCol(fileContent, blockStartOffset + identOffsetInBlock);
-}
+): { line: number; col: number } {}
 
 /**
statusReason: Cannot read properties of undefined (reading 'line')

[Killed] ArithmeticOperator
src/plugins/vue/name-matches.ts:17:39
   blockStartOffset: number,
   identOffsetInBlock: number,
 ): { line: number; col: number } {
-  return offsetToLineCol(fileContent, blockStartOffset + identOffsetInBlock);
+  return offsetToLineCol(fileContent, blockStartOffset - identOffsetInBlock);
 }
 
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:32:22
   oldName: string,
   oldContents: Map<string, string>,
   excludePositions: ExcludePosition[],
-): NameMatchSample[] {
-  const excluded = new Set(excludePositions.map((p) => `${p.file}:${p.offset}`));
-  const matches: NameMatchSample[] = [];
-
-  for (const [filePath, content] of oldContents) {
-    if (filePath.endsWith(".vue")) {
-      matches.push(...scanVueFile(filePath, content, oldName, excluded));
-    } else {
-      matches.push(...scanTsFile(filePath, content, oldName, excluded));
-    }
-  }
-
-  return matches;
-}
+): NameMatchSample[] {}
 
 function scanTsFile(
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/plugins/vue/name-matches.ts:33:49
   oldContents: Map<string, string>,
   excludePositions: ExcludePosition[],
 ): NameMatchSample[] {
-  const excluded = new Set(excludePositions.map((p) => `${p.file}:${p.offset}`));
+  const excluded = new Set(excludePositions.map(() => undefined));
   const matches: NameMatchSample[] = [];
 
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:36:50
   const excluded = new Set(excludePositions.map((p) => `${p.file}:${p.offset}`));
   const matches: NameMatchSample[] = [];
 
-  for (const [filePath, content] of oldContents) {
-    if (filePath.endsWith(".vue")) {
-      matches.push(...scanVueFile(filePath, content, oldName, excluded));
-    } else {
-      matches.push(...scanTsFile(filePath, content, oldName, excluded));
-    }
-  }
+  for (const [filePath, content] of oldContents) {}
 
   return matches;
statusReason: expected [] to include 'useCounterHelper'

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:37:9
   const matches: NameMatchSample[] = [];
 
   for (const [filePath, content] of oldContents) {
-    if (filePath.endsWith(".vue")) {
+    if (false) {
       matches.push(...scanVueFile(filePath, content, oldName, excluded));
     } else {
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/plugins/vue/name-matches.ts:37:9
   const matches: NameMatchSample[] = [];
 
   for (const [filePath, content] of oldContents) {
-    if (filePath.endsWith(".vue")) {
+    if (filePath.startsWith(".vue")) {
       matches.push(...scanVueFile(filePath, content, oldName, excluded));
     } else {
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:39:12
   for (const [filePath, content] of oldContents) {
     if (filePath.endsWith(".vue")) {
       matches.push(...scanVueFile(filePath, content, oldName, excluded));
-    } else {
-      matches.push(...scanTsFile(filePath, content, oldName, excluded));
-    }
+    } else {}
   }
 
statusReason: expected [] to include 'useCounterHelper'

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:52:22
   content: string,
   oldName: string,
   excluded: Set<string>,
-): NameMatchSample[] {
-  const sourceFile = createThrowawaySourceFile(filePath, content);
-  const matches: NameMatchSample[] = [];
-
-  for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    const text = identifier.getText();
-    if (!containsName(text, oldName)) continue;
-
-    const offset = identifier.getStart();
-    if (excluded.has(`${filePath}:${offset}`)) continue;
-
-    const { line, character } = sourceFile.compilerNode.getLineAndCharacterOfPosition(offset);
-    matches.push({
-      file: filePath,
-      line: line + 1,
-      col: character + 1,
-      name: text,
-      kind: identifier.getParentOrThrow().getKindName(),
-    });
-  }
-
-  return matches;
-}
+): NameMatchSample[] {}
 
 function scanVueFile(
statusReason: scanTsFile(...) is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:56:84
   const sourceFile = createThrowawaySourceFile(filePath, content);
   const matches: NameMatchSample[] = [];
 
-  for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    const text = identifier.getText();
-    if (!containsName(text, oldName)) continue;
-
-    const offset = identifier.getStart();
-    if (excluded.has(`${filePath}:${offset}`)) continue;
-
-    const { line, character } = sourceFile.compilerNode.getLineAndCharacterOfPosition(offset);
-    matches.push({
-      file: filePath,
-      line: line + 1,
-      col: character + 1,
-      name: text,
-      kind: identifier.getParentOrThrow().getKindName(),
-    });
-  }
+  for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {}
 
   return matches;
statusReason: expected [] to include 'useCounterHelper'

[Killed] BooleanLiteral
src/plugins/vue/name-matches.ts:58:9
 
   for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
     const text = identifier.getText();
-    if (!containsName(text, oldName)) continue;
+    if (containsName(text, oldName)) continue;
 
     const offset = identifier.getStart();
statusReason: expected [] to include 'useCounterHelper'

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:58:9
 
   for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
     const text = identifier.getText();
-    if (!containsName(text, oldName)) continue;
+    if (true) continue;
 
     const offset = identifier.getStart();
statusReason: expected [] to include 'useCounterHelper'

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:61:9
     if (!containsName(text, oldName)) continue;
 
     const offset = identifier.getStart();
-    if (excluded.has(`${filePath}:${offset}`)) continue;
+    if (true) continue;
 
     const { line, character } = sourceFile.compilerNode.getLineAndCharacterOfPosition(offset);
statusReason: expected [] to include 'useCounterHelper'

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:61:9
     if (!containsName(text, oldName)) continue;
 
     const offset = identifier.getStart();
-    if (excluded.has(`${filePath}:${offset}`)) continue;
+    if (false) continue;
 
     const { line, character } = sourceFile.compilerNode.getLineAndCharacterOfPosition(offset);
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/plugins/vue/name-matches.ts:66:13
     const { line, character } = sourceFile.compilerNode.getLineAndCharacterOfPosition(offset);
     matches.push({
       file: filePath,
-      line: line + 1,
+      line: line - 1,
       col: character + 1,
       name: text,
statusReason: expected { file: 'src/helpers.ts', …(4) } to match object { file: 'src/helpers.ts', …(4) }

[Killed] ArithmeticOperator
src/plugins/vue/name-matches.ts:67:12
     matches.push({
       file: filePath,
       line: line + 1,
-      col: character + 1,
+      col: character - 1,
       name: text,
       kind: identifier.getParentOrThrow().getKindName(),
statusReason: expected { file: 'src/helpers.ts', …(4) } to match object { file: 'src/helpers.ts', …(4) }

[Killed] EqualityOperator
src/plugins/vue/name-matches.ts:84:40
 ): NameMatchSample[] {
   const { descriptor } = parse(content);
   const blocks = [descriptor.scriptSetup, descriptor.script].filter(
-    (b): b is NonNullable<typeof b> => b !== null,
+    (b): b is NonNullable<typeof b> => b === null,
   );
 
statusReason: Cannot read properties of null (reading 'loc')

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:84:40
 ): NameMatchSample[] {
   const { descriptor } = parse(content);
   const blocks = [descriptor.scriptSetup, descriptor.script].filter(
-    (b): b is NonNullable<typeof b> => b !== null,
+    (b): b is NonNullable<typeof b> => true,
   );
 
statusReason: Cannot read properties of null (reading 'loc')

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:88:31
   );
 
   const matches: NameMatchSample[] = [];
-  for (const block of blocks) {
-    const blockStart = block.loc.start.offset;
-    const blockContent = content.slice(blockStart, block.loc.end.offset);
-    const sourceFile = createThrowawaySourceFile(`${filePath}.ts`, blockContent);
-
-    for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
-      const text = identifier.getText();
-      if (!containsName(text, oldName)) continue;
-
-      const identOffsetInBlock = identifier.getStart();
-      const realOffset = blockStart + identOffsetInBlock;
-      if (excluded.has(`${filePath}:${realOffset}`)) continue;
-
-      const { line, col } = blockOffsetToFilePosition(content, blockStart, identOffsetInBlock);
-      matches.push({
-        file: filePath,
-        line,
-        col,
-        name: text,
-        kind: identifier.getParentOrThrow().getKindName(),
-      });
-    }
-  }
+  for (const block of blocks) {}
 
   return matches;
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/plugins/vue/name-matches.ts:90:26
   const matches: NameMatchSample[] = [];
   for (const block of blocks) {
     const blockStart = block.loc.start.offset;
-    const blockContent = content.slice(blockStart, block.loc.end.offset);
+    const blockContent = content;
     const sourceFile = createThrowawaySourceFile(`${filePath}.ts`, blockContent);
 
statusReason: expected 4 to be 3 // Object.is equality

[Killed] BlockStatement
src/plugins/vue/name-matches.ts:93:86
     const blockContent = content.slice(blockStart, block.loc.end.offset);
     const sourceFile = createThrowawaySourceFile(`${filePath}.ts`, blockContent);
 
-    for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
-      const text = identifier.getText();
-      if (!containsName(text, oldName)) continue;
-
-      const identOffsetInBlock = identifier.getStart();
-      const realOffset = blockStart + identOffsetInBlock;
-      if (excluded.has(`${filePath}:${realOffset}`)) continue;
-
-      const { line, col } = blockOffsetToFilePosition(content, blockStart, identOffsetInBlock);
-      matches.push({
-        file: filePath,
-        line,
-        col,
-        name: text,
-        kind: identifier.getParentOrThrow().getKindName(),
-      });
-    }
+    for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {}
   }
 
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:95:11
 
     for (const identifier of sourceFile.getDescendantsOfKind(SyntaxKind.Identifier)) {
       const text = identifier.getText();
-      if (!containsName(text, oldName)) continue;
+      if (false) continue;
 
       const identOffsetInBlock = identifier.getStart();
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/plugins/vue/name-matches.ts:98:26
       if (!containsName(text, oldName)) continue;
 
       const identOffsetInBlock = identifier.getStart();
-      const realOffset = blockStart + identOffsetInBlock;
+      const realOffset = blockStart - identOffsetInBlock;
       if (excluded.has(`${filePath}:${realOffset}`)) continue;
 
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:99:11
 
       const identOffsetInBlock = identifier.getStart();
       const realOffset = blockStart + identOffsetInBlock;
-      if (excluded.has(`${filePath}:${realOffset}`)) continue;
+      if (false) continue;
 
       const { line, col } = blockOffsetToFilePosition(content, blockStart, identOffsetInBlock);
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/plugins/vue/name-matches.ts:99:11
 
       const identOffsetInBlock = identifier.getStart();
       const realOffset = blockStart + identOffsetInBlock;
-      if (excluded.has(`${filePath}:${realOffset}`)) continue;
+      if (true) continue;
 
       const { line, col } = blockOffsetToFilePosition(content, blockStart, identOffsetInBlock);
statusReason: expected [] to have a length of 1 but got +0
