[Killed] BlockStatement
src/ts-engine/transitive-imports.ts:22:59
   // is O(identifiers) rather than O(identifiers × imports).
   type ImportMeta = { originalName: string; aliasText: string | undefined; importedPath: string };
   const localNameToImport = new Map<string, ImportMeta>();
-  for (const importDecl of srcSF.getImportDeclarations()) {
-    const importedSF = importDecl.getModuleSpecifierSourceFile();
-    if (!importedSF) continue;
-    const importedPath = importedSF.getFilePath() as string;
-    for (const ni of importDecl.getNamedImports()) {
-      const localName = ni.getAliasNode()?.getText() ?? ni.getName();
-      localNameToImport.set(localName, {
-        originalName: ni.getName(),
-        aliasText: ni.getAliasNode()?.getText(),
-        importedPath,
-      });
-    }
-  }
+  for (const importDecl of srcSF.getImportDeclarations()) {}
 
   for (const identifier of declStmt.getDescendantsOfKind(SyntaxKind.Identifier)) {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] BooleanLiteral
src/ts-engine/transitive-imports.ts:24:9
   const localNameToImport = new Map<string, ImportMeta>();
   for (const importDecl of srcSF.getImportDeclarations()) {
     const importedSF = importDecl.getModuleSpecifierSourceFile();
-    if (!importedSF) continue;
+    if (importedSF) continue;
     const importedPath = importedSF.getFilePath() as string;
     for (const ni of importDecl.getNamedImports()) {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:24:9
   const localNameToImport = new Map<string, ImportMeta>();
   for (const importDecl of srcSF.getImportDeclarations()) {
     const importedSF = importDecl.getModuleSpecifierSourceFile();
-    if (!importedSF) continue;
+    if (true) continue;
     const importedPath = importedSF.getFilePath() as string;
     for (const ni of importDecl.getNamedImports()) {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] BlockStatement
src/ts-engine/transitive-imports.ts:26:52
     const importedSF = importDecl.getModuleSpecifierSourceFile();
     if (!importedSF) continue;
     const importedPath = importedSF.getFilePath() as string;
-    for (const ni of importDecl.getNamedImports()) {
-      const localName = ni.getAliasNode()?.getText() ?? ni.getName();
-      localNameToImport.set(localName, {
-        originalName: ni.getName(),
-        aliasText: ni.getAliasNode()?.getText(),
-        importedPath,
-      });
-    }
+    for (const ni of importDecl.getNamedImports()) {}
   }
 
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] LogicalOperator
src/ts-engine/transitive-imports.ts:27:25
     if (!importedSF) continue;
     const importedPath = importedSF.getFilePath() as string;
     for (const ni of importDecl.getNamedImports()) {
-      const localName = ni.getAliasNode()?.getText() ?? ni.getName();
+      const localName = ni.getAliasNode()?.getText() && ni.getName();
       localNameToImport.set(localName, {
         originalName: ni.getName(),
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] OptionalChaining
src/ts-engine/transitive-imports.ts:27:25
     if (!importedSF) continue;
     const importedPath = importedSF.getFilePath() as string;
     for (const ni of importDecl.getNamedImports()) {
-      const localName = ni.getAliasNode()?.getText() ?? ni.getName();
+      const localName = ni.getAliasNode().getText() ?? ni.getName();
       localNameToImport.set(localName, {
         originalName: ni.getName(),
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: Cannot read properties of undefined (reading 'getText')

[Killed] ObjectLiteral
src/ts-engine/transitive-imports.ts:28:40
     const importedPath = importedSF.getFilePath() as string;
     for (const ni of importDecl.getNamedImports()) {
       const localName = ni.getAliasNode()?.getText() ?? ni.getName();
-      localNameToImport.set(localName, {
-        originalName: ni.getName(),
-        aliasText: ni.getAliasNode()?.getText(),
-        importedPath,
-      });
+      localNameToImport.set(localName, {});
     }
   }
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] OptionalChaining
src/ts-engine/transitive-imports.ts:30:20
       const localName = ni.getAliasNode()?.getText() ?? ni.getName();
       localNameToImport.set(localName, {
         originalName: ni.getName(),
-        aliasText: ni.getAliasNode()?.getText(),
+        aliasText: ni.getAliasNode().getText(),
         importedPath,
       });
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: Cannot read properties of undefined (reading 'getText')

[Killed] BooleanLiteral
src/ts-engine/transitive-imports.ts:38:9
 
   for (const identifier of declStmt.getDescendantsOfKind(SyntaxKind.Identifier)) {
     const sym = identifier.getSymbol();
-    if (!sym) continue;
+    if (sym) continue;
     // getAliasedSymbol() is required: for type imports, getSymbol() resolves to
     // the ImportSpecifier in this file, not the declaration in the imported file.
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:38:9
 
   for (const identifier of declStmt.getDescendantsOfKind(SyntaxKind.Identifier)) {
     const sym = identifier.getSymbol();
-    if (!sym) continue;
+    if (true) continue;
     // getAliasedSymbol() is required: for type imports, getSymbol() resolves to
     // the ImportSpecifier in this file, not the declaration in the imported file.
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/ts-engine/transitive-imports.ts:41:25
     if (!sym) continue;
     // getAliasedSymbol() is required: for type imports, getSymbol() resolves to
     // the ImportSpecifier in this file, not the declaration in the imported file.
-    const resolvedSym = sym.getAliasedSymbol() ?? sym;
+    const resolvedSym = sym.getAliasedSymbol() && sym;
     const decls = resolvedSym.getDeclarations();
     if (!decls || decls.length === 0) continue;
statusReason: Cannot read properties of undefined (reading 'getDeclarations')

[Killed] EqualityOperator
src/ts-engine/transitive-imports.ts:43:19
     // the ImportSpecifier in this file, not the declaration in the imported file.
     const resolvedSym = sym.getAliasedSymbol() ?? sym;
     const decls = resolvedSym.getDeclarations();
-    if (!decls || decls.length === 0) continue;
+    if (!decls || decls.length !== 0) continue;
     const resolvedDecl = decls[0];
     if (!resolvedDecl) continue;
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] BooleanLiteral
src/ts-engine/transitive-imports.ts:43:9
     // the ImportSpecifier in this file, not the declaration in the imported file.
     const resolvedSym = sym.getAliasedSymbol() ?? sym;
     const decls = resolvedSym.getDeclarations();
-    if (!decls || decls.length === 0) continue;
+    if (decls || decls.length === 0) continue;
     const resolvedDecl = decls[0];
     if (!resolvedDecl) continue;
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] BooleanLiteral
src/ts-engine/transitive-imports.ts:45:9
     const decls = resolvedSym.getDeclarations();
     if (!decls || decls.length === 0) continue;
     const resolvedDecl = decls[0];
-    if (!resolvedDecl) continue;
+    if (resolvedDecl) continue;
     const resolvedPath = resolvedDecl.getSourceFile().getFilePath() as string;
 
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:45:9
     const decls = resolvedSym.getDeclarations();
     if (!decls || decls.length === 0) continue;
     const resolvedDecl = decls[0];
-    if (!resolvedDecl) continue;
+    if (true) continue;
     const resolvedPath = resolvedDecl.getSourceFile().getFilePath() as string;
 
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:48:9
     if (!resolvedDecl) continue;
     const resolvedPath = resolvedDecl.getSourceFile().getFilePath() as string;
 
-    if (resolvedPath === srcFilePath) continue;
+    if (true) continue;
     if (
       resolvedPath.includes("/typescript/lib/") ||
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] EqualityOperator
src/ts-engine/transitive-imports.ts:48:9
     if (!resolvedDecl) continue;
     const resolvedPath = resolvedDecl.getSourceFile().getFilePath() as string;
 
-    if (resolvedPath === srcFilePath) continue;
+    if (resolvedPath !== srcFilePath) continue;
     if (
       resolvedPath.includes("/typescript/lib/") ||
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:50:7
 
     if (resolvedPath === srcFilePath) continue;
     if (
-      resolvedPath.includes("/typescript/lib/") ||
-      resolvedPath.includes("node_modules/typescript/lib")
+      true
     )
       continue;
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Survived] ConditionalExpression
src/ts-engine/transitive-imports.ts:50:7
 
     if (resolvedPath === srcFilePath) continue;
     if (
-      resolvedPath.includes("/typescript/lib/") ||
-      resolvedPath.includes("node_modules/typescript/lib")
+      false
     )
       continue;

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:56:9
       continue;
 
     const importMeta = localNameToImport.get(identifier.getText());
-    if (!importMeta || importMeta.importedPath !== resolvedPath) continue;
+    if (true) continue;
 
     const { originalName, aliasText, importedPath } = importMeta;
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:56:9
       continue;
 
     const importMeta = localNameToImport.get(identifier.getText());
-    if (!importMeta || importMeta.importedPath !== resolvedPath) continue;
+    if (false) continue;
 
     const { originalName, aliasText, importedPath } = importMeta;
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: Cannot destructure property 'originalName' of 'importMeta' as it is undefined.

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:60:7
 
     const { originalName, aliasText, importedPath } = importMeta;
     const namedImportEntry =
-      aliasText && aliasText !== originalName
+      false
         ? { name: originalName, alias: aliasText }
         : { name: originalName };
killedBy: collectTransitiveImports alias preservation preserves import alias when the declaration uses an aliased import
statusReason: expected [ { name: 'Bar' } ] to deeply equal [ { name: 'Bar', alias: 'B' } ]

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:60:7
 
     const { originalName, aliasText, importedPath } = importMeta;
     const namedImportEntry =
-      aliasText && aliasText !== originalName
+      true
         ? { name: originalName, alias: aliasText }
         : { name: originalName };
killedBy: collectTransitiveImports non-aliased import has no alias property omits alias field when import has no alias
statusReason: expected { name: 'Bar', alias: undefined } to not have property "alias"

[Killed] ObjectLiteral
src/ts-engine/transitive-imports.ts:61:11
     const { originalName, aliasText, importedPath } = importMeta;
     const namedImportEntry =
       aliasText && aliasText !== originalName
-        ? { name: originalName, alias: aliasText }
+        ? {}
         : { name: originalName };
 
killedBy: collectTransitiveImports alias preservation preserves import alias when the declaration uses an aliased import
statusReason: expected [ {} ] to deeply equal [ { name: 'Bar', alias: 'B' } ]

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:64:9
         ? { name: originalName, alias: aliasText }
         : { name: originalName };
 
-    if (!result.has(importedPath)) {
+    if (true) {
       result.set(importedPath, { namedImports: [namedImportEntry], resolvedAbsPath: importedPath });
     } else {
killedBy: collectTransitiveImports deduplication deduplicates multiple references to the same import from the same module
statusReason: expected [ { name: 'Baz' } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:64:9
         ? { name: originalName, alias: aliasText }
         : { name: originalName };
 
-    if (!result.has(importedPath)) {
+    if (false) {
       result.set(importedPath, { namedImports: [namedImportEntry], resolvedAbsPath: importedPath });
     } else {
killedBy: collectTransitiveImports basic import carry returns import entry when declaration references a named import
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/ts-engine/transitive-imports.ts:66:12
 
     if (!result.has(importedPath)) {
       result.set(importedPath, { namedImports: [namedImportEntry], resolvedAbsPath: importedPath });
-    } else {
-      const existing = result.get(importedPath);
-      if (existing && !existing.namedImports.some((ni) => ni.name === namedImportEntry.name)) {
-        existing.namedImports.push(namedImportEntry);
-      }
-    }
+    } else {}
   }
 
killedBy: collectTransitiveImports deduplication deduplicates multiple references to the same import from the same module
statusReason: expected [ { name: 'Bar' } ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/ts-engine/transitive-imports.ts:68:23
       result.set(importedPath, { namedImports: [namedImportEntry], resolvedAbsPath: importedPath });
     } else {
       const existing = result.get(importedPath);
-      if (existing && !existing.namedImports.some((ni) => ni.name === namedImportEntry.name)) {
+      if (existing && existing.namedImports.some(ni => ni.name === namedImportEntry.name)) {
         existing.namedImports.push(namedImportEntry);
       }
killedBy: collectTransitiveImports deduplication deduplicates multiple references to the same import from the same module
statusReason: expected [ { name: 'Bar' } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/ts-engine/transitive-imports.ts:68:59
       result.set(importedPath, { namedImports: [namedImportEntry], resolvedAbsPath: importedPath });
     } else {
       const existing = result.get(importedPath);
-      if (existing && !existing.namedImports.some((ni) => ni.name === namedImportEntry.name)) {
+      if (existing && !existing.namedImports.some((ni) => true)) {
         existing.namedImports.push(namedImportEntry);
       }
killedBy: collectTransitiveImports deduplication deduplicates multiple references to the same import from the same module
statusReason: expected [ { name: 'Bar' } ] to have a length of 2 but got 1
