[Killed] BlockStatement
src/ts-engine/refs-outside-declaration.ts:7:87
  * Returns true if any identifier in `srcSF` outside of `declStmt`'s own subtree
  * resolves to the declaration at `declStmt`.
  */
-export function hasRefsOutsideDeclaration(srcSF: SourceFile, declStmt: Node): boolean {
-  const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
-  for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    if (innerIdentifiers.has(identifier)) continue;
-    const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
-    if (!resolvedDecl) continue;
-    const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
-      ? resolvedDecl.getVariableStatement()
-      : resolvedDecl;
-    if (resolvedStmt === declStmt) return true;
-  }
-  return false;
-}
+export function hasRefsOutsideDeclaration(srcSF: SourceFile, declStmt: Node): boolean {}
 
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] BlockStatement
src/ts-engine/refs-outside-declaration.ts:9:79
  */
 export function hasRefsOutsideDeclaration(srcSF: SourceFile, declStmt: Node): boolean {
   const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
-  for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    if (innerIdentifiers.has(identifier)) continue;
-    const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
-    if (!resolvedDecl) continue;
-    const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
-      ? resolvedDecl.getVariableStatement()
-      : resolvedDecl;
-    if (resolvedStmt === declStmt) return true;
-  }
+  for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {}
   return false;
 }
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] ConditionalExpression
src/ts-engine/refs-outside-declaration.ts:10:9
 export function hasRefsOutsideDeclaration(srcSF: SourceFile, declStmt: Node): boolean {
   const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    if (innerIdentifiers.has(identifier)) continue;
+    if (false) continue;
     const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
     if (!resolvedDecl) continue;
statusReason: expected 'import { greetUser } from "./helpers.…' not to contain 'greetUser'

[Killed] ConditionalExpression
src/ts-engine/refs-outside-declaration.ts:10:9
 export function hasRefsOutsideDeclaration(srcSF: SourceFile, declStmt: Node): boolean {
   const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
-    if (innerIdentifiers.has(identifier)) continue;
+    if (true) continue;
     const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
     if (!resolvedDecl) continue;
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] LogicalOperator
src/ts-engine/refs-outside-declaration.ts:11:28
   const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
     if (innerIdentifiers.has(identifier)) continue;
-    const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
+    const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() && [];
     if (!resolvedDecl) continue;
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Survived] OptionalChaining
src/ts-engine/refs-outside-declaration.ts:11:28
   const innerIdentifiers = new Set(declStmt.getDescendantsOfKind(SyntaxKind.Identifier));
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
     if (innerIdentifiers.has(identifier)) continue;
-    const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
+    const [resolvedDecl] = identifier.getSymbol().getDeclarations() ?? [];
     if (!resolvedDecl) continue;
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)

[Killed] ConditionalExpression
src/ts-engine/refs-outside-declaration.ts:12:9
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
     if (innerIdentifiers.has(identifier)) continue;
     const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
-    if (!resolvedDecl) continue;
+    if (true) continue;
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
       ? resolvedDecl.getVariableStatement()
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] BooleanLiteral
src/ts-engine/refs-outside-declaration.ts:12:9
   for (const identifier of srcSF.getDescendantsOfKind(SyntaxKind.Identifier)) {
     if (innerIdentifiers.has(identifier)) continue;
     const [resolvedDecl] = identifier.getSymbol()?.getDeclarations() ?? [];
-    if (!resolvedDecl) continue;
+    if (resolvedDecl) continue;
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
       ? resolvedDecl.getVariableStatement()
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] EqualityOperator
src/ts-engine/refs-outside-declaration.ts:16:9
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
       ? resolvedDecl.getVariableStatement()
       : resolvedDecl;
-    if (resolvedStmt === declStmt) return true;
+    if (resolvedStmt !== declStmt) return true;
   }
   return false;
killedBy: hasRefsOutsideDeclaration returns false when symbol is only used inside its own declaration returns false when the other function does not reference this declaration
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/refs-outside-declaration.ts:16:9
     const resolvedStmt = Node.isVariableDeclaration(resolvedDecl)
       ? resolvedDecl.getVariableStatement()
       : resolvedDecl;
-    if (resolvedStmt === declStmt) return true;
+    if (true) return true;
   }
   return false;
killedBy: hasRefsOutsideDeclaration returns false when symbol is only used inside its own declaration returns false when the other function does not reference this declaration
statusReason: expected true to be false // Object.is equality
