[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:28:36
   scope: WorkspaceScope,
   options?: { force?: boolean },
 ): Promise<void> {
-  const force = options?.force === true;
+  const force = options?.force === false;
   const project = tsCompiler.getProjectForFile(absSource);
 
statusReason: Symbol 'Foo' already exists as a non-exported declaration in /tmp/ts-movesym-f6vJmC/src/dest.ts. Pass force: true to replace it.

[Killed] OptionalChaining
src/ts-engine/move-symbol.ts:28:17
   scope: WorkspaceScope,
   options?: { force?: boolean },
 ): Promise<void> {
-  const force = options?.force === true;
+  const force = options.force === true;
   const project = tsCompiler.getProjectForFile(absSource);
 
statusReason: Cannot read properties of undefined (reading 'force')

[NoCoverage] BlockStatement
src/ts-engine/move-symbol.ts:32:15
   const project = tsCompiler.getProjectForFile(absSource);
 
   let srcSF = project.getSourceFile(absSource);
-  if (!srcSF) {
-    srcSF = project.addSourceFileAtPath(absSource);
-  }
+  if (!srcSF) {}
 
   const sourceRef = SymbolRef.fromExport(srcSF, symbolName);

[Survived] BooleanLiteral
src/ts-engine/move-symbol.ts:32:7
   const project = tsCompiler.getProjectForFile(absSource);
 
   let srcSF = project.getSourceFile(absSource);
-  if (!srcSF) {
+  if (srcSF) {
     srcSF = project.addSourceFileAtPath(absSource);
   }

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:38:7
 
   const sourceRef = SymbolRef.fromExport(srcSF, symbolName);
 
-  if (!sourceRef.declarationText.trimStart().startsWith("export")) {
+  if (true) {
     throw new EngineError(
       `Symbol '${symbolName}' in ${absSource} is not a direct export. Re-exports via 'export { }' are not supported.`,
statusReason: Symbol 'greetUser' in /tmp/ns-simple-ts-DLwHql/src/utils.ts is not a direct export. Re-exports via 'export { }' are not supported.

[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:38:7
 
   const sourceRef = SymbolRef.fromExport(srcSF, symbolName);
 
-  if (!sourceRef.declarationText.trimStart().startsWith("export")) {
+  if (sourceRef.declarationText.trimStart().startsWith("export")) {
     throw new EngineError(
       `Symbol '${symbolName}' in ${absSource} is not a direct export. Re-exports via 'export { }' are not supported.`,
statusReason: Symbol 'greetUser' in /tmp/ns-simple-ts-Q3RzTa/src/utils.ts is not a direct export. Re-exports via 'export { }' are not supported.

[Survived] BooleanLiteral
src/ts-engine/move-symbol.ts:46:7
   }
 
   const destDir = path.dirname(absDest);
-  if (!scope.fs.exists(destDir)) {
+  if (scope.fs.exists(destDir)) {
     scope.fs.mkdir(destDir, { recursive: true });
   }

[Survived] BlockStatement
src/ts-engine/move-symbol.ts:46:34
   }
 
   const destDir = path.dirname(absDest);
-  if (!scope.fs.exists(destDir)) {
-    scope.fs.mkdir(destDir, { recursive: true });
-  }
+  if (!scope.fs.exists(destDir)) {}
 
   let dstSF: SourceFile;

[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:47:42
 
   const destDir = path.dirname(absDest);
   if (!scope.fs.exists(destDir)) {
-    scope.fs.mkdir(destDir, { recursive: true });
+    scope.fs.mkdir(destDir, { recursive: false });
   }
 
statusReason: ENOENT: no such file or directory, mkdir '/tmp/ns-simple-ts-G2oK14/src/nested/deep'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:51:7
   }
 
   let dstSF: SourceFile;
-  if (scope.fs.exists(absDest)) {
+  if (true) {
     dstSF = project.getSourceFile(absDest) ?? project.addSourceFileAtPath(absDest);
   } else {
statusReason: File not found: /tmp/ns-simple-ts-EFgLev/src/helpers.ts

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:51:7
   }
 
   let dstSF: SourceFile;
-  if (scope.fs.exists(absDest)) {
+  if (false) {
     dstSF = project.getSourceFile(absDest) ?? project.addSourceFileAtPath(absDest);
   } else {
statusReason: Did you mean to provide the overwrite option? A source file already exists at the provided file path: /tmp/ns-simple-ts-bU5oIj/src/helpers.ts

[Survived] LogicalOperator
src/ts-engine/move-symbol.ts:52:13
 
   let dstSF: SourceFile;
   if (scope.fs.exists(absDest)) {
-    dstSF = project.getSourceFile(absDest) ?? project.addSourceFileAtPath(absDest);
+    dstSF = project.getSourceFile(absDest) && project.addSourceFileAtPath(absDest);
   } else {
     dstSF = project.createSourceFile(absDest, "");

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:53:10
   let dstSF: SourceFile;
   if (scope.fs.exists(absDest)) {
     dstSF = project.getSourceFile(absDest) ?? project.addSourceFileAtPath(absDest);
-  } else {
-    dstSF = project.createSourceFile(absDest, "");
-  }
+  } else {}
 
   let destRef: SymbolRef | null = null;
statusReason: Cannot read properties of undefined (reading 'getExportedDeclarations')

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:58:7
   }
 
   let destRef: SymbolRef | null = null;
-  try {
-    destRef = SymbolRef.fromExport(dstSF, symbolName);
-  } catch (err) {
+  try {} catch (err) {
     if (!(err instanceof EngineError) || err.code !== "SYMBOL_NOT_FOUND") {
       throw err;
statusReason: promise resolved "undefined" instead of rejecting

[Survived] BlockStatement
src/ts-engine/move-symbol.ts:60:17
   let destRef: SymbolRef | null = null;
   try {
     destRef = SymbolRef.fromExport(dstSF, symbolName);
-  } catch (err) {
-    if (!(err instanceof EngineError) || err.code !== "SYMBOL_NOT_FOUND") {
-      throw err;
-    }
-  }
+  } catch (err) {}
 
   const symbolExistsInDest = destRef !== null;

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:61:9
   try {
     destRef = SymbolRef.fromExport(dstSF, symbolName);
   } catch (err) {
-    if (!(err instanceof EngineError) || err.code !== "SYMBOL_NOT_FOUND") {
+    if (true) {
       throw err;
     }
statusReason: expected EngineError: Symbol 'FOO' not found as an… { code: '…' } to match object { code: 'SYMBOL_EXISTS' }
(1 matching property omitted from actual)

[Killed] EqualityOperator
src/ts-engine/move-symbol.ts:61:42
   try {
     destRef = SymbolRef.fromExport(dstSF, symbolName);
   } catch (err) {
-    if (!(err instanceof EngineError) || err.code !== "SYMBOL_NOT_FOUND") {
+    if (!(err instanceof EngineError) || err.code === "SYMBOL_NOT_FOUND") {
       throw err;
     }
statusReason: Symbol 'greetUser' not found as an export in /tmp/ns-simple-ts-oDySDg/src/helpers.ts

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:66:30
     }
   }
 
-  const symbolExistsInDest = destRef !== null;
+  const symbolExistsInDest = false;
   if (symbolExistsInDest && !force) {
     throw new EngineError(
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/ts-engine/move-symbol.ts:66:30
     }
   }
 
-  const symbolExistsInDest = destRef !== null;
+  const symbolExistsInDest = destRef === null;
   if (symbolExistsInDest && !force) {
     throw new EngineError(
statusReason: Symbol 'greetUser' already exists as an export in /tmp/ns-simple-ts-QDVc0q/src/helpers.ts. Pass force: true to replace the existing declaration with the source version.

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:67:37
   }
 
   const symbolExistsInDest = destRef !== null;
-  if (symbolExistsInDest && !force) {
-    throw new EngineError(
-      `Symbol '${symbolName}' already exists as an export in ${absDest}. Pass force: true to replace the existing declaration with the source version.`,
-      "SYMBOL_EXISTS",
-    );
-  }
+  if (symbolExistsInDest && !force) {}
 
   if (!symbolExistsInDest) {
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:67:7
   }
 
   const symbolExistsInDest = destRef !== null;
-  if (symbolExistsInDest && !force) {
+  if (true) {
     throw new EngineError(
       `Symbol '${symbolName}' already exists as an export in ${absDest}. Pass force: true to replace the existing declaration with the source version.`,
statusReason: Symbol 'greetUser' already exists as an export in /tmp/ns-simple-ts-IbCofE/src/helpers.ts. Pass force: true to replace the existing declaration with the source version.

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:74:7
     );
   }
 
-  if (!symbolExistsInDest) {
+  if (false) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
     if (nonExportedConflict !== null) {
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:74:7
     );
   }
 
-  if (!symbolExistsInDest) {
+  if (symbolExistsInDest) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
     if (nonExportedConflict !== null) {
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:76:39
 
   if (!symbolExistsInDest) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
-    if (nonExportedConflict !== null) {
-      if (!force) {
-        throw new EngineError(
-          `Symbol '${symbolName}' already exists as a non-exported declaration in ${absDest}. Pass force: true to replace it.`,
-          "SYMBOL_EXISTS",
-        );
-      }
-      nonExportedConflict.remove();
-    }
+    if (nonExportedConflict !== null) {}
   }
 
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:76:9
 
   if (!symbolExistsInDest) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
-    if (nonExportedConflict !== null) {
+    if (true) {
       if (!force) {
         throw new EngineError(
statusReason: Symbol 'greetUser' already exists as a non-exported declaration in /tmp/ns-simple-ts-ILqXSF/src/helpers.ts. Pass force: true to replace it.

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:77:11
   if (!symbolExistsInDest) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
     if (nonExportedConflict !== null) {
-      if (!force) {
+      if (false) {
         throw new EngineError(
           `Symbol '${symbolName}' already exists as a non-exported declaration in ${absDest}. Pass force: true to replace it.`,
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:77:11
   if (!symbolExistsInDest) {
     const nonExportedConflict = findNonExportedDeclaration(dstSF, symbolName);
     if (nonExportedConflict !== null) {
-      if (!force) {
+      if (force) {
         throw new EngineError(
           `Symbol '${symbolName}' already exists as a non-exported declaration in ${absDest}. Pass force: true to replace it.`,
statusReason: promise resolved "undefined" instead of rejecting

[Killed] MethodExpression
src/ts-engine/move-symbol.ts:88:25
   }
 
   // Collect importer paths before any mutations so AST references remain valid.
-  const importerPaths = project
-    .getSourceFiles()
-    .map((sf) => sf.getFilePath() as string)
-    .filter((fp) => fp !== absSource && fp !== absDest);
+  const importerPaths = project.getSourceFiles().map(sf => sf.getFilePath() as string);
 
   // Resolve AST node before removal — needed for identifier walks below.
statusReason: expected 'import { greetUser } from "./helpers.…' not to contain '"./helpers.js"'

[Killed] ArrowFunction
src/ts-engine/move-symbol.ts:90:10
   // Collect importer paths before any mutations so AST references remain valid.
   const importerPaths = project
     .getSourceFiles()
-    .map((sf) => sf.getFilePath() as string)
+    .map(() => undefined)
     .filter((fp) => fp !== absSource && fp !== absDest);
 
statusReason: The "paths[0]" argument must be of type string. Received undefined

[Killed] ArrowFunction
src/ts-engine/move-symbol.ts:91:13
   const importerPaths = project
     .getSourceFiles()
     .map((sf) => sf.getFilePath() as string)
-    .filter((fp) => fp !== absSource && fp !== absDest);
+    .filter(() => undefined);
 
   // Resolve AST node before removal — needed for identifier walks below.
statusReason: expected 'import { greetUser } from "./utils";\…' to contain '"./helpers.js"'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:91:41
   const importerPaths = project
     .getSourceFiles()
     .map((sf) => sf.getFilePath() as string)
-    .filter((fp) => fp !== absSource && fp !== absDest);
+    .filter((fp) => fp !== absSource && true);
 
   // Resolve AST node before removal — needed for identifier walks below.
statusReason: expected 'import { greetUser } from "./helpers.…' not to contain '"./helpers.js"'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:96:34
   // Resolve AST node before removal — needed for identifier walks below.
   const declStmt = resolveDeclarationStatement(srcSF, symbolName);
 
-  const sourceHasRemainingRefs = declStmt !== null && hasRefsOutsideDeclaration(srcSF, declStmt);
+  const sourceHasRemainingRefs = false;
   const transitiveImports = declStmt !== null ? collectTransitiveImports(srcSF, declStmt) : [];
 
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:96:34
   // Resolve AST node before removal — needed for identifier walks below.
   const declStmt = resolveDeclarationStatement(srcSF, symbolName);
 
-  const sourceHasRemainingRefs = declStmt !== null && hasRefsOutsideDeclaration(srcSF, declStmt);
+  const sourceHasRemainingRefs = true;
   const transitiveImports = declStmt !== null ? collectTransitiveImports(srcSF, declStmt) : [];
 
statusReason: expected 'import { greetUser } from "./helpers.…' not to contain 'greetUser'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:97:29
   const declStmt = resolveDeclarationStatement(srcSF, symbolName);
 
   const sourceHasRemainingRefs = declStmt !== null && hasRefsOutsideDeclaration(srcSF, declStmt);
-  const transitiveImports = declStmt !== null ? collectTransitiveImports(srcSF, declStmt) : [];
+  const transitiveImports = false ? collectTransitiveImports(srcSF, declStmt) : [];
 
   sourceRef.remove();
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] EqualityOperator
src/ts-engine/move-symbol.ts:97:29
   const declStmt = resolveDeclarationStatement(srcSF, symbolName);
 
   const sourceHasRemainingRefs = declStmt !== null && hasRefsOutsideDeclaration(srcSF, declStmt);
-  const transitiveImports = declStmt !== null ? collectTransitiveImports(srcSF, declStmt) : [];
+  const transitiveImports = declStmt === null ? collectTransitiveImports(srcSF, declStmt) : [];
 
   sourceRef.remove();
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:101:7
 
   sourceRef.remove();
 
-  if (force && symbolExistsInDest && destRef) {
+  if (true) {
     destRef.remove();
   }
statusReason: Cannot read properties of null (reading 'remove')

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:101:7
 
   sourceRef.remove();
 
-  if (force && symbolExistsInDest && destRef) {
+  if (false) {
     destRef.remove();
   }
statusReason: expected 'export const FOO = 42;\n\nexport cons…' to be 'export const FOO = 1;\n' // Object.is equality

[Killed] MethodExpression
src/ts-engine/move-symbol.ts:106:26
   }
 
   const rewriter = new ImportRewriter();
-  const newImportLines = transitiveImports
-    .filter(
-      (imp) =>
-        !dstSF
-          .getImportDeclarations()
-          .some((id) =>
-            rewriter.matchesDestSpecifier(
-              id.getModuleSpecifierValue(),
-              absDest,
-              imp.resolvedAbsPath,
-            ),
-          ),
-    )
+  const newImportLines = transitiveImports
     .map((imp) => {
       const specifier = computeRelativeImportPath(absDest, imp.resolvedAbsPath);
statusReason: expected [ 'import { Bar }', 'import { Bar }' ] to have a length of 1 but got 2

[Killed] ArrowFunction
src/ts-engine/move-symbol.ts:108:7
   const rewriter = new ImportRewriter();
   const newImportLines = transitiveImports
     .filter(
-      (imp) =>
-        !dstSF
-          .getImportDeclarations()
-          .some((id) =>
-            rewriter.matchesDestSpecifier(
-              id.getModuleSpecifierValue(),
-              absDest,
-              imp.resolvedAbsPath,
-            ),
-          ),
+      () => undefined,
     )
     .map((imp) => {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] MethodExpression
src/ts-engine/move-symbol.ts:109:10
   const newImportLines = transitiveImports
     .filter(
       (imp) =>
-        !dstSF
-          .getImportDeclarations()
-          .some((id) =>
-            rewriter.matchesDestSpecifier(
-              id.getModuleSpecifierValue(),
-              absDest,
-              imp.resolvedAbsPath,
-            ),
-          ),
+        !dstSF.getImportDeclarations().every(id => rewriter.matchesDestSpecifier(id.getModuleSpecifierValue(), absDest, imp.resolvedAbsPath)),
     )
     .map((imp) => {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] BooleanLiteral
src/ts-engine/move-symbol.ts:109:9
   const newImportLines = transitiveImports
     .filter(
       (imp) =>
-        !dstSF
-          .getImportDeclarations()
-          .some((id) =>
-            rewriter.matchesDestSpecifier(
-              id.getModuleSpecifierValue(),
-              absDest,
-              imp.resolvedAbsPath,
-            ),
-          ),
+        dstSF.getImportDeclarations().some(id => rewriter.matchesDestSpecifier(id.getModuleSpecifierValue(), absDest, imp.resolvedAbsPath)),
     )
     .map((imp) => {
statusReason: expected 'export function Foo(b: Bar): string {…' to contain 'import { Bar }'

[Killed] ArrowFunction
src/ts-engine/move-symbol.ts:111:17
       (imp) =>
         !dstSF
           .getImportDeclarations()
-          .some((id) =>
-            rewriter.matchesDestSpecifier(
-              id.getModuleSpecifierValue(),
-              absDest,
-              imp.resolvedAbsPath,
-            ),
+          .some(() => undefined,
           ),
     )
statusReason: expected [ 'import { Bar }', 'import { Bar }' ] to have a length of 1 but got 2

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:119:19
             ),
           ),
     )
-    .map((imp) => {
-      const specifier = computeRelativeImportPath(absDest, imp.resolvedAbsPath);
-      const names = imp.namedImports
-        .map((n) => (n.alias ? `${n.name} as ${n.alias}` : n.name))
-        .join(", ");
-      return `import { ${names} } from "${specifier}";`;
-    });
+    .map((imp) => {});
 
   const existingText = dstSF.getText().trimEnd();
statusReason: expected '\n\nexport function Foo(b: Bar): stri…' to contain 'import { Bar }'

[Killed] ArrowFunction
src/ts-engine/move-symbol.ts:122:14
     .map((imp) => {
       const specifier = computeRelativeImportPath(absDest, imp.resolvedAbsPath);
       const names = imp.namedImports
-        .map((n) => (n.alias ? `${n.name} as ${n.alias}` : n.name))
+        .map(() => undefined)
         .join(", ");
       return `import { ${names} } from "${specifier}";`;
statusReason: expected 'import {  } from "./types.js";\n\nexp…' to contain 'import { Bar }'

[Survived] MethodExpression
src/ts-engine/move-symbol.ts:127:24
       return `import { ${names} } from "${specifier}";`;
     });
 
-  const existingText = dstSF.getText().trimEnd();
+  const existingText = dstSF.getText().trimStart();
   const parts: string[] = [...newImportLines];
   if (existingText.length > 0) parts.push(existingText);

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:129:7
 
   const existingText = dstSF.getText().trimEnd();
   const parts: string[] = [...newImportLines];
-  if (existingText.length > 0) parts.push(existingText);
+  if (false) parts.push(existingText);
   parts.push(sourceRef.declarationText);
   dstSF.replaceWithText(`${parts.join("\n\n")}\n`);
statusReason: expected 'export function greetUser(name: strin…' to contain 'helper'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:129:7
 
   const existingText = dstSF.getText().trimEnd();
   const parts: string[] = [...newImportLines];
-  if (existingText.length > 0) parts.push(existingText);
+  if (true) parts.push(existingText);
   parts.push(sourceRef.declarationText);
   dstSF.replaceWithText(`${parts.join("\n\n")}\n`);
statusReason: expected '\n\nexport const FOO = 1;\n' to be 'export const FOO = 1;\n' // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:135:9
 
   for (const sf of [srcSF, dstSF]) {
     const fp = sf.getFilePath() as string;
-    if (scope.contains(fp)) {
+    if (true) {
       persistSourceFile(sf, scope);
     } else {
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:135:9
 
   for (const sf of [srcSF, dstSF]) {
     const fp = sf.getFilePath() as string;
-    if (scope.contains(fp)) {
+    if (false) {
       persistSourceFile(sf, scope);
     } else {
statusReason: ENOENT: no such file or directory, open '/tmp/ns-simple-ts-kMGNBn/src/helpers.ts'

[Killed] BlockStatement
src/ts-engine/move-symbol.ts:137:12
     const fp = sf.getFilePath() as string;
     if (scope.contains(fp)) {
       persistSourceFile(sf, scope);
-    } else {
-      scope.recordSkipped(fp);
-    }
+    } else {}
   }
 
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:142:7
     }
   }
 
-  if (sourceHasRemainingRefs && scope.contains(absSource)) {
+  if (true) {
     const relPath = computeRelativeImportPath(absSource, absDest);
     const { bom, body } = splitLeadingBom(scope.fs.readFile(absSource));
statusReason: expected 'import { FOO } from "./b.js";\n' not to contain 'FOO'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:142:7
     }
   }
 
-  if (sourceHasRemainingRefs && scope.contains(absSource)) {
+  if (false) {
     const relPath = computeRelativeImportPath(absSource, absDest);
     const { bom, body } = splitLeadingBom(scope.fs.readFile(absSource));
statusReason: expected 'export function Bar(): string { retur…' to contain 'import { Foo }'

[Killed] ConditionalExpression
src/ts-engine/move-symbol.ts:157:7
 export function resolveDeclarationStatement(srcSF: SourceFile, symbolName: string): Node | null {
   const rawDecl = srcSF.getExportedDeclarations().get(symbolName)?.[0];
   if (!rawDecl) return null;
-  if (Node.isVariableDeclaration(rawDecl)) {
+  if (true) {
     return rawDecl.getVariableStatement() ?? null;
   }
statusReason: Cannot read properties of undefined (reading 'getStart')

[Survived] ConditionalExpression
src/ts-engine/move-symbol.ts:157:7
 export function resolveDeclarationStatement(srcSF: SourceFile, symbolName: string): Node | null {
   const rawDecl = srcSF.getExportedDeclarations().get(symbolName)?.[0];
   if (!rawDecl) return null;
-  if (Node.isVariableDeclaration(rawDecl)) {
+  if (false) {
     return rawDecl.getVariableStatement() ?? null;
   }
