[Killed] BlockStatement
src/ts-engine/remove-importers.ts:23:20
   compiler: TsMorphEngine,
   targetFile: string,
   scope: WorkspaceScope,
-): Promise<number> {
-  return removeInProjectImporters(compiler, targetFile, scope);
-}
+): Promise<number> {}
 
 /**
statusReason: expected NaN to be 7 // Object.is equality

[Survived] BlockStatement
src/ts-engine/remove-importers.ts:38:43
   scope: WorkspaceScope,
 ): Promise<number> {
   const project = compiler.getProjectForFile(targetFile);
-  if (!project.getSourceFile(targetFile)) {
-    project.addSourceFileAtPath(targetFile);
-  }
+  if (!project.getSourceFile(targetFile)) {}
 
   let removed = 0;

[Survived] ConditionalExpression
src/ts-engine/remove-importers.ts:38:7
   scope: WorkspaceScope,
 ): Promise<number> {
   const project = compiler.getProjectForFile(targetFile);
-  if (!project.getSourceFile(targetFile)) {
+  if (true) {
     project.addSourceFileAtPath(targetFile);
   }

[Killed] EqualityOperator
src/ts-engine/remove-importers.ts:46:9
 
   for (const sf of project.getSourceFiles()) {
     const filePath = sf.getFilePath() as string;
-    if (filePath === targetFile) continue;
+    if (filePath !== targetFile) continue;
 
     const hasRefs =
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:46:9
 
   for (const sf of project.getSourceFiles()) {
     const filePath = sf.getFilePath() as string;
-    if (filePath === targetFile) continue;
+    if (true) continue;
 
     const hasRefs =
statusReason: expected 2 to be 7 // Object.is equality

[Killed] MethodExpression
src/ts-engine/remove-importers.ts:49:7
     if (filePath === targetFile) continue;
 
     const hasRefs =
-      sf
-        .getImportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
+      sf.getImportDeclarations().every(d => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
       sf
         .getExportDeclarations()
statusReason: expected [ …(3) ] to not include '/tmp/ns-delete-file-ts-PEHYwA/src/iso…'

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:49:7
     if (filePath === targetFile) continue;
 
     const hasRefs =
-      sf
-        .getImportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
-      sf
-        .getExportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
+      false;
 
     if (!hasRefs) continue;
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:51:22
     const hasRefs =
       sf
         .getImportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
+        .some((d) => true) ||
       sf
         .getExportDeclarations()
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/ts-engine/remove-importers.ts:51:15
     const hasRefs =
       sf
         .getImportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
+        .some(() => undefined) ||
       sf
         .getExportDeclarations()
statusReason: expected 4 to be 7 // Object.is equality

[Killed] MethodExpression
src/ts-engine/remove-importers.ts:52:7
       sf
         .getImportDeclarations()
         .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
-      sf
-        .getExportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
+      sf.getExportDeclarations().every(d => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
 
     if (!hasRefs) continue;
statusReason: expected [ …(3) ] to not include '/tmp/ns-delete-file-ts-LcaJmY/src/iso…'

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:54:22
         .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
       sf
         .getExportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
+        .some((d) => true);
 
     if (!hasRefs) continue;
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/ts-engine/remove-importers.ts:54:15
         .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile) ||
       sf
         .getExportDeclarations()
-        .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
+        .some(() => undefined);
 
     if (!hasRefs) continue;
statusReason: expected 5 to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/remove-importers.ts:56:9
         .getExportDeclarations()
         .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
 
-    if (!hasRefs) continue;
+    if (hasRefs) continue;
 
     if (!scope.contains(filePath)) {
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:56:9
         .getExportDeclarations()
         .some((d) => d.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
 
-    if (!hasRefs) continue;
+    if (true) continue;
 
     if (!scope.contains(filePath)) {
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:58:9
 
     if (!hasRefs) continue;
 
-    if (!scope.contains(filePath)) {
+    if (false) {
       scope.recordSkipped(filePath);
       continue;
statusReason: expected [] to include '/tmp/ns-cross-boundary-9NTebk/consume…'

[Killed] BlockStatement
src/ts-engine/remove-importers.ts:58:36
 
     if (!hasRefs) continue;
 
-    if (!scope.contains(filePath)) {
-      scope.recordSkipped(filePath);
-      continue;
-    }
+    if (!scope.contains(filePath)) {}
 
     removed += removeMatchingDeclarations(
statusReason: expected [] to include '/tmp/ns-cross-boundary-CfSzdK/consume…'

[Killed] AssignmentOperator
src/ts-engine/remove-importers.ts:63:5
       continue;
     }
 
-    removed += removeMatchingDeclarations(
-      sf,
-      (decl) => decl.getModuleSpecifierSourceFile()?.getFilePath() === targetFile,
-    );
+    removed -= removeMatchingDeclarations(sf, decl => decl.getModuleSpecifierSourceFile()?.getFilePath() === targetFile);
 
     scope.recordModified(filePath);
statusReason: expected -3 to be 7 // Object.is equality

[Killed] EqualityOperator
src/ts-engine/remove-importers.ts:65:17
 
     removed += removeMatchingDeclarations(
       sf,
-      (decl) => decl.getModuleSpecifierSourceFile()?.getFilePath() === targetFile,
+      (decl) => decl.getModuleSpecifierSourceFile()?.getFilePath() !== targetFile,
     );
 
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:65:17
 
     removed += removeMatchingDeclarations(
       sf,
-      (decl) => decl.getModuleSpecifierSourceFile()?.getFilePath() === targetFile,
+      (decl) => false,
     );
 
statusReason: expected 2 to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/remove-importers.ts:75:13
   // in barrel files) so filesModified stays exhaustive — callers rely on it.
   for (const sf of project.getSourceFiles()) {
     const filePath = sf.getFilePath() as string;
-    if (!sf.isSaved() && scope.contains(filePath)) {
+    if (!sf.sf.isSaved() && scope.contains(filePath)) {
       persistSourceFile(sf, scope);
     }
statusReason: expected 'import type { TargetType } from "./ta…' not to match /from ['"]\.\/target['"]/target['"]

[Killed] BlockStatement
src/ts-engine/remove-importers.ts:91:11
 function removeMatchingDeclarations(
   sf: TsMorphSourceFile,
   predicate: (decl: ImportDeclaration | ExportDeclaration) => boolean,
-): number {
-  let removed = 0;
-  let found = true;
-  while (found) {
-    found = false;
-    for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
-      if (predicate(decl)) {
-        decl.remove();
-        removed++;
-        found = true;
-        break;
-      }
-    }
-  }
-  return removed;
-}
+): number {}
 
statusReason: expected NaN to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/remove-importers.ts:93:15
   predicate: (decl: ImportDeclaration | ExportDeclaration) => boolean,
 ): number {
   let removed = 0;
-  let found = true;
+  let found = false;
   while (found) {
     found = false;
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:94:10
 ): number {
   let removed = 0;
   let found = true;
-  while (found) {
+  while (false) {
     found = false;
     for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
statusReason: expected 2 to be 7 // Object.is equality

[Timeout] BlockStatement
src/ts-engine/remove-importers.ts:94:17
 ): number {
   let removed = 0;
   let found = true;
-  while (found) {
-    found = false;
-    for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
-      if (predicate(decl)) {
-        decl.remove();
-        removed++;
-        found = true;
-        break;
-      }
-    }
-  }
+  while (found) {}
   return removed;
 }

[Timeout] BooleanLiteral
src/ts-engine/remove-importers.ts:95:13
   let removed = 0;
   let found = true;
   while (found) {
-    found = false;
+    found = true;
     for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
       if (predicate(decl)) {

[Killed] BlockStatement
src/ts-engine/remove-importers.ts:96:88
   let found = true;
   while (found) {
     found = false;
-    for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
-      if (predicate(decl)) {
-        decl.remove();
-        removed++;
-        found = true;
-        break;
-      }
-    }
+    for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {}
   }
   return removed;
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ts-engine/remove-importers.ts:97:11
   while (found) {
     found = false;
     for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
-      if (predicate(decl)) {
+      if (false) {
         decl.remove();
         removed++;
statusReason: expected 2 to be 7 // Object.is equality

[Killed] BlockStatement
src/ts-engine/remove-importers.ts:97:28
   while (found) {
     found = false;
     for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
-      if (predicate(decl)) {
-        decl.remove();
-        removed++;
-        found = true;
-        break;
-      }
+      if (predicate(decl)) {}
     }
   }
statusReason: expected 2 to be 7 // Object.is equality

[Killed] UpdateOperator
src/ts-engine/remove-importers.ts:99:9
     for (const decl of [...sf.getImportDeclarations(), ...sf.getExportDeclarations()]) {
       if (predicate(decl)) {
         decl.remove();
-        removed++;
+        removed--;
         found = true;
         break;
statusReason: expected -3 to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ts-engine/remove-importers.ts:100:17
       if (predicate(decl)) {
         decl.remove();
         removed++;
-        found = true;
+        found = false;
         break;
       }
statusReason: expected 5 to be 7 // Object.is equality
