[Killed] LogicalOperator
src/ts-engine/non-exported-declaration.ts:23:7
   symbolName: string,
 ): RemovableDeclaration | null {
   const fn = dstSF.getFunction(symbolName);
-  if (fn && !fn.isExported()) return fn;
+  if (fn || !fn.isExported()) return fn;
   const cls = dstSF.getClass(symbolName);
   if (cls && !cls.isExported()) return cls;
statusReason: Cannot read properties of undefined (reading 'isExported')

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:23:7
   symbolName: string,
 ): RemovableDeclaration | null {
   const fn = dstSF.getFunction(symbolName);
-  if (fn && !fn.isExported()) return fn;
+  if (false) return fn;
   const cls = dstSF.getClass(symbolName);
   if (cls && !cls.isExported()) return cls;
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:25:7
   const fn = dstSF.getFunction(symbolName);
   if (fn && !fn.isExported()) return fn;
   const cls = dstSF.getClass(symbolName);
-  if (cls && !cls.isExported()) return cls;
+  if (true) return cls;
   const iface = dstSF.getInterface(symbolName);
   if (iface && !iface.isExported()) return iface;
statusReason: Symbol 'useCounter' already exists as a non-exported declaration in /tmp/ns-vue-project-EOwNLd/src/composables/useTimer.ts. Pass force: true to replace it.

[Killed] BooleanLiteral
src/ts-engine/non-exported-declaration.ts:25:14
   const fn = dstSF.getFunction(symbolName);
   if (fn && !fn.isExported()) return fn;
   const cls = dstSF.getClass(symbolName);
-  if (cls && !cls.isExported()) return cls;
+  if (cls && cls.isExported()) return cls;
   const iface = dstSF.getInterface(symbolName);
   if (iface && !iface.isExported()) return iface;
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/ts-engine/non-exported-declaration.ts:27:16
   const cls = dstSF.getClass(symbolName);
   if (cls && !cls.isExported()) return cls;
   const iface = dstSF.getInterface(symbolName);
-  if (iface && !iface.isExported()) return iface;
+  if (iface && iface.isExported()) return iface;
   const typeAlias = dstSF.getTypeAlias(symbolName);
   if (typeAlias && !typeAlias.isExported()) return typeAlias;
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:27:7
   const cls = dstSF.getClass(symbolName);
   if (cls && !cls.isExported()) return cls;
   const iface = dstSF.getInterface(symbolName);
-  if (iface && !iface.isExported()) return iface;
+  if (false) return iface;
   const typeAlias = dstSF.getTypeAlias(symbolName);
   if (typeAlias && !typeAlias.isExported()) return typeAlias;
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:29:7
   const iface = dstSF.getInterface(symbolName);
   if (iface && !iface.isExported()) return iface;
   const typeAlias = dstSF.getTypeAlias(symbolName);
-  if (typeAlias && !typeAlias.isExported()) return typeAlias;
+  if (false) return typeAlias;
   const varDecl = dstSF.getVariableDeclaration(symbolName);
   if (varDecl) {
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/ts-engine/non-exported-declaration.ts:29:7
   const iface = dstSF.getInterface(symbolName);
   if (iface && !iface.isExported()) return iface;
   const typeAlias = dstSF.getTypeAlias(symbolName);
-  if (typeAlias && !typeAlias.isExported()) return typeAlias;
+  if (typeAlias || !typeAlias.isExported()) return typeAlias;
   const varDecl = dstSF.getVariableDeclaration(symbolName);
   if (varDecl) {
statusReason: Cannot read properties of undefined (reading 'isExported')

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:31:7
   const typeAlias = dstSF.getTypeAlias(symbolName);
   if (typeAlias && !typeAlias.isExported()) return typeAlias;
   const varDecl = dstSF.getVariableDeclaration(symbolName);
-  if (varDecl) {
+  if (true) {
     const stmt = varDecl.getParent().getParent();
     if (Node.isVariableStatement(stmt)) {
statusReason: Cannot read properties of undefined (reading 'getParent')

[Killed] ConditionalExpression
src/ts-engine/non-exported-declaration.ts:31:7
   const typeAlias = dstSF.getTypeAlias(symbolName);
   if (typeAlias && !typeAlias.isExported()) return typeAlias;
   const varDecl = dstSF.getVariableDeclaration(symbolName);
-  if (varDecl) {
+  if (false) {
     const stmt = varDecl.getParent().getParent();
     if (Node.isVariableStatement(stmt)) {
statusReason: promise resolved "undefined" instead of rejecting
